[
    {
        "Title": "Google Reveals Two New Web Crawlers",
        "Category": "SEO",
        "Description": "Google has introduced two new web crawlers: GoogleOther-Image & GoogleOther-Video.",
        "Link": "https://www.seroundtable.com/googleother-image-and-googleother-video-37412.html"
    },
    {
        "Title": "EU Demands Microsoft Provide Data on Bing AI Risks or Face Fines",
        "Category": "AI",
        "Description": "The European Commission has given Microsoft a deadline of May 27 to provide information on risks stemming from generative AI features in Bing, or face potential fines.",
        "Link": "https://www.reuters.com/technology/eu-demands-clarity-microsoft-ai-risks-bing-2024-05-17/"
    },
    {
        "Title": "Microsoft PC Manager Promotes Bing as Default Search Engine for 'PC Repair'",
        "Category": "Search",
        "Description": "Microsoft's PC Manager app suggests using Bing as the default search engine as a way to 'repair' Windows 11 devices, sparking debate about the company's tactics.",
        "Link": "https://www.digitaltrends.com/computing/microsoft-fixes-your-computer-pc-manager-cleanup/"
    },
    {
        "Title": "Google Ads AI Summaries Rolling Out to Advertisers",
        "Category": "Paid Marketing",
        "Description": "Google Ads is reportedly rolling out AI-powered summaries to provide insights into campaign performance for some advertisers.",
        "Link": "https://www.seroundtable.com/google-ads-ai-summaries-37410.html"
    },
    {
        "Title": "Order with Google Integration to be Discontinued",
        "Category": "Search",
        "Description": "Google's 'Order with Google' integration for food delivery services like Uber Eats, DoorDash, and Grubhub will be discontinued at the end of June.",
        "Link": "https://www.seroundtable.com/order-with-google-discontinued-37399.html"
    },
    {
        "Title": "Users Seek Ways to Remove Content from Google's AI Overviews",
        "Category": "SEO",
        "Description": "SEOs and users are exploring methods, such as using the 'nosnippet' tag, to remove their content from Google's AI Overviews, indicating concerns about content control and visibility.",
        "Link": "https://www.seroundtable.com/remove-your-content-from-googles-ai-overviews-37409.html"
    },
    {
        "Title": "Former Bing AI Head Joins Perplexity Advisor Board",
        "Category": "AI",
        "Description": "Mikhail Parakhin, the former head of Bing Search, AI, and Ads at Microsoft, has joined the advisory board of Perplexity, an AI search startup, signaling potential competition in the AI search space.",
        "Link": "https://www.seroundtable.com/mikhail-parakhin-joins-perplexity-advisor-board-37411.html"
    },
    {
        "Title": "TikTok Testing 60-Minute Video Uploads",
        "Category": "Social Media",
        "Description": "TikTok is currently testing the ability for users to upload videos up to 60 minutes long, potentially impacting content creation and consumption habits on the platform.",
        "Link": "https://searchengineland.com/tiktok-testing-60-minute-video-uploads-440588"
    },
    {
        "Title": "Google Locks Down Complaints Of Image Thumbnails Not Showing In Search",
        "Category": "SEO",
        "Description": "Google has locked down a support thread where users were complaining about image thumbnails not appearing in search results. The issue has been ongoing for months, and Google acknowledges it but has stopped responding to specific complaints.",
        "Link": "https://www.seroundtable.com/google-complaints-image-thumbnails-locked-37408.html"
    },
    {
        "Title": "EU demands more information from Microsoft on Bing's AI risks or face fines",
        "Category": "Search",
        "Description": "The European Commission has given Microsoft a deadline of May 27 to provide information about the risks associated with generative AI in its Bing search engine, including concerns about deepfakes and false news. Failure to comply could result in fines.",
        "Link": "https://www.reuters.com/technology/eu-demands-clarity-microsoft-ai-risks-bing-2024-05-17/"
    },
    {
        "Title": "Microsoft's PC Manager App Promotes Bing as a 'PC Repair' Solution",
        "Category": "Search",
        "Description": "Microsoft's PC Manager app recommends using Bing as the default search engine as part of its PC optimization process, prompting criticism for pushing its search engine as a solution for system issues.",
        "Link": "https://www.extremetech.com/computing/microsoft-pc-manager-app-fixes-your-pc-by-restoring-bing-as-the-default"
    },
    {
        "Title": "Mikhail Parakhin, Former Head of Bing, Joins Perplexity's Advisory Board",
        "Category": "Search",
        "Description": "Former Bing Search, AI, and Ads Head, Mikhail Parakhin, has joined the advisory board of Perplexity, an AI search startup, signaling a potential shift in the AI search landscape.",
        "Link": "https://www.seroundtable.com/mikhail-parakhin-joins-perplexity-advisor-board-37411.html"
    },
    {
        "Title": "Google Adds Two New Web Crawlers: GoogleOther-Image & GoogleOther-Video",
        "Category": "Search",
        "Description": "Google has introduced two new web crawlers, GoogleOther-Image and GoogleOther-Video,  potentially impacting how images and videos are crawled and indexed by Google.",
        "Link": "https://www.seroundtable.com/googleother-image-and-googleother-video-37412.html"
    },
    {
        "Title": "'Order with Google' for Food Delivery to End in June",
        "Category": "Search",
        "Description": "Google is discontinuing its 'Order with Google' feature for food delivery by the end of June, signaling a shift in its food delivery strategy.",
        "Link": "https://www.seroundtable.com/order-with-google-discontinued-37399.html"
    },
    {
        "Title": "Google Locks Down Support Thread Regarding Image Thumbnail Issues",
        "Category": "Search",
        "Description": "Google has locked down a support thread discussing ongoing issues with image thumbnails not appearing in search results, acknowledging the problem but providing limited response to specific complaints.",
        "Link": "https://www.seroundtable.com/google-complaints-image-thumbnails-locked-37408.html"
    },
    {
        "Title": "Google Ads AI Summaries Rolling Out to Some Advertisers",
        "Category": "Paid Marketing",
        "Description": "Google Ads is rolling out AI-powered summaries to some advertisers, providing automated insights and analysis of campaign performance.",
        "Link": "https://www.seroundtable.com/google-ads-ai-summaries-37410.html"
    },
    {
        "Title": "TikTok Expands Video Length Limit with 60-minute Test",
        "Category": "Internet",
        "Description": "TikTok is testing 60-minute video uploads, expanding its video length options and potentially attracting a wider range of content creators and viewers.",
        "Link": "https://searchengineland.com/tiktok-testing-60-minute-video-uploads-440588"
    },
    {
        "Title": "Martech Investment Declines Sharply",
        "Category": "Internet",
        "Description": "Investment in martech companies has dropped by 87% compared to the first quarter of 2023, indicating a significant slowdown in the martech sector.",
        "Link": "https://martech.org/investment-in-martech-companies-down-87-vs-q1-of-2023/"
    },
    {
        "Title": "How Marketers are Adapting to Cookieless Strategies",
        "Category": "Paid Marketing",
        "Description": "With the ongoing delay of third-party cookie deprecation, marketers are implementing cookieless strategies, including focusing on first-party data and exploring alternative solutions like contextual advertising.",
        "Link": "https://digiday.com/sponsored/how-marketers-are-rolling-out-cookieless-strategies-in-2024/"
    },
    {
        "Title": "'Order with Google' Integration to be Discontinued",
        "Category": "Search",
        "Description": "Google's 'Order with Google' integration for food delivery services like Uber Eats, DoorDash, and GrubHub will be discontinued at the end of June.",
        "Link": "https://www.seroundtable.com/order-with-google-discontinued-37399.html"
    },
    {
        "Title": "Google Locks Down Complaints of Image Thumbnails Not Showing in Search",
        "Category": "SEO",
        "Description": "Google has locked down a support thread addressing complaints about image thumbnails not appearing in search results, acknowledging the issue but providing no specific solutions.",
        "Link": "https://www.seroundtable.com/google-complaints-image-thumbnails-locked-37408.html"
    },
    {
        "Title": "YouTube Unveils New Content and Ad Offerings at Brandcast",
        "Category": "Paid Marketing",
        "Description": "YouTube announced new content and advertising offerings at its Brandcast event, focusing on attracting new audiences and enhancing advertising opportunities.",
        "Link": "https://www.searchenginejournal.com/youtube-unveils-new-content-and-ad-offerings-at-brandcast/516466/"
    }
]