{
    "valid_articles": [
        {
            "Title": "SEO in the Age of Generative AI: Mastering Topical Authority and Content Strategy with Bernard Huang",
            "Description": "Learn the new way to approach topical authority and how to use content to build trust in a landscape flooded with commoditized information.",
            "Link": "https://www.skyword.com/contentstandard/seo-in-the-age-of-generative-ai-mastering-topical-authority-and-content-strategy-with-bernard-huang/"
        },
        {
            "Title": "@aleyda: It's 🤯 to see how YouTube and Reddit are among the top sites attracting the most organic search traffic across so many verticals for both informational and also transactional queries. For example, I'm analyzing the click behavior for organic SERPs for \"best\" and \"buy\" top 100…",
            "Description": "YouTube and Reddit are attracting the most organic search traffic across many verticals for both informational and transactional queries.",
            "Link": "https://twitter.com/aleyda/status/1807885358073565525"
        },
        {
            "Title": "@rustybrick: Some sites hit by the September Google helpful content update are seeing small lifts",
            "Description": "Some websites affected by the September 2023 Google helpful content update are experiencing minor improvements in rankings.",
            "Link": "https://twitter.com/rustybrick/status/1807848143276630334"
        },
        {
            "Title": "@rustybrick: Google explains why soft 404 errors are a bad thing",
            "Description": "Google provides an explanation on why soft 404 errors are detrimental to website health and search engine optimization.",
            "Link": "https://twitter.com/rustybrick/status/1807844368428290550"
        },
        {
            "Title": "@rustybrick: Google Maps reviews troubleshooting guide and FAQs",
            "Description": "Google has released a troubleshooting guide and FAQs specifically for Google Maps reviews, addressing common issues and questions.",
            "Link": "https://twitter.com/rustybrick/status/1807840593587970210"
        },
        {
            "Title": "@rustybrick: Google Search tests top quality store badge next to the site name",
            "Description": "Google Search is experimenting with a \"top quality store\" badge displayed alongside website names in search results, potentially influencing user trust and click-through rates.",
            "Link": "https://twitter.com/rustybrick/status/1807836818886336927"
        },
        {
            "Title": "@rustybrick: New Bing Webmaster Guideline - Prompt injection",
            "Description": "Bing has introduced a new webmaster guideline addressing prompt injection, a security vulnerability that can be exploited to manipulate AI-powered systems.",
            "Link": "https://twitter.com/rustybrick/status/1807833043765248078"
        },
        {
            "Title": "@aleyda: The latest in Digital Marketing from today's #MarketingFOMO 👀 * Brands Fear TikTok Shops Promo Pullback Will Dent Revenue * \"Reddit is My Surprising Secret to Marketing Success: Here’s How I’ve Used it to Grow My Business\" * Google Ads unveils major updates to search query…",
            "Description": "Digital marketing news roundup: Brands concerned about TikTok Shop promo changes, Reddit's marketing potential highlighted, and Google Ads search query updates.",
            "Link": "https://twitter.com/aleyda/status/1807818640093597921"
        },
        {
            "Title": "@rustybrick: Some sites hit by the September Google helpful content update are seeing small lifts",
            "Description": "Some websites negatively impacted by the September 2023 Google helpful content update are now observing slight recoveries in their rankings.",
            "Link": "https://twitter.com/rustybrick/status/1807787745206751442"
        },
        {
            "Title": "@rustybrick: Google explains why soft 404 errors are a bad thing seroundtable.com/google-on-why-…",
            "Description": "Google emphasizes the negative implications of soft 404 errors on website performance and search engine optimization.",
            "Link": "https://twitter.com/rustybrick/status/1807783970735632815"
        },
        {
            "Title": "@rustybrick: Google Maps reviews troubleshooting guide and FAQs",
            "Description": "Google provides resources for troubleshooting issues and finding answers to frequently asked questions related to Google Maps reviews.",
            "Link": "https://twitter.com/rustybrick/status/1807780195614487002"
        },
        {
            "Title": "@rustybrick: Google Search tests top quality store badge next to the site name",
            "Description": "Google is conducting tests on a \"top quality store\" badge displayed next to website names in search results, potentially impacting user perception and click-through rates.",
            "Link": "https://twitter.com/rustybrick/status/1807776420867068171"
        },
        {
            "Title": "@rustybrick: New Bing Webmaster Guideline - Prompt injection",
            "Description": "Bing introduces a new webmaster guideline focused on preventing prompt injection, a security concern that can be used to manipulate AI systems.",
            "Link": "https://twitter.com/rustybrick/status/1807772645842108497"
        },
        {
            "Title": "@glenngabe: Apple could announce a Google Gemini deal this fall, giving users chatbot options",
            "Description": "Speculation arises that Apple might announce a partnership with Google Gemini, potentially integrating Google's chatbot technology into Apple products.",
            "Link": "https://twitter.com/glenngabe/status/1807759070650049018"
        },
        {
            "Title": "@glenngabe: Remember, soft 404s do impact crawl budget while hard 404s don't impact crawl budget.",
            "Description": "A reminder that soft 404 errors affect a website's crawl budget, while hard 404 errors do not have the same impact.",
            "Link": "https://twitter.com/glenngabe/status/1807748435233157259"
        },
        {
            "Title": "Reports of some sites hit by the Sep. Google helpful content update are seeing small lifts (very small)",
            "Description": "Reports of some sites hit by the September 2024 Google helpful content update are seeing small lifts (very small)",
            "Link": "https://twitter.com/rustybrick/status/1807743705220010492"
        },
        {
            "Title": "Google On Why Soft 404s Are Bad",
            "Description": "Gary Illyes from Google explained two reasons why soft 404 errors are bad.  Soft 404s are when a page returns a 200 status okay, but Google thinks that page should return a 404 page not found error.  According to Gary, soft 404s are bad because they (1) limit crawl budget and (2) the pages won't likely show up in Google Search.",
            "Link": "https://www.seroundtable.com/google-on-why-soft-404s-are-bad-37646.html"
        },
        {
            "Title": "Google explains why soft 404 errors are a bad thing (1) limits crawl budget (2) they often do not rank in search",
            "Description": "Google explains why soft 404 errors are a bad thing (1) limits crawl budget (2) they often do not rank in search",
            "Link": "https://twitter.com/rustybrick/status/1807741188478578856"
        },
        {
            "Title": "Google posts a troubleshooting guide and FAQs around review management",
            "Description": "Google posts a troubleshooting guide and FAQs around review management",
            "Link": "https://twitter.com/rustybrick/status/1807738672097157569"
        },
        {
            "Title": "Google Search is testing top quality store badge next to the site name in the snippet (moving it up from the bottom)",
            "Description": "Google Search is testing top quality store badge next to the site name in the snippet (moving it up from the bottom)",
            "Link": "https://twitter.com/rustybrick/status/1807736155405779124"
        },
        {
            "Title": "Bing Adds Prompt Injection To Bing Webmaster Guidelines",
            "Description": "Bing added a new guideline to its Bing Webmaster Guidelines named Prompt Injection.  A prompt injection is a type of cyberattack against large language models (LLMs). Hackers disguise malicious inputs as legitimate prompts, manipulating generative AI systems (GenAI) into leaking sensitive data, spreading misinformation, or worse, according to IBM.",
            "Link": "https://www.seroundtable.com/prompt-injection-bing-webmaster-guidelines-37650.html"
        },
        {
            "Title": "Bing adds new Bing Webmaster Guideline for \"Prompt injection\"",
            "Description": "Bing adds new Bing Webmaster Guideline for \"Prompt injection\"",
            "Link": "https://twitter.com/rustybrick/status/1807733638752055558"
        },
        {
            "Title": "Tracking AI Overviews Queries, Links",
            "Description": "Organic search optimization now requires knowing which queries trigger AI Overviews and the URLs those summaries reference. Neither metric — queries or links — is easily identified.",
            "Link": "https://www.practicalecommerce.com/tracking-ai-overviews-queries-links"
        },
        {
            "Title": "Organic link building for sales landing pages",
            "Description": "Great links to your content are essential, but they alone may not be enough to improve rankings for your sales landing pages.",
            "Link": "https://searchengineland.com/organic-link-building-for-sales-landing-pages-443378"
        },
        {
            "Title": "The upfront market is only now picking up steam, as buyers push pricing rollbacks on streamers",
            "Description": "Among the newer developments as deals get negotiated and cut are the inclusion of more sports inventory, and the pricing rollbacks that buyer are demanding of the main streaming services.",
            "Link": "https://digiday.com/media-buying/the-upfront-market-is-only-now-picking-up-steam-as-buyers-push-pricing-rollbacks-on-streamers/"
        },
        {
            "Title": "AI Briefing: The music industry raises the decibel for the fight over generative AI",
            "Description": "Recent weeks have been marked by a flurry of announcements from industry giants and startups alike.",
            "Link": "https://digiday.com/media/ai-briefing-the-music-industry-raises-the-decibel-for-the-fight-over-generative-ai/"
        },
        {
            "Title": "After months of testing, Google faces growing pressure to revamp the Privacy Sandbox",
            "Description": "Six months after Google began phasing out third-party cookies in Chrome, the verdict on its alternatives is unchanged",
            "Link": "https://digiday.com/marketing/after-months-of-testing-google-faces-growing-pressure-to-revamp-the-privacy-sandbox/"
        },
        {
            "Title": "Media Buying Briefing: How agencies balance media and creative as AI projects ramp up",
            "Description": "As media agencies develop more artificial intelligence-driven work, they are relying on data and media tools to inform the creative side.",
            "Link": "https://digiday.com/media-buying/media-buying-briefing-how-agencies-balance-media-and-creative-as-ai-projects-ramp-up/"
        },
        {
            "Title": "VidCon’s Gen Z attendees speak out on YouTube, TikTok, Instagram, ads & AI",
            "Description": "At this year’s VidCon, more than a dozen Gen Z attendees weighed in on the video apps they most and least like to watch, the ads they’re served and creators’ use of generative AI tools.",
            "Link": "https://digiday.com/future-of-tv/vidcons-gen-z-attendees-speak-out-on-youtube-tiktok-instagram-ads-ai/"
        },
        {
            "Title": "My top insight from watching the #EURO2024 so far: Broccoli haircut is the trend Gen Z men will likely look back in a few decades and make them double question their taste 😅😂🥴",
            "Description": "A social media post observing a trend among young men at the EURO2024 soccer tournament.",
            "Link": "https://twitter.com/aleyda/status/1807492143986233436"
        },
        {
            "Title": "Remember, there has been a ton of volatility since 5/3... And I have seen confirmed drops and surges this past week, with several late in the week, including some sites dropping out of Discover big-time. Google is clearly testing something big. Could be the next core update,…",
            "Description": "Speculation about a potential Google algorithm update based on observed search ranking volatility.",
            "Link": "https://twitter.com/glenngabe/status/1807399509833502962"
        },
        {
            "Title": "Weekend Google Search ranking volatility with the June 28th/29th unconfirmed Google update seroundtable.com/weekend-google…",
            "Description": "Reports of Google search ranking fluctuations over a weekend, potentially indicating an unconfirmed algorithm update.",
            "Link": "https://twitter.com/rustybrick/status/1807388534237503642"
        },
        {
            "Title": "Another publisher deal -> OpenAI and Time strike multiyear deal to improve ChatGPT with journalistic content (to access current and archived articles from more than 100 years of Time’s history) \"The news follows a similar partnership announced by OpenAI and News Corp. in May,",
            "Description": "OpenAI partners with Time magazine to provide ChatGPT with access to its archive of journalistic content.",
            "Link": "https://twitter.com/glenngabe/status/1807380226483052989"
        },
        {
            "Title": "This would be a great addition -> YouTube might finally let you upload custom thumbnails for playlists \"It's currently possible to switch the playlist's thumbnail using the Set as playlist thumbnail option (web only). However, users can only choose a thumbnail from one of the",
            "Description": "Rumor that YouTube may soon allow users to upload custom thumbnails for their playlists.",
            "Link": "https://twitter.com/glenngabe/status/1807379159426990236"
        },
        {
            "Title": "Google June 2024 spam update is now complete - here is everything I know * Quick Facts * Volatility Tracking * Details on…",
            "Description": "Announcement of the completion of Google's June 2024 spam update, along with information and analysis.",
            "Link": "https://twitter.com/rustybrick/status/1806656541376086189"
        },
        {
            "Title": "There are 122 people registered for the next #SEOFOMO x @DigitalOlympus Meetup in Amsterdam on September 13 👀 and in just a few days we will announce the final list of SEOs who will join the 🔥 roundtables and you'll be 🤩! We will discuss the latest SEO trends, Google Doc…",
            "Description": "Announcement of an upcoming SEO meetup in Amsterdam, featuring discussions on the latest SEO trends and Google updates.",
            "Link": "https://twitter.com/aleyda/status/1807045532709179397"
        },
        {
            "Title": "Saturday morning is a great time to read my latest post about the Ad Experience Report in GSC. What started as a brilliant idea led to a confusing, and misleading, report for site owners. If only there was a report that accurately reflected the ad aggressiveness situation on",
            "Description": "Critique of the Ad Experience Report in Google Search Console, arguing that it is confusing and misleading for website owners.",
            "Link": "https://twitter.com/glenngabe/status/1807031958188257423"
        },
        {
            "Title": "YouTube Q&A from @YouTubeLiaison -> 🙋Q&A: “Why do my videos occasionally pop off and get more views only to die down again?” A: \"The algorithm never gives up on a video. So, even after a video has been out for a while and everyone who was initially recommended it either clicked",
            "Description": "Explanation from a YouTube liaison about how the platform's algorithm continues to recommend videos even after their initial popularity has waned.",
            "Link": "https://twitter.com/glenngabe/status/1807029692383273139"
        },
        {
            "Title": "Oof #2 this morning -> Quora-owned AI chatbot platform Poe is providing users with downloadable HTML files of paywalled articles from outlets including NYT, Forbes, and The Atlantic \"WIRED was similarly able to retrieve articles from paywalled sites including The New York",
            "Description": "Report that Quora's AI chatbot platform, Poe, is allowing users to access paywalled articles from major publications.",
            "Link": "https://twitter.com/glenngabe/status/1807027310232563919"
        },
        {
            "Title": "Oof -> Microsoft AI CEO Mustafa Suleyman says content on the open web is “freeware” that anyone can copy or use to reproduce, due to the fair use “social contract” \"With respect to content that is already on the open web, the social contract of that content since the 90s has",
            "Description": "Controversy surrounding comments made by Microsoft's AI CEO, who claimed that content on the open web is \"freeware\" due to fair use principles.",
            "Link": "https://twitter.com/glenngabe/status/1807026643820507532"
        },
        {
            "Title": "Gemini Nano -> EU competition chief Margrethe Vestager says the EU is seeking information “to better understand” Google's deal with Samsung to pre-install Gemini Nano on certain Samsung devices \"Google in January reached a multi-year deal with the South Korean company to embed",
            "Description": "The European Union is investigating Google's deal with Samsung to pre-install its Gemini Nano AI on certain Samsung devices.",
            "Link": "https://twitter.com/glenngabe/status/1807025587409559999"
        },
        {
            "Title": "The June 2024 Spam Update finished rolling out on June 27:",
            "Description": "Confirmation that Google's June 2024 Spam Update has finished rolling out.",
            "Link": "https://twitter.com/aleyda/status/1807025511966683400"
        },
        {
            "Title": "You got to be kidding. “Fair use” he says. Fair use is to consume the information as a user following the site conditions. It doesn’t involve to copy, reuse, for commercial purposes, and if you intend to do so, you should ask for permission and and pay whatever requested if…",
            "Description": "Criticism of the concept of \"fair use\" in the context of using copyrighted content for commercial purposes.",
            "Link": "https://twitter.com/aleyda/status/1807015089880326461"
        }
    ],
    "reviewed_urls": [
        "https://news.bloomberglaw.com/ip-law/apple-bing-maps-draw-latest-never-search-tech-patent-suits",
        "https://www.skyword.com/contentstandard/seo-in-the-age-of-generative-ai-mastering-topical-authority-and-content-strategy-with-bernard-huang/",
        "https://twitter.com/aleyda/status/1807885358073565525",
        "https://twitter.com/rustybrick/status/1807870141599785125",
        "https://twitter.com/rustybrick/status/1807866106071470470",
        "https://twitter.com/rustybrick/status/1807848143276630334",
        "https://twitter.com/rustybrick/status/1807844368428290550",
        "https://twitter.com/rustybrick/status/1807840593587970210",
        "https://twitter.com/rustybrick/status/1807836818886336927",
        "https://twitter.com/rustybrick/status/1807833043765248078",
        "https://twitter.com/rustybrick/status/1807829268975529998",
        "https://mitechnews.com/guest-columns/what-is-the-bing-redirect-virus-and-how-can-you-remove-it-from-your-mac/",
        "https://twitter.com/aleyda/status/1807820989851701677",
        "https://twitter.com/sengineland/status/1807818371297149258",
        "https://twitter.com/aleyda/status/1807818640093597921",
        "https://twitter.com/rustybrick/status/1807787745206751442",
        "https://twitter.com/rustybrick/status/1807783970735632815",
        "https://twitter.com/sengineland/status/1807776654120431937",
        "https://twitter.com/rustybrick/status/1807780195614487002",
        "https://twitter.com/rustybrick/status/1807776768780058875",
        "https://twitter.com/rustybrick/status/1807776420867068171",
        "https://twitter.com/rustybrick/status/1807772645842108497",
        "https://twitter.com/BritneyMuller/status/1807770303881228781",
        "https://twitter.com/mjcachon/status/1807769338121720250",
        "https://twitter.com/rustybrick/status/1807768871283097720",
        "https://twitter.com/glenngabe/status/1807759070650049018",
        "https://www.practicalecommerce.com/10-new-ecommerce-books-for-summer-2024",
        "https://twitter.com/rustybrick/status/1807752810659729765",
        "https://twitter.com/rustybrick/status/1807748738317984103",
        "https://twitter.com/glenngabe/status/1807748435233157259",
        "https://www.streetinsider.com/Newsfile/LinkVector+Reveals+New+E-Book%2C+Google+Patents+Revealed%3A+Surprising+Secrets+Of+Internal+Linking+That+Lead+to+Top+Rankings/23419849.html",
        "https://twitter.com/rustybrick/status/1807743705220010492",
        "https://www.seroundtable.com/google-on-why-soft-404s-are-bad-37646.html",
        "https://twitter.com/rustybrick/status/1807741188478578856",
        "https://twitter.com/glenngabe/status/1807740906205835490",
        "https://twitter.com/rustybrick/status/1807738672097157569",
        "https://twitter.com/rustybrick/status/1807736155405779124",
        "https://twitter.com/rustybrick/status/1807733638752055558",
        "https://www.seroundtable.com/prompt-injection-bing-webmaster-guidelines-37650.html",
        "https://twitter.com/rustybrick/status/1807733638752055558",
        "https://www.practicalecommerce.com/tracking-ai-overviews-queries-links",
        "https://twitter.com/rustybrick/status/1807730879420092437",
        "https://searchengineland.com/organic-link-building-for-sales-landing-pages-443378",
        "https://gulfnews.com/business/corporate-news/seo-tech-experts-launches-proven-seo-services-in-dubai-uae-1.1719830773309",
        "https://twitter.com/rustybrick/status/1807722475385491758",
        "https://medium.com/@terrificminds/enhanced-seo-in-next-js-035f49aaeba6",
        "https://indiaeducationdiary.in/tsinghua-university-welcomes-un-world-food-programmes-zhao-bing/",
        "https://twitter.com/aleyda/status/1807707927253258424",
        "https://www.einnews.com/pr_news/724245032/yourseoboard-introduces-customizable-seo-dashboard-for-white-label-solutions",
        "https://www.searchenginejournal.com/top-10-digital-marketing-trends-for-2024/519612/",
        "https://www.martechcube.com/net-announces-digital-marketing-seo-and-link-building-services/",
        "https://twitter.com/sitebulb/status/1807670510081228975",
        "http://officechai.com/miscellaneous/top-5-seo-techniques-to-boost-your-saas-business-in-2024/",
        "https://digiday.com/media-buying/the-upfront-market-is-only-now-picking-up-steam-as-buyers-push-pricing-rollbacks-on-streamers/",
        "https://digiday.com/media/ai-briefing-the-music-industry-raises-the-decibel-for-the-fight-over-generative-ai/",
        "https://digiday.com/marketing/after-months-of-testing-google-faces-growing-pressure-to-revamp-the-privacy-sandbox/",
        "https://digiday.com/media-buying/media-buying-briefing-how-agencies-balance-media-and-creative-as-ai-projects-ramp-up/",
        "https://digiday.com/future-of-tv/vidcons-gen-z-attendees-speak-out-on-youtube-tiktok-instagram-ads-ai/",
        "https://twitter.com/aleyda/status/1807527924867993900",
        "https://twitter.com/aleyda/status/1807499228224057686",
        "https://www.larkinmortuary.com/obituary/view/bing-zhang",
        "https://twitter.com/aleyda/status/1807492143986233436",
        "https://twitter.com/aleyda/status/1807478474841723025",
        "https://twitter.com/aleyda/status/1807409314228744538",
        "https://twitter.com/glenngabe/status/1807399509833502962",
        "https://www.jumpstartmag.com/5-essential-on-page-seo-tools-to-boost-your-websites-ranking/",
        "https://twitter.com/rustybrick/status/1807388534237503642",
        "https://twitter.com/glenngabe/status/1807386796633797026",
        "https://www.practicalecommerce.com/5-content-marketing-ideas-for-august",
        "https://www.mid-day.com/brand-media/tech/article/revlon-india-chooses-d2s-technologies-as-their-seo-partner-1514",
        "https://twitter.com/glenngabe/status/1807380226483052989",
        "https://twitter.com/glenngabe/status/1807379159426990236",
        "https://www.standard-journal.com/ap/state/article_8dda73d4-5ce2-593d-907e-7a65efd7c8f8.html",
        "https://twitter.com/rustybrick/status/1806656541376086189",
        "https://uk.movies.yahoo.com/inside-2-bing-bong-easter-184800485.html",
        "https://medium.com/@rjlbq0k8au0d/how-to-stay-updated-on-rss3-airdrop-opportunities-c1edd66d698d",
        "https://twitter.com/aleyda/status/1807045532709179397",
        "https://twitter.com/glenngabe/status/1807031958188257423",
        "https://twitter.com/glenngabe/status/1807029692383273139",
        "https://twitter.com/glenngabe/status/1807027310232563919",
        "https://twitter.com/glenngabe/status/1807026643820507532",
        "https://twitter.com/glenngabe/status/1807025587409559999",
        "https://twitter.com/aleyda/status/1807025511966683400",
        "https://www.streetinsider.com/Newsfile/Copymatic+CEO+Ryan+Faber+Leads+the+AI-driven+SEO+Revolution+with+Autopilot+Features/23416706.html",
        "https://twitter.com/ericschwartzman/status/1807020131463098738",
        "https://twitter.com/aleyda/status/1807015089880326461",
        "https://www.bbntimes.com/technology/maximizing-seo-with-ai-4-ways-to-use-ai-for-better-rankings"
    ]
}