{
    "valid_articles": [
        {
            "Title": "Google Search is currently not indexing new content - another huge Google Search bug",
            "Description": "Google Search is currently not indexing new content - another huge Google Search bug",
            "Link": "https://twitter.com/rustybrick/status/1810438660959137901"
        },
        {
            "Title": "Google Search is currently not indexing new content - another huge Google Search bug",
            "Description": "RT by @aleyda: Google Search is currently not indexing new content - another huge Google Search bug 🚨🚨🚨 seroundtable.com/google-search-…",
            "Link": "https://twitter.com/rustybrick/status/1810438660959137901"
        },
        {
            "Title": "Google Search Console difficulties, more Google ranking volatility, updated…",
            "Description": "RT @rustybrick: Catch up with the SEO Video Recap covering the Google Search Console difficulties, more Google ranking volatility, updated…",
            "Link": "https://twitter.com/rustybrick/status/1810285956953461194"
        },
        {
            "Title": "Google says \"promoted pins\" are not new (I know they are not) but I have never seen \"Add stop\" ads in the Google Maps app, I have seen them in Waze... - story updated at",
            "Description": "Google says \"promoted pins\" are not new (I know they are not) but I have never seen \"Add stop\" ads in the Google Maps app, I have seen them in Waze... - story updated at",
            "Link": "https://twitter.com/rustybrick/status/1810397281671328220"
        },
        {
            "Title": "YouTube traffic sources affect the same traffic sources, not different ones",
            "Description": "ICYMI: YouTube traffic sources affect the same traffic sources, not different ones",
            "Link": "https://twitter.com/rustybrick/status/1810384858319041000"
        },
        {
            "Title": "What Was Microsoft's First Search Engine Before Bing?",
            "Description": "Tech Of The Past: What Was Microsoft's First Search Engine Before Bing? \n2024-07-08\nBing is Microsoft's search engine and it has been around for a long time, but it wasn't the company's first effort. Here's everything we know.",
            "Link": "https://www.slashgear.com/1614832/microsoft-search-engine-first-before-bing-about-msn-history/"
        },
        {
            "Title": "Google Search Console bug sent numerous and repetitive \"new owner\" email notifications",
            "Description": "ICYMI: Google Search Console bug sent numerous and repetitive \"new owner\" email notifications",
            "Link": "https://twitter.com/rustybrick/status/1810381083529326802"
        },
        {
            "Title": "Google URL best practices added \"don't use fragments to change the content of the page\"",
            "Description": "ICYMI: Google URL best practices added \"don't use fragments to change the content of the page\"",
            "Link": "https://twitter.com/rustybrick/status/1810377308747841823"
        },
        {
            "Title": "Google Maps \"Add stop\" ad",
            "Description": "ICYMI: Google Maps \"Add stop\" ad",
            "Link": "https://twitter.com/rustybrick/status/1810373534046421223"
        },
        {
            "Title": "Remove ambiguity from your content if you are ranking for unrelated keywords in Google Search",
            "Description": "ICYMI: Remove ambiguity from your content if you are ranking for unrelated keywords in Google Search",
            "Link": "https://twitter.com/rustybrick/status/1810369758984024224"
        },
        {
            "Title": "Google ski lift",
            "Description": "ICYMI: Google ski lift",
            "Link": "https://twitter.com/rustybrick/status/1810365984030491118"
        },
        {
            "Title": "Move over Rankbrain and Spambrain - Google talks about Mouse brain",
            "Description": "Move over Rankbrain and Spambrain - Google talks about Mouse brain",
            "Link": "https://twitter.com/rustybrick/status/1810360252879221211"
        },
        {
            "Title": "YouTube and Reddit are among the top sites attracting the most organic search traffic",
            "Description": "Last week I shared how YouTube and Reddit are among the top sites attracting the most organic search traffic across so many verticals (retail, travel, software) most popular queries, for both informational as well as transactional terms. This is the consequence of big UGC sites'…",
            "Link": "https://twitter.com/aleyda/status/1810314964202041695"
        },
        {
            "Title": "YouTube SEO: Traffic Sources Affect The Same Traffic Sources",
            "Description": "YouTube traffic sources affect the same traffic sources, not different ones (so home page views impact home page recommendations, but external views do impact home page recommendations) according to @YouTubeLiaison",
            "Link": "https://twitter.com/rustybrick/status/1810280420308906269"
        },
        {
            "Title": "YouTube SEO: Traffic Sources Affect The Same Traffic Sources",
            "Description": "I don't cover YouTube SEO here much but I found a post from the YouTube Liaison talking about how traffic sources are impacted. In short, the YouTube home page recommendations are affected by viewers watching videos from the home page and not affected by external views, people watching your videos on an external site.",
            "Link": "https://www.seroundtable.com/youtube-seo-traffic-sources-37685.html"
        },
        {
            "Title": "Google Search Console bug sends numerous and repetitive \"new owner\" notifications over the past few days",
            "Description": "Google Search Console bug sends numerous and repetitive \"new owner\" notifications over the past few days",
            "Link": "https://twitter.com/rustybrick/status/1810277903781024222"
        },
        {
            "Title": "Google updates its URL best practices for Search documentation to say don't use fragments to change the content of the page",
            "Description": "Google updates its URL best practices for Search documentation to say don't use fragments to change the content of the page",
            "Link": "https://twitter.com/rustybrick/status/1810275387295068204"
        },
        {
            "Title": "Google Maps \"Add stop\" advertisement - within the Google Maps app for driving directions",
            "Description": "Google Maps \"Add stop\" advertisement - within the Google Maps app for driving directions",
            "Link": "https://twitter.com/rustybrick/status/1810272870318149859"
        },
        {
            "Title": "Are you ranking for keywords that are unrelated to your site's content? Google says you can try to improve your content but it doesn't really hurt you...",
            "Description": "Are you ranking for keywords that are unrelated to your site's content? Google says you can try to improve your content but it doesn't really hurt you...",
            "Link": "https://twitter.com/rustybrick/status/1810270353845014944"
        },
        {
            "Title": "SEO Tools for Keyword Intent, Audience",
            "Description": "AI is transforming traditional keyword research. Here are innovative tools for search intent, audience targeting, and more.",
            "Link": "https://www.practicalecommerce.com/seo-tools-for-keyword-intent-audience"
        },
        {
            "Title": "York copywriters host free course on PR for firms",
            "Description": "Two York copywriters are staging a free Q&A event to help small businesses learn how to boost their Google rankings and do their own PR.",
            "Link": "https://www.yorkpress.co.uk/news/24436560.helen-reynolds-linda-harrison-run-online-pr-course/"
        },
        {
            "Title": "Google’s AI Aftershock: Expert Explains How to Thrive in the New Search Landscape",
            "Description": "Google recently dropped a bombshell on the search world, shaking the foundation of how we find information online. Forget scrolling",
            "Link": "https://dataconomy.com/2024/07/08/googles-ai-expert-how-to-new-search/"
        },
        {
            "Title": "Poor Marketing Kills Ecommerce Dropshipping",
            "Description": "The dropshipping model, while tempting, has little barrier to entry and thus many competitors selling the same thing.",
            "Link": "https://www.practicalecommerce.com/poor-marketing-kills-ecommerce-dropshipping"
        },
        {
            "Title": "10 AI Tools to Replace SEO Agencies",
            "Description": "AI systems can process humongous amounts of data, providing insights that improve the SEO strategy and instil confidence in business decisions",
            "Link": "https://analyticsindiamag.com/10-ai-tools-to-replace-seo-agencies/"
        },
        {
            "Title": "Google Search Algorithm Leak: an SEO game-changer - The New Orleans 100",
            "Description": "While Google has provided some insights on how its algorithm works in ranking web pages, most strategies we know are still based on studies and trials of marketers and SEO experts.",
            "Link": "https://theneworleans100.com/business/2024/07/08/google-search-algorithm-leak-an-seo-game-changer/20217"
        },
        {
            "Title": "WTF is the difference between ID bridging and ID spoofing?",
            "Description": "ID bridging, and its darker form ID spoofing, are casting a longer shadow in the programmatic market.",
            "Link": "https://digiday.com/media/wtf-is-the-difference-between-id-bridging-and-id-spoofing/"
        },
        {
            "Title": "Media Buying Briefing: Publicis Media’s Jessica Berger on AI and innovation",
            "Description": "Berger, senior vp of innovation for Publicis Media, finds testing new technologies is often about building off of existing trends – and being able to embrace rapid testing.",
            "Link": "https://digiday.com/media-buying/media-buying-briefing-publicis-medias-jessica-berger-on-ai-and-innovation/"
        },
        {
            "Title": "How to prepare for Gen Alpha: Invest in YouTube, gaming and learning",
            "Description": "Agencies and brands continue to study Gen Alpha’s distinction from Gen Z as they prepare to adapt their marketing tactics and strategies to court this even-younger generation.",
            "Link": "https://digiday.com/media-buying/how-to-prepare-for-gen-alpha-invest-in-youtube-gaming-and-learning/"
        },
        {
            "Title": "Electronic Arts' ad tech hiring plans signal the publisher's streamlined advertising dreams",
            "Description": "At the moment, EA has four active job listings for ad tech roles, which went up on various job boards beginning in late May and as recently as last week. The jobs are based across EA’s various offices, with the majority located in the company’s headquarters in Redwood City, California.",
            "Link": "https://digiday.com/marketing/electronic-arts-ad-tech-hiring-plans-signal-the-publishers-streamlined-advertising-dreams/"
        },
        {
            "Title": "Optimizing Product Variations for SEO",
            "Description": "Optimizing product variants like size and color are important aspects of e-commerce SEO. Learn how to further optimize your product pages.",
            "Link": "https://neilpatel.com/blog/product-variation-optimizations-for-seo/"
        },
        {
            "Title": "July 4th Weekend Google Search Ranking Volatility",
            "Description": "Surprise, surprise, it was another weekend and we again see some more than usual ranking volatility from Google Search. Again, this reminds me of the weekend ranking bug Google had late last year into early this year. But who knows, maybe it is just a ranking system that shuffles things up for weekend searchers?",
            "Link": "https://www.seroundtable.com/july-4th-weekend-google-search-ranking-volatility-37687.html"
        },
        {
            "Title": "Payment Processing Fuels Shopify Earnings",
            "Description": "Shopify's growth continues, with Q1 2024 revenue up 23% from the prior year, mainly owing to Shopify Payments.",
            "Link": "https://www.practicalecommerce.com/payment-processing-fuels-shopify-earnings"
        },
        {
            "Title": "OpenAI Wants New York Times to Show How Original Its Copyrighted Articles Are",
            "Description": "The AI company is seeking journalists' source materials to assist in its defense of a multi-million copyright infringement claim...",
            "Link": "https://twitter.com/glenngabe/status/1809565207577911462"
        },
        {
            "Title": "YouTube updates its Erase Song tool for creators with an AI algorithm to detect and remove any copyrighted music from their videos without impacting other audio",
            "Description": "Pretty impressive & can help resolve copyright claims w/out impacting the entire video -> YouTube updates its Erase Song tool for creators with an AI algorithm to detect and remove any copyrighted music from their videos without impacting other audio",
            "Link": "https://twitter.com/glenngabe/status/1809560174417649960"
        },
        {
            "Title": "Google considered limiting AI Overviews to its own mobile apps",
            "Description": "More on AI overviews: \"If Google loses the case (DOJ antitrust trial), it could lose access to the roughly 70% of searches done on iPhones, which account for about half the smartphones in the U.S. That could severely hurt its share of mobile search...\"",
            "Link": "https://twitter.com/glenngabe/status/1809555896433012815"
        },
        {
            "Title": "Google considered limiting AI Overviews to lessen reliance on Safari for iOS",
            "Description": "The idea was dangling AI overviews out there to get more iOS users to use Google directly versus Safari -> To lessen its reliance on Safari for iOS, Google considered limiting AI Overviews to its own mobile apps, but ultimately decided against such a move",
            "Link": "https://twitter.com/glenngabe/status/1809555393078763898"
        },
        {
            "Title": "IntentIQ's post-cookie alternative ID test shows promise",
            "Description": "IntentIQ used an approach that blended cookie-based and cookie-less solutions in a partnership with independent full-service agency Involved Media for a campaign executed for an education client.",
            "Link": "https://digiday.com/media-buying/intentiqs-post-cookie-alternative-id-test-shows-promise/"
        },
        {
            "Title": "DTC company Shapermint’s AI influencer engine highlights how marketers are actually using the tech",
            "Description": "The fashion brand is using generative AI to script and storyboard influencer content.",
            "Link": "https://digiday.com/marketing/dtc-company-shapermints-ai-influencer-engine-highlights-how-marketers-are-actually-using-the-tech/"
        },
        {
            "Title": "Bad hiring practices are harming employer brands, shrinking talent pools",
            "Description": "On Glassdoor and Indeed, job seekers who had poor hiring experiences are dropping “Yelp-like feedback” about certain companies.",
            "Link": "https://digiday.com/marketing/bad-hiring-practices-are-harming-employer-brands-shrinking-talent-pools/"
        },
        {
            "Title": "Marketing Briefing: What to make of the major marketing trends of the first half of 2024",
            "Description": "Marketers looked to generative AI, creating ad networks and more to drive their businesses throughout the first six months of the year.",
            "Link": "https://digiday.com/marketing/marketing-briefing-what-to-make-of-the-major-marketing-trends-of-the-first-half-of-2024/"
        },
        {
            "Title": "Jamila Robinson explains why Bon Appétit is getting into sports, relationships and subscription boxes",
            "Description": "On the latest episode of the Digiday Podcast, Robinson talks about the new Sports issue of Bon Appétit, hitting newsstands today.",
            "Link": "https://digiday.com/podcasts/jamila-robinson-explains-why-bon-appetit-is-getting-into-sports-relationships-and-subscription-boxes/"
        },
        {
            "Title": "Google Struggles To Boost Search Traffic On Its iPhone Apps",
            "Description": "Google struggles to shift iPhone searches to its apps, reaching a low 30% adoption, as antitrust concerns loom over the Safari partnership.",
            "Link": "https://www.searchenginejournal.com/google-struggles-to-boost-search-traffic-on-its-iphone-apps/521626/"
        },
        {
            "Title": "SEO Consultant Reveals Search Engine Optimization Consulting Secrets |",
            "Description": "SEO consultant Eric Schwartzman has released an exclusive podcast interview with a well-known SEO consultant who runs a New York-based SEO consultancy about what the recent Google leaks mean for SEO",
            "Link": "https://www.martechcube.com/seo-consultant-reveals-search-engine-optimization-consulting-secrets/"
        },
        {
            "Title": "Google changed its mind on allowing search ads for Opioid - it has indefinitely paused this policy update",
            "Description": "Google has indefinitely paused its policy update that would have allowed search ads for Opioid.",
            "Link": "https://twitter.com/rustybrick/status/1810640291654951159"
        },
        {
            "Title": "Bing Search is testing labeling images with nutritional details",
            "Description": "Bing is testing adding nutritional details to images in its search results. It includes labeling food products with \"high calcium,\" \"lean protein,\" \"anti-inflammatory,\" and other labels.",
            "Link": "https://twitter.com/rustybrick/status/1810637774988496994"
        },
        {
            "Title": "Bing Search Testing Labeling Images With Nutrition Details",
            "Description": "Bing is testing adding nutritional details to images in its search results. It includes labeling food products with \"high calcium,\" \"lean protein,\" \"anti-inflammatory,\" and other labels.",
            "Link": "https://www.seroundtable.com/bing-search-tests-labeling-images-with-nutrition-details-37677.html"
        },
        {
            "Title": "Google Search added compositeWithTrainedAlgorithmicMedia to the IPTC photo metadata documentation this morning",
            "Description": "Google Search added compositeWithTrainedAlgorithmicMedia to the IPTC photo metadata documentation.",
            "Link": "https://twitter.com/rustybrick/status/1810635258527969728"
        },
        {
            "Title": "Google is testing country labels (flags) in the search result snippets - have you seen this before?",
            "Description": "Google is testing country labels (flags) in the search result snippets.",
            "Link": "https://twitter.com/rustybrick/status/1810632741823639825"
        },
        {
            "Title": "13 Custom GPTs to Generate Content",
            "Description": "Need a new ad, logo, presentation, image, or video? There's a custom GPT for that.",
            "Link": "https://www.practicalecommerce.com/13-custom-gpts-to-generate-content"
        },
        {
            "Title": "New Ecommerce Tools: July 9, 2024",
            "Description": "New tools for merchants this week include social commerce, flexible payments, luxury shopping, fulfillment, AI-powered pricing, and shopping in the metaverse.",
            "Link": "https://www.practicalecommerce.com/new-ecommerce-tools-july-9-2024"
        },
        {
            "Title": "3 Types Of PR & SEO Funnels That Will Maximize Conversions",
            "Description": "Maximize conversions with PR and SEO funnels. Learn how to align your content with media coverage for higher conversion rates.",
            "Link": "https://www.searchenginejournal.com/types-of-pr-and-seo-funnels-to-maximize-conversion/515942/"
        }
    ],
    "reviewed_urls": [
        "https://twitter.com/rustybrick/status/1810438660959137901",
        "https://twitter.com/rustybrick/status/1810438660959137901",
        "https://twitter.com/rustybrick/status/1810285956953461194",
        "https://twitter.com/rustybrick/status/1810397281671328220",
        "https://twitter.com/rustybrick/status/1810384858319041000",
        "https://www.slashgear.com/1614832/microsoft-search-engine-first-before-bing-about-msn-history/",
        "https://twitter.com/rustybrick/status/1810381083529326802",
        "https://twitter.com/rustybrick/status/1810377308747841823",
        "https://twitter.com/rustybrick/status/1810373534046421223",
        "https://twitter.com/rustybrick/status/1810369758984024224",
        "https://twitter.com/rustybrick/status/1810365984030491118",
        "https://twitter.com/rustybrick/status/1810360252879221211",
        "https://www.openpr.com/news/3570722/effective-web-solutions-celebrates-15-years-of-providing-local",
        "https://twitter.com/glenngabe/status/1810334367387942921",
        "https://twitter.com/rustybrick/status/1810324460463087627",
        "https://twitter.com/aleyda/status/1810322295115686196",
        "https://www.designrush.com/agency/search-engine-optimization/trends/longtail-seo",
        "https://twitter.com/rustybrick/status/1810320685811859885",
        "https://twitter.com/rustybrick/status/1810316910778888480",
        "https://twitter.com/aleyda/status/1810314964202041695",
        "https://twitter.com/rustybrick/status/1810313136127275036",
        "https://twitter.com/rustybrick/status/1810313082805031009",
        "https://twitter.com/rustybrick/status/1810309361182626223",
        "https://twitter.com/rustybrick/status/1810305586208067646",
        "https://twitter.com/aleyda/status/1810289342570504298",
        "https://twitter.com/glenngabe/status/1810287076773863564",
        "https://southeast.newschannelnebraska.com/story/51003659/jesse-owen-of-bullet-marketing-leads-global-expansion-in-digital-marketing-with-a-no-nonsense-approach-to-seo",
        "https://twitter.com/glenngabe/status/1810282987646324871",
        "https://twitter.com/rustybrick/status/1810280420308906269",
        "https://www.seroundtable.com/youtube-seo-traffic-sources-37685.html",
        "https://twitter.com/glenngabe/status/1810279485738017200",
        "https://twitter.com/rustybrick/status/1810277903781024222",
        "https://twitter.com/glenngabe/status/1810277864165527761",
        "https://twitter.com/rustybrick/status/1810275387295068204",
        "https://twitter.com/rustybrick/status/1810272870318149859",
        "https://twitter.com/rustybrick/status/1810270353845014944",
        "https://twitter.com/rustybrick/status/1810267589391581271",
        "https://www.einnews.com/pr_news/725901182/yourseoboard-unveils-advanced-seo-tools-for-business-optimization",
        "https://www.einnews.com/pr_news/725900472/yourseoboard-unveils-cutting-edge-seo-solutions-for-enhanced-business-performance",
        "https://www.practicalecommerce.com/seo-tools-for-keyword-intent-audience",
        "https://www.yorkpress.co.uk/news/24436560.helen-reynolds-linda-harrison-run-online-pr-course/",
        "https://dataconomy.com/2024/07/08/googles-ai-expert-how-to-new-search/",
        "https://www.practicalecommerce.com/poor-marketing-kills-ecommerce-dropshipping",
        "https://analyticsindiamag.com/10-ai-tools-to-replace-seo-agencies/",
        "https://theneworleans100.com/business/2024/07/08/google-search-algorithm-leak-an-seo-game-changer/20217",
        "https://digiday.com/media/wtf-is-the-difference-between-id-bridging-and-id-spoofing/",
        "https://digiday.com/media-buying/media-buying-briefing-publicis-medias-jessica-berger-on-ai-and-innovation/",
        "https://digiday.com/marketing/inside-aldos-in-house-generative-ai-and-machine-learning-strategy/",
        "https://digiday.com/media-buying/how-to-prepare-for-gen-alpha-invest-in-youtube-gaming-and-learning/",
        "https://digiday.com/marketing/electronic-arts-ad-tech-hiring-plans-signal-the-publishers-streamlined-advertising-dreams/",
        "https://twitter.com/levelsio/status/1810058143382278567",
        "https://neilpatel.com/blog/product-variation-optimizations-for-seo/",
        "https://twitter.com/zfellows_/status/1809948378282729783",
        "https://twitter.com/rustybrick/status/1809937544945205315",
        "https://www.seroundtable.com/july-4th-weekend-google-search-ranking-volatility-37687.html",
        "https://twitter.com/glenngabe/status/1809923135543652376",
        "https://twitter.com/glenngabe/status/1809920757490720787",
        "https://twitter.com/Majestic/status/1809890663573364855",
        "https://www.practicalecommerce.com/payment-processing-fuels-shopify-earnings",
        "https://twitter.com/aleyda/status/1809859672880341139",
        "https://markets.businessinsider.com/news/stocks/thirdweb-leverages-leap-ai-to-revolutionize-content-creation-and-boost-seo-efficiency-1033533366",
        "https://www.larkinmortuary.com/obituary/view/bing-zhang",
        "https://twitter.com/glenngabe/status/1809565207577911462",
        "https://www.einnews.com/pr_news/725604485/geeks-for-growth-revolutionizes-online-success-with-ai-powered-seo",
        "https://twitter.com/glenngabe/status/1809560174417649960",
        "https://twitter.com/glenngabe/status/1809555896433012815",
        "https://twitter.com/glenngabe/status/1809555393078763898",
        "https://www.slashgear.com/1613107/microsoft-search-engine-can-employer-see-bing-results-how-works/",
        "https://twitter.com/aleyda/status/1809473907658772915",
        "https://www.centralmaine.com/2024/07/09/obituarybing-c-tribbet-2/",
        "https://www.streetinsider.com/Newsfile/LinkVector+Launches+Affiliate+Program+for+SEO+Influencers/23443090.html",
        "https://digiday.com/media-buying/intentiqs-post-cookie-alternative-id-test-shows-promise/",
        "https://digiday.com/marketing/dtc-company-shapermints-ai-influencer-engine-highlights-how-marketers-are-actually-using-the-tech/",
        "https://digiday.com/marketing/bad-hiring-practices-are-harming-employer-brands-shrinking-talent-pools/",
        "https://digiday.com/marketing/marketing-briefing-what-to-make-of-the-major-marketing-trends-of-the-first-half-of-2024/",
        "https://digiday.com/podcasts/jamila-robinson-explains-why-bon-appetit-is-getting-into-sports-relationships-and-subscription-boxes/",
        "https://www.searchenginejournal.com/google-struggles-to-boost-search-traffic-on-its-iphone-apps/521626/",
        "https://www.martechcube.com/seo-consultant-reveals-search-engine-optimization-consulting-secrets/",
        "https://twitter.com/glenngabe/status/1810644725591925024",
        "https://twitter.com/glenngabe/status/1810641853059879303",
        "https://twitter.com/rustybrick/status/1810640291654951159",
        "https://twitter.com/rustybrick/status/1810637774988496994",
        "https://www.seroundtable.com/bing-search-tests-labeling-images-with-nutrition-details-37677.html",
        "https://twitter.com/rustybrick/status/1810635258527969728",
        "https://twitter.com/rustybrick/status/1810632741823639825",
        "https://twitter.com/rustybrick/status/1810629982181581047",
        "https://twitter.com/aleyda/status/1810620728376488411",
        "https://www.practicalecommerce.com/13-custom-gpts-to-generate-content",
        "https://www.practicalecommerce.com/new-ecommerce-tools-july-9-2024",
        "https://twitter.com/aleyda/status/1810599430833295784",
        "https://twitter.com/aleyda/status/1810594864905527440",
        "https://www.searchenginejournal.com/types-of-pr-and-seo-funnels-to-maximize-conversion/515942/",
        "https://www.cmswire.com/the-wire/yourseoboard-introduces-strategic-seo-solutions-for-business-growth/"
    ]
}