{
    "valid_articles": [
        {
            "Title": "Google's AI Overviews Shake Up Ecommerce Search Visibility",
            "Description": "Data reveals Google AI overviews are disrupting ecommerce visibility, pulling product data from non-ranking sources.",
            "Link": "https://www.searchenginejournal.com/googles-ai-overviews-shake-up-ecommerce-search-visibility/517577/"
        },
        {
            "Title": "AI Overviews results are even worst than Google traditional SERPs ever were",
            "Description": "AI Overviews results are even worst than Google traditional SERPs ever were 🥴 @sundarpichai sorry but Google new feature is broken and is the primary experience many are getting now! This is not about “not being left behind” by ChatGPT et al anymore, but not breaking your core…",
            "Link": "https://twitter.com/aleyda/status/1795190509633220853"
        },
        {
            "Title": "In today's #MarketingFOMO's latest in Digital Marketing",
            "Description": "In today's #MarketingFOMO's latest in Digital Marketing: * Google Search’s New AI Overviews Will Soon Have Ads * TikTok launches AI-powered advertising suite * The Future of Content Success Is Social * 10 Tips for Effective Lead Generation For Influencer Marketing More 👀 Read…",
            "Link": "https://twitter.com/aleyda/status/1795167698223034553"
        },
        {
            "Title": "Google AI Overviews help document was updated to explain how to show web only results and how to submit feedback on AI Overviews",
            "Description": "ICYMI: Google AI Overviews help document was updated to explain how to show web only results and how to submit feedback on AI Overviews seroundtable.com/google-ai-over…",
            "Link": "https://twitter.com/rustybrick/status/1795164568102240756"
        },
        {
            "Title": "Google says the \"concept of toxic links is made up by SEO tools so that you pay them regularly\"",
            "Description": "ICYMI: Google says the \"concept of toxic links is made up by SEO tools so that you pay them regularly\" seroundtable.com/google-again-b…",
            "Link": "https://twitter.com/rustybrick/status/1795160793203269703"
        },
        {
            "Title": "Google Search Console links report may now be showing fewer links???",
            "Description": "ICYMI: Google Search Console links report may now be showing fewer links??? seroundtable.com/google-search-…",
            "Link": "https://twitter.com/rustybrick/status/1795157018287931607"
        },
        {
            "Title": "Google Image search \"see exact image\"",
            "Description": "ICYMI: Google Image search \"see exact image\" seroundtable.com/google-images-…",
            "Link": "https://twitter.com/rustybrick/status/1795153243720524059"
        },
        {
            "Title": "Google search tests blue \"visit\" link for search results",
            "Description": "ICYMI: Google search tests blue \"visit\" link for search results seroundtable.com/google-large-b…",
            "Link": "https://twitter.com/rustybrick/status/1795149468502835477"
        },
        {
            "Title": "Today in my @Moz column, a look at not just some of the worst #AIOverviews, but at a life lesson you won't forget on human vulnerability that has me worried about Google championing medical disinformation.",
            "Description": "RT by @aleyda: Today in my @Moz column, a look at not just some of the worst #AIOverviews, but at a life lesson you won't forget on human vulnerability that has me worried about Google championing medical disinformation. Examples from @lilyraynyc @ShawnLHuber and more. moz.com/blog/ai-overvi…",
            "Link": "https://twitter.com/Miriam_Ellis_/status/1795137525746454938"
        },
        {
            "Title": "Google AI Overviews help document was updated to explain how to show web only results and how to submit feedback on AI Overviews",
            "Description": "Google AI Overviews help document was updated to explain how to show web only results and how to submit feedback on AI Overviews seroundtable.com/google-ai-over…",
            "Link": "https://twitter.com/rustybrick/status/1795104170233806949"
        },
        {
            "Title": "Google says the \"concept of toxic links is made up by SEO tools so that you pay them regularly\"",
            "Description": "Google says the \"concept of toxic links is made up by SEO tools so that you pay them regularly\" seroundtable.com/google-again-b…",
            "Link": "https://twitter.com/rustybrick/status/1795100395322118225"
        },
        {
            "Title": "Google Search Console links report showing fewer links?",
            "Description": "Google Search Console links report may now be showing fewer links??? seroundtable.com/google-search-…",
            "Link": "https://twitter.com/rustybrick/status/1795096620352070090"
        },
        {
            "Title": "Google Image search \"see exact image\"",
            "Description": "Google Image search \"see exact image\" seroundtable.com/google-images-…",
            "Link": "https://twitter.com/rustybrick/status/1795092845889777677"
        },
        {
            "Title": "Google search tests blue \"visit\" link for search results",
            "Description": "Google search tests blue \"visit\" link for search results seroundtable.com/google-large-b…",
            "Link": "https://twitter.com/rustybrick/status/1795089070575563204"
        },
        {
            "Title": "So, we've seen some crazy volatility after the March core update rolled out.",
            "Description": "So, we've seen some crazy volatility after the March core update rolled out. E.g. The 5/3 movement was huge and we saw a number of sites completely recover from the March core update. But then there was a ton of volatility on 5/6, 5/8, 5/11, and 5/22. Well, add 5/26 to the list.…",
            "Link": "https://twitter.com/glenngabe/status/1795082139601391638"
        },
        {
            "Title": "Chrome Extensions for Search Console",
            "Description": "Data from Search Console can seem overwhelming. These three tools can help.",
            "Link": "https://www.practicalecommerce.com/chrome-extensions-for-search-console"
        },
        {
            "Title": "Researchers find that GPT-4 outperforms human analysts in predicting future corporate earnings growth even when provided only with financial statements",
            "Description": "Key innovation was the use of \"Chain of thought prompts\" -> Researchers find that GPT-4 outperforms human analysts in predicting future corporate earnings growth even when provided only with financial statements \"Remarkably, even when provided only with standardized, anonymized…",
            "Link": "https://twitter.com/glenngabe/status/1795066001056313631"
        },
        {
            "Title": "Sounds like Apple wants a deal with both Google & OpenAI",
            "Description": "Sounds like Apple wants a deal with both Google & OpenAI -> A closer look at Apple's AI strategy: Project Greymatter, local and cloud LLM data processing, Siri, approach to the chatbot partnership with OpenAI, and more \"At Apple Inc.’s developers conference next month, the…",
            "Link": "https://twitter.com/glenngabe/status/1795064908318388291"
        },
        {
            "Title": "Google updated its AI Overviews document to explain how to show web only results and how to submit feedback on AI Overviews",
            "Description": "Google updated its AI Overviews document to explain how to show web only results and how to submit feedback on AI Overviews seroundtable.com/google-ai-over… via @gaganghotra_",
            "Link": "https://twitter.com/rustybrick/status/1795060129814962461"
        },
        {
            "Title": "Google's @JohnMu on toxic links again",
            "Description": "Google's @JohnMu on toxic links again \"The concept of toxic links is made up by SEO tools so that you pay them regularly\" seroundtable.com/google-again-b… (note, seems like John edited his response later",
            "Link": "https://twitter.com/rustybrick/status/1795057613362880616"
        },
        {
            "Title": "Google Search Console links report showing fewer links?",
            "Description": "Google Search Console links report showing fewer links? seroundtable.com/google-search-… @LeonardBrahm",
            "Link": "https://twitter.com/rustybrick/status/1795055096834785371"
        },
        {
            "Title": "Google Search Console Links Report Showing Fewer Links?",
            "Description": "Numerous SEOs are reporting that the link report in Google Search Console is showing significantly fewer links than it did a month prior.",
            "Link": "https://www.seroundtable.com/google-search-console-links-report-37450.html"
        },
        {
            "Title": "Google Image search adds \"see exact image\" that helps you find who is stealing your images",
            "Description": "Google Image Search now includes a \"see exact image\" feature that helps users find instances where their images are being used without permission.",
            "Link": "https://twitter.com/rustybrick/status/1795052580181365137"
        },
        {
            "Title": "Google mobile search testing large blue \"visit\" link for search results",
            "Description": "Google is testing a new design for mobile search results that features a large, blue \"visit\" link.",
            "Link": "https://twitter.com/rustybrick/status/1795050063468593586"
        },
        {
            "Title": "Media Buying Briefing: Can TikTok’s social impact program attract creators as it faces uncertainty?",
            "Description": "TikTok launched a new creator program aimed at attracting creators through social impact initiatives, potentially helping the platform retain Gen Z users and attract brand growth amidst uncertainty.",
            "Link": "https://digiday.com/media-buying/media-buying-briefing-can-tiktoks-social-impact-program-attract-creators-as-it-faces-uncertainty/"
        },
        {
            "Title": "WTF is principal media?",
            "Description": "The use of principal media, where agencies act as media owners, is increasing, particularly among agency holding companies seeking new revenue streams. The article explores client perspectives on this trend.",
            "Link": "https://digiday.com/media-buying/wtf-is-principal-media/"
        },
        {
            "Title": "AI Briefing: Why WPP is adding Anthropic's Claude models to its AI platform",
            "Description": "WPP is integrating Anthropic's Claude AI models into its AI platform. The article highlights the importance of AI model selection for companies developing marketing and other AI-driven applications.",
            "Link": "https://digiday.com/media/ai-briefing-why-wpp-is-adding-anthropics-claude-models-to-its-ai-platform/"
        },
        {
            "Title": "Which of all of your site's queries actually trigger AI Overviews?",
            "Description": "A tweet highlighting ZipTie, a tool that helps identify search queries triggering Google's AI Overviews in bulk. The tool offers insights for content optimization based on AI Overview appearances.",
            "Link": "https://twitter.com/aleyda/status/1794765060260184569"
        },
        {
            "Title": "I've updated my Google AI Overviews (AIO) Traffic Risk Impact Assessment Sheet to make it easier to",
            "Description": "An updated Google AI Overviews (AIO) Traffic Risk Impact Assessment Sheet is available. The sheet helps assess the impact of AIO on CTR and traffic, identify featured pages, and prioritize content optimization.",
            "Link": "https://twitter.com/aleyda/status/1794763486578229760"
        },
        {
            "Title": "Just an update on this. Yep, the link card is still gone. So using 'preview controls' to remove content AND links from AI Overviews seems to work as intended. You can read more in my case study below.",
            "Description": "Using \"preview controls\" to remove content and links from Google's AI Overviews appears to be effective. The tweet links to a case study exploring this further.",
            "Link": "https://twitter.com/glenngabe/status/1794720775670505558"
        },
        {
            "Title": "30 stories over the weekend about the embarrassing and sometimes harmful Google AI Overviews - I am sure there are more - I posted them at seroundtable.com/embarrassing-g…",
            "Description": "A compilation of 30 stories highlighting embarrassing and potentially harmful instances of Google's AI Overviews. The tweet suggests that there are likely more such cases.",
            "Link": "https://twitter.com/rustybrick/status/1794701742304801170"
        },
        {
            "Title": "Amazon Marketplace Fears",
            "Description": "The article discusses the reliance of thousands of merchants on Amazon's marketplace for revenue and the inherent fears associated with this dependency.",
            "Link": "https://www.practicalecommerce.com/amazon-marketplace-fears"
        },
        {
            "Title": "Today's #SEOFOMO is a must read going through the latest in SEO 🔥",
            "Description": "A recommended #SEOFOMO read covering the latest SEO news, including Google AI Overviews, Core Update trends, the SEO job market, top SERP features, and more.",
            "Link": "https://twitter.com/aleyda/status/1794674224793067924"
        },
        {
            "Title": "Focus on YouTube? Timestamps are coming to AFT violation communications -&gt; ⚠️Time Coded! Incredible news from the Advertiser Friendly Guidelines (AFG) team! Over the coming weeks, they’ll be rolling out time stamps \"In other words, they’ll provide the point in a video where any…",
            "Description": "YouTube is introducing timestamps to Advertiser Friendly Guidelines (AFG) violation communications. This means creators will receive specific time codes for violations, improving transparency and clarity.",
            "Link": "https://twitter.com/glenngabe/status/1794364838807798147"
        },
        {
            "Title": "Yep, I mentioned the impact to tutors last week when OpenAI showed off GPT-4o -&gt; AI tutors are quietly changing how kids in the US study, and the leading apps are from China \"Now, the arrival of AI bots is posing a threat to long-established tutoring franchises such as Kumon,…",
            "Description": "The tweet discusses the impact of AI tutors on the education sector, highlighting the rise of AI-powered tutoring apps, particularly from China, and the potential threat they pose to traditional tutoring services.",
            "Link": "https://twitter.com/glenngabe/status/1794362723553178085"
        },
        {
            "Title": "A week ago, I had a long conversation with @thomasgermain about how Google Search dictates the shape of the web. At one point, I said that Google wields its power irresponsibly. Thomas wrote a must-read article examining whether that might be the case.",
            "Description": "Discussion on Google's influence on the web and potential irresponsible use of power, with a link to an article by Thomas Germain on the topic.",
            "Link": "https://twitter.com/ichbinGisele/status/1794352354680258692"
        },
        {
            "Title": "Google had a year to test the AI overviews results and here we are, major media now covering their bad quality. It seems that most of their concerns were about their monetization viability and impact rather than the quality. Now major publications are covering it. And no,…",
            "Description": "Commentary on Google's AI-generated search overviews receiving negative coverage from major media outlets due to quality concerns, despite Google's focus on monetization.",
            "Link": "https://twitter.com/aleyda/status/1794306219626082566"
        },
        {
            "Title": "Let’s see if finally Google sees is not an SEO complain but from the broader public to fix it. Sad thing that it would take the @nytimes to cover it for them to actually address it",
            "Description": "Expresses hope that Google will address issues with its search results due to public pressure and coverage from major publications like The New York Times, rather than just SEO complaints.",
            "Link": "https://twitter.com/aleyda/status/1794275549692797220"
        }
    ],
    "reviewed_urls": [
        "https://www.searchenginejournal.com/googles-ai-overviews-shake-up-ecommerce-search-visibility/517577/",
        "https://malawi24.com/2024/05/27/yassin-aberra-4-proven-seo-tips-for-your-business/",
        "https://twitter.com/aleyda/status/1795190509633220853",
        "https://twitter.com/aleyda/status/1795183689103466592",
        "https://twitter.com/aleyda/status/1795167698223034553",
        "https://twitter.com/rustybrick/status/1795164568102240756",
        "https://twitter.com/rustybrick/status/1795160793203269703",
        "https://twitter.com/rustybrick/status/1795157018287931607",
        "https://twitter.com/rustybrick/status/1795153243720524059",
        "https://flaglerlive.com/events/bings-landing-master-plan-public-meeting/",
        "https://twitter.com/rustybrick/status/1795149468502835477",
        "https://twitter.com/rustybrick/status/1795145693721657751",
        "https://twitter.com/Miriam_Ellis_/status/1795137525746454938",
        "https://www.lancashiretelegraph.co.uk/news/24348087.bing-flop-coming-lancashire-may-half-term/",
        "https://twitter.com/rustybrick/status/1795104170233806949",
        "https://twitter.com/rustybrick/status/1795102439223308740",
        "https://twitter.com/rustybrick/status/1795100395322118225",
        "https://twitter.com/rustybrick/status/1795096620352070090",
        "https://twitter.com/rustybrick/status/1795092845889777677",
        "https://twitter.com/rustybrick/status/1795089070575563204",
        "https://twitter.com/rustybrick/status/1795085295840555185",
        "https://twitter.com/glenngabe/status/1795082139601391638",
        "https://www.practicalecommerce.com/chrome-extensions-for-search-console",
        "https://twitter.com/aleyda/status/1795067535747915900",
        "https://twitter.com/rustybrick/status/1795066924709388613",
        "https://twitter.com/glenngabe/status/1795066001056313631",
        "https://twitter.com/glenngabe/status/1795064908318388291",
        "https://twitter.com/rustybrick/status/1795060129814962461",
        "https://twitter.com/rustybrick/status/1795057613362880616",
        "https://twitter.com/rustybrick/status/1795055096834785371",
        "https://www.seroundtable.com/google-search-console-links-report-37450.html",
        "https://twitter.com/rustybrick/status/1795052580181365137",
        "https://twitter.com/rustybrick/status/1795050063468593586",
        "https://twitter.com/rustybrick/status/1795047295148298294",
        "https://twitter.com/rustybrick/status/1795033218434957815",
        "https://twitter.com/aleyda/status/1795028770790711325",
        "https://www.openpr.com/news/3512953/data4amazon-recognized-as-one-of-the-top-amazon-seo-companies",
        "https://www.openpr.com/news/3511469/indeedseo-top-seo-company-in-india-richestsoft-launch-1st",
        "https://www.jazziz.com/arooj-aftab-bing-crosby-wynton-marsalis-more-the-week-in-jazz/",
        "https://www.hospitalitynet.org/opinion/4122108.html",
        "https://digiday.com/media-buying/media-buying-briefing-can-tiktoks-social-impact-program-attract-creators-as-it-faces-uncertainty/",
        "https://digiday.com/media-buying/wtf-is-principal-media/",
        "https://digiday.com/media/ai-briefing-why-wpp-is-adding-anthropics-claude-models-to-its-ai-platform/",
        "https://medium.datadriveninvestor.com/three-seo-tricks-discovered-through-experimentation-that-helped-me-rank-first-a239ba3a72a1",
        "https://www.adgully.com/sbi-general-onboards-1702-digital-for-seo-and-aso-services-146210.html",
        "https://twitter.com/aleyda/status/1794775975089320210",
        "https://twitter.com/aleyda/status/1794765060260184569",
        "https://twitter.com/aleyda/status/1794763486578229760",
        "https://twitter.com/glenngabe/status/1794720775670505558",
        "https://twitter.com/rustybrick/status/1794701742304801170",
        "https://twitter.com/rustybrick/status/1794701742304801170",
        "https://www.practicalecommerce.com/amazon-marketplace-fears",
        "https://twitter.com/aleyda/status/1794674224793067924",
        "https://twitter.com/aleyda/status/1794661551213088932",
        "https://twitter.com/aleyda/status/1794427287624167875",
        "https://goodmenproject.com/technology/the-future-of-e-commerce-emerging-trends-seo-strategies-and-how-to-stay-ahead/",
        "https://twitter.com/aleyda/status/1794415382855577873",
        "https://twitter.com/tylerbruno05/status/1794388266495709558",
        "https://twitter.com/glenngabe/status/1794364838807798147",
        "https://twitter.com/glenngabe/status/1794362723553178085",
        "https://twitter.com/ichbinGisele/status/1794352354680258692",
        "https://www.openpr.com/news/3512582/search-engine-optimization-seo-tools-market-size-2023-global",
        "https://twitter.com/aleyda/status/1794306219626082566",
        "https://markets.businessinsider.com/news/stocks/chicago-website-seo-for-local-global-visibility-marketing-agency-update-1033420893",
        "https://twitter.com/aleyda/status/1794275549692797220",
        "https://www.inquirer.com/food/restaurants/cheu-bing-bing-closing-philadelphia-restaurants-20240524.html"
    ]
}