[
    {
        "Title": "Google Reveals Two New Web Crawlers",
        "Category": "SEO",
        "Description": "Google has introduced two new web crawlers: GoogleOther-Image and GoogleOther-Video.",
        "Link": "https://www.searchenginejournal.com/google-reveals-two-new-web-crawlers/516658/"
    },
    {
        "Title": "EU Demands Microsoft Provide Information on Bing AI Risks",
        "Category": "AI",
        "Description": "The European Commission has ordered Microsoft to provide information on the risks of generative AI in its Bing search engine, threatening fines if it fails to comply.",
        "Link": "https://www.reuters.com/technology/eu-demands-clarity-microsoft-ai-risks-bing-2024-05-17/"
    },
    {
        "Title": "Microsoft PC Manager Promotes Bing as Solution for PC Issues",
        "Category": "Search",
        "Description": "Microsoft's PC Manager app is recommending users set Bing as their default search engine as a way to \"repair\" their Windows devices, raising concerns about potentially deceptive practices.",
        "Link": "https://www.digitaltrends.com/computing/microsoft-fixes-your-computer-pc-manager-cleanup/"
    },
    {
        "Title": "Google Ads AI Summaries Rolling Out to Advertisers",
        "Category": "Paid Marketing",
        "Description": "Google is reportedly rolling out AI-powered summaries for Google Ads campaigns, providing a concise overview of campaign performance.",
        "Link": "https://www.seroundtable.com/google-ads-ai-summaries-37410.html"
    },
    {
        "Title": "Order with Google Integration to End in June",
        "Category": "Search",
        "Description": "Google's \"Order with Google\" integration, allowing users to order food directly from search results, will be discontinued at the end of June.",
        "Link": "https://www.seroundtable.com/order-with-google-discontinued-37399.html"
    },
    {
        "Title": "Users Seek Ways to Remove Content from Google AI Overviews",
        "Category": "SEO",
        "Description": "SEOs and users are exploring methods to remove content from Google's AI Overviews, with some reporting success using the \"nosnippet\" robots meta tag.",
        "Link": "https://www.seroundtable.com/remove-your-content-from-googles-ai-overviews-37409.html"
    },
    {
        "Title": "Former Bing AI Head Joins Perplexity Advisory Board",
        "Category": "AI",
        "Description": "Mikhail Parakhin, former head of Bing Search, AI, and Ads at Microsoft, has joined the advisory board of AI search startup Perplexity.",
        "Link": "https://www.seroundtable.com/mikhail-parakh-joins-perplexity-advisor-board-37411.html"
    },
    {
        "Title": "TikTok Tests 60-Minute Video Uploads",
        "Category": "Social Media",
        "Description": "TikTok is experimenting with longer video uploads, allowing users to post videos up to 60 minutes in length.",
        "Link": "https://searchengineland.com/tiktok-testing-60-minute-video-uploads-440588/"
    },
    {
        "Title": "EU Demands Clarity from Microsoft on AI Risks in Bing",
        "Category": "AI",
        "Description": "The European Commission has given Microsoft a deadline of May 27 to provide information on the risks of generative AI in its search engine, Bing.",
        "Link": "https://www.reuters.com/technology/eu-demands-clarity-microsoft-ai-risks-bing-2024-05-17/"
    },
    {
        "Title": "Users Can Now Remove Content from Google AI Overviews",
        "Category": "SEO",
        "Description": "Users have found ways to remove their content from Google's AI Overviews using methods like the 'nosnippet' tag.",
        "Link": "https://www.seroundtable.com/remove-your-content-from-googles-ai-overviews-37409.html"
    },
    {
        "Title": "Two New Googlebots: GoogleOther-Image & GoogleOther-Video",
        "Category": "SEO",
        "Description": "Google has introduced two new web crawlers, GoogleOther-Image and GoogleOther-Video, potentially indicating increased focus on crawling and indexing different content types.",
        "Link": "https://www.seroundtable.com/googleother-image-and-googleother-video-37412.html"
    },
    {
        "Title": "Google Locks Down Complaints of Image Thumbnails Not Showing in Search",
        "Category": "SEO",
        "Description": "Google has locked a support thread related to ongoing issues with image thumbnails not appearing in search results, acknowledging the issue but not providing specific solutions.",
        "Link": "https://www.seroundtable.com/google-complaints-image-thumbnails-locked-37408.html"
    },
    {
        "Title": "EU Demands Information From Microsoft on Bing AI Risks",
        "Category": "AI",
        "Description": "The European Commission has given Microsoft a deadline of May 27th to provide information about the risks associated with generative AI in its Bing search engine, threatening fines for non-compliance.",
        "Link": "https://www.msn.com/en-gb/money/technology/eu-commission-gives-microsoft-10-days-to-hand-over-bing-ai-documents/ar-BB1mznn2?ocid=finance-verthp-feeds"
    }
]