{
    "valid_articles": [
        {
            "Title": "Google Shows How To Block Bots And Boost Site Performance",
            "Description": "Google's Martin Splitt shared how SEOs and site owners can fight back against malicious bots and improve site performance",
            "Link": "https://www.searchenginejournal.com/google-shows-how-to-block-bots-and-boost-site-performance/525331/"
        },
        {
            "Title": "Google Quietly Launches New AI Crawler: Google-CloudVertexBot",
            "Description": "The latest in SEO as of August 25th, 2024, includes Google's quiet launch of a new AI crawler named Google-CloudVertexBot.",
            "Link": "https://twitter.com/aleyda/status/1827763173161865677"
        },
        {
            "Title": "August 2024 Core Update: Biggest Search Visibility Winners & Losers",
            "Description": "Some of the biggest search visibility winners and losers so far since the start of the Google August 2024 Core Update release: * 📈 Not so surprising winners: Reddit, Spotify, PetMD * 📉 Surprising losers: Google, TikTok, LinkedIn",
            "Link": "https://twitter.com/aleyda/status/1827719553377595756"
        },
        {
            "Title": "Google Confirms AI Overviews Affected By Core Updates",
            "Description": "Google's John Mueller confirms core updates impact the search engine's AI-powered overviews.",
            "Link": "https://www.searchenginejournal.com/google-confirms-ai-overviews-affected-by-core-updates/525239/"
        },
        {
            "Title": "Baidu blocks Google, Bing from scraping content amid demand for AI data",
            "Description": "Wikipedia-style service Baidu Baike recently barred the search engine crawlers of Google and Bing from indexing its online content.",
            "Link": "https://www.scmp.com/tech/big-tech/article/3275717/baidu-blocks-google-bing-scraping-content-amid-demand-data-used-ai-projects"
        },
        {
            "Title": "6 Ways Spammers Exploit Google With Reddit",
            "Description": "Frustrated by a flood of spam, an SEO exposed six ways cheaters are exploiting Google's search results with Reddit",
            "Link": "https://www.searchenginejournal.com/6-ways-spammers-exploit-google-with-reddit/525231/"
        },
        {
            "Title": "Want to turn off AI Overviews in Google Search? How you can disable tool that 'does the searching for you'",
            "Description": "AI Overview functionality is now available in the UK, following early tests in the USA",
            "Link": "https://www.gbnews.com/tech/how-to-disable-ai-overviews-in-google-search-uk"
        },
        {
            "Title": "Google's Revamped Documentation Shows 4 Reasons To Refresh Content",
            "Description": "Google's updated Video SEO documentation shows four strategies for improving your content's effectiveness",
            "Link": "https://www.searchenginejournal.com/googles-revamped-documentation-shows-4-reasons-to-refresh-content/525290/"
        },
        {
            "Title": "Midjourney Launches Website Interface For its AI Image Generator",
            "Description": "If you've wanted to try Midjourney, now is a good time to do that. The web app is pretty slick.",
            "Link": "https://twitter.com/glenngabe/status/1827677717354975370"
        },
        {
            "Title": "Google updated its video SEO documentation and clarified video indexing requirements, technical requirements, and added a new 'watch page' section.",
            "Description": "\"We revisited our video SEO guidance to clarify what's eligible for a video result and how site owners can make it...",
            "Link": "https://twitter.com/glenngabe/status/1827679029635240087"
        },
        {
            "Title": "5 Predictions for the 2024 Holiday Shopping Season",
            "Description": "Since 2013 we've predicted U.S. retail sales for the upcoming holiday season. This year we address the effects of mobile, online vs. in-store, email marketing, Gen Zs, and BNPL.",
            "Link": "https://www.practicalecommerce.com/5-predictions-for-the-2024-holiday-shopping-season"
        },
        {
            "Title": "ICYMI: Google is migrating all merchants to Google Merchant Center Next in September",
            "Description": "Google is migrating all merchants to Google Merchant Center Next in September.",
            "Link": "https://twitter.com/rustybrick/status/1827054700698779787"
        },
        {
            "Title": "ICYMI: Hardbacon got hit hard by the Google Sep helpful content update, then announced bankruptcy the day before the core update was announced, the next day, their traffic quadrupled",
            "Description": "Hardbacon got hit hard by the Google Sep helpful content update, then announced bankruptcy the day before the core update was announced, the next day, their traffic quadrupled.",
            "Link": "https://twitter.com/rustybrick/status/1827052687348904143"
        },
        {
            "Title": "ICYMI: Google Search Console search appearance documentation updated",
            "Description": "Google Search Console search appearance documentation updated.",
            "Link": "https://twitter.com/rustybrick/status/1827050925451575419"
        },
        {
            "Title": "ICYMI: Google Search local pack UX update",
            "Description": "Google Search local pack UX update.",
            "Link": "https://twitter.com/rustybrick/status/1827047150863446406"
        },
        {
            "Title": "ICYMI: Having lots of nofollow and/or noindex tags doesn't signify to Google that you have a lot of low-quality pages",
            "Description": "Having lots of nofollow and/or noindex tags doesn't signify to Google that you have a lot of low-quality pages.",
            "Link": "https://twitter.com/rustybrick/status/1827043375805018429"
        },
        {
            "Title": "ICYMI: Bing Image Search refinement cards",
            "Description": "Bing Image Search refinement cards.",
            "Link": "https://twitter.com/rustybrick/status/1827039600641970664"
        },
        {
            "Title": "ICYMI: Google dogs fighting it out",
            "Description": "ICYMI: Google dogs fighting it out",
            "Link": "https://twitter.com/rustybrick/status/1827035826355892357"
        },
        {
            "Title": "Now confirmed. Again, this makes complete sense, but good to hear from Google about rankings in AIOs being impacted by core updates. From @johnmu: \"These are a part of search, and core updates affect search, so yes.\" LinkedIn post from @Callmenicholi below.…",
            "Description": "Now confirmed. Again, this makes complete sense, but good to hear from Google about rankings in AIOs being impacted by core updates. From @johnmu: \"These are a part of search, and core updates affect search, so yes.\" LinkedIn post from @Callmenicholi below.…",
            "Link": "https://twitter.com/glenngabe/status/1827035342135763192"
        },
        {
            "Title": "RT by @rustybrick: Now confirmed. Again, this makes complete sense, but good to hear from Google about rankings in AIOs being impacted by core updates. From @johnmu: \"These are a part of search, and core updates affect search, so yes.\" LinkedIn post from @Callmenicholi below.…",
            "Description": "Now confirmed. Again, this makes complete sense, but good to hear from Google about rankings in AIOs being impacted by core updates. From @johnmu: \"These are a part of search, and core updates affect search, so yes.\" LinkedIn post from @Callmenicholi below.…",
            "Link": "https://twitter.com/glenngabe/status/1827035342135763192"
        },
        {
            "Title": "RT by @rustybrick: Google's @JohnMu just confirmed (what we suspected based on @glenngabe share) - AI Overview links / citations are impacted by Google Core Updates",
            "Description": "Google's @JohnMu just confirmed (what we suspected based on @glenngabe share) - AI Overview links / citations are impacted by Google Core Updates",
            "Link": "https://twitter.com/rustybrick/status/1827034944511545760"
        },
        {
            "Title": "Perplexity's pitch deck offers advertisers a new vision for AI search",
            "Description": "A new advertiser pitch deck shows how the AI search startup hopes to win over advertisers later this year with new cross-platform formats.",
            "Link": "https://digiday.com/media-buying/perplexitys-pitch-deck-offers-advertisers-a-new-vision-for-ai-search/"
        },
        {
            "Title": "I wonder what else this could be used for? :) -> Google wants to know where you might click [Patent] \"The company is seeking to patent predictive retrieval of content based on cursor trajectory.\"\"The method further includes, while the primary media item is being viewed by the…",
            "Description": "I wonder what else this could be used for? :) -> Google wants to know where you might click [Patent] \"The company is seeking to patent predictive retrieval of content based on cursor trajectory.\"\"The method further includes, while the primary media item is being viewed by the…",
            "Link": "https://twitter.com/glenngabe/status/1827033934862934098"
        },
        {
            "Title": "Google AI Overview: What does it mean for SEO?",
            "Description": "Now that Google AI Overviews (AIOs) have arrived in the UK, have the results improved, and what impact will it have on SEO?",
            "Link": "https://browsermedia.agency/blog/google-ai-overview-what-does-it-mean-for-seo/"
        },
        {
            "Title": "SEO Video Recap: Google fixing the search ranking bug, ongoing August core update swings, AI Overviews, Google Ads bugs and much more",
            "Description": "SEO Video Recap: Google fixing the search ranking bug, ongoing August core update swings, AI Overviews, Google Ads bugs and much more",
            "Link": "https://twitter.com/rustybrick/status/1826998077984821699"
        },
        {
            "Title": "I am starting to see Google Analytics data flowing in again - I see data for yesterday now",
            "Description": "I am starting to see Google Analytics data flowing in again - I see data for yesterday now",
            "Link": "https://twitter.com/rustybrick/status/1826996135501693208"
        },
        {
            "Title": "Google is migrating all merchants to Google Merchant Center Next in September",
            "Description": "Google is migrating all merchants to Google Merchant Center Next in September",
            "Link": "https://twitter.com/rustybrick/status/1826994302418813307"
        },
        {
            "Title": "Google Search Console search appearance documentation updated",
            "Description": "Google Search Console search appearance documentation updated",
            "Link": "https://twitter.com/rustybrick/status/1826989017415450894"
        },
        {
            "Title": "Google Search local pack UX update",
            "Description": "Google Search local pack UX update",
            "Link": "https://twitter.com/rustybrick/status/1826986752499679705"
        },
        {
            "Title": "Having lots of nofollow and/or noindex tags doesn't signify to Google that you have a lot of low-quality pages",
            "Description": "Tweet from user @rustybrick stating that having lots of nofollow and/or noindex tags on a website does not indicate to Google that the site has many low-quality pages.",
            "Link": "https://twitter.com/rustybrick/status/1826982978473607376"
        },
        {
            "Title": "Bing Image Search refinement cards",
            "Description": "Tweet from user @rustybrick mentioning Bing Image Search refinement cards, potentially indicating new features or updates to the image search functionality.",
            "Link": "https://twitter.com/rustybrick/status/1826979203457376712"
        },
        {
            "Title": "Good News! Now You Can Easily Transform Your AI Images from Square to Landscape on Microsoft Bing Image Creator",
            "Description": "Article announcing a new feature in Microsoft Bing Image Creator that allows users to easily resize AI-generated images from square to landscape format using the built-in Resize option.",
            "Link": "https://www.digitalinformationworld.com/2024/08/how-to-convert-bing-ai-generated-square-images-to-landscape-by-selecting-resize-much-needed-feature.html"
        },
        {
            "Title": "Reddit's ad revenue to reach $1.1B+ in 2024",
            "Description": "Tweet from user @glenngabe sharing an analysis that predicts Reddit's ad revenue will exceed $1.1 billion in 2024. The analysis highlights Reddit's success in attracting advertisers through interest-based targeting via subreddits instead of relying on personal data.",
            "Link": "https://twitter.com/glenngabe/status/1826961684860108942"
        },
        {
            "Title": "Oh, and here's my case study about redirects to non-relevant urls, and Google seeing those as soft 404s. Again, 404s are totally fine, and can be good. Don't blind redirect urls to categories, your homepage, etc.",
            "Description": "Tweet from user @glenngabe sharing a case study about redirects to non-relevant URLs and how Google interprets them as soft 404 errors. The tweet emphasizes that using 404 errors is acceptable and often preferable to blindly redirecting URLs to irrelevant pages like category pages or the homepage.",
            "Link": "https://twitter.com/glenngabe/status/1826957261220040807"
        },
        {
            "Title": "Having many noindexed pages is NOT a sign of low quality...",
            "Description": "Tweet thread from user @glenngabe discussing how having a large number of noindexed pages on a website does not necessarily indicate poor website quality. The thread challenges the misconception that a high volume of noindexed URLs equates to low-quality content and provides insights based on the user's experience working with clients.",
            "Link": "https://twitter.com/glenngabe/status/1826954250573779082"
        },
        {
            "Title": "Video: Google Ranking Bug Fixed, August Core Update Swings, AI Overviews, Google Ads Bug & More",
            "Description": "SEO news recap video covering various topics including Google fixing a search ranking bug, ongoing fluctuations from the August core update, AI overviews, a Google Ads bug, and more.",
            "Link": "https://www.seroundtable.com/video-08-23-2024-37961.html"
        },
        {
            "Title": "Run a podcast? Interesting -&gt; Cumulus Media Study of 603 weekly podcast consumers: YouTube was the most popular podcast listening platform in the US with 31% of respondents saying they use it, followed by Spotify at 21% and Apple at 12%",
            "Description": "Tweet from user @glenngabe highlighting a Cumulus Media study revealing that YouTube is the most popular platform for listening to podcasts in the US, surpassing Spotify and Apple Podcasts.",
            "Link": "https://twitter.com/glenngabe/status/1826951262178341017"
        },
        {
            "Title": "The #SEOFOMO State of SEO Consulting in 2024 is here 🙌 What's the state of SEO Consulting in 2024? How difficult is it to achieve goals and sell services? What are the top SEO consulting threats and what we're doing about them? And what are the top tools? I've got the answers…",
            "Description": "Tweet from user @aleyda announcing the release of the #SEOFOMO State of SEO Consulting in 2024 report, which delves into the current landscape of SEO consulting, addressing challenges, threats, and top tools used in the industry.",
            "Link": "https://twitter.com/aleyda/status/1826950952139583722"
        },
        {
            "Title": "Google migrating all merchants to Google Merchant Center Next next month (September)",
            "Description": "Tweet from user @rustybrick announcing that Google will be migrating all merchants to the new Google Merchant Center Next platform in September.",
            "Link": "https://twitter.com/rustybrick/status/1826950262042325466"
        },
        {
            "Title": "Hard story to read, the folks at @hardbaconca got hit hard by the Google Sep helpful content update, then had to file bankruptcy the day before the core update was announced, the next day, their traffic quadrupled",
            "Description": "Tweet from user @rustybrick sharing a story about a company called Hardbacon that experienced a significant traffic drop after being impacted by Google's September helpful content update. The company subsequently filed for bankruptcy, but their traffic unexpectedly quadrupled the day after the core update was announced.",
            "Link": "https://twitter.com/rustybrick/status/1826947745711853925"
        },
        {
            "Title": "Google Search local pack user experience update",
            "Description": "No description available.",
            "Link": "https://twitter.com/rustybrick/status/1826945228965552305"
        },
        {
            "Title": "Google's take on nofollow and noindex tags",
            "Description": "Google's @g33konaut stated that having a large number of nofollow and/or noindex tags does not indicate to Google that a website has a lot of low-quality pages.",
            "Link": "https://twitter.com/rustybrick/status/1826942712551203313"
        },
        {
            "Title": "Bing Image Search refinement image cards",
            "Description": "Bing Image Search now incorporates refinement cards directly within its results interface. These cards provide refinement options for search queries, accompanied by example photos representing potential results for the refined search.",
            "Link": "https://twitter.com/rustybrick/status/1826940195641385273"
        },
        {
            "Title": "Bing Image Search Refinement Cards",
            "Description": "Microsoft now has these refinement cards or boxes directly in the Bing Image Search results interface.  In these cards, Bing will show you a refinement option for your query with example photos you might find for that refined search query.",
            "Link": "https://www.seroundtable.com/bing-images-search-refinement-cards-37927.html"
        },
        {
            "Title": "New updated and super detailed Google Search Console search appearance documentation",
            "Description": "No description available.",
            "Link": "https://twitter.com/rustybrick/status/1826938686262464945"
        },
        {
            "Title": "Google Analytics experiencing data delays",
            "Description": "Google Analytics is currently experiencing data delays, with data from yesterday and today missing. However, real-time data is functioning, suggesting a potential resolution soon.",
            "Link": "https://twitter.com/rustybrick/status/1826922225489817654"
        },
        {
            "Title": "Bing Trends",
            "Description": "The Bing Trends hub is a centralized collection of resources that encompass fundamental and advanced bing concepts and techniques.",
            "Link": "https://www.designrush.com/agency/paid-media-pay-per-click/bing/trends"
        },
        {
            "Title": "Bing Ads vs. Google Ads: What Is the Difference? (2024)",
            "Description": "Explore the differences between Bing ads vs. Google ads, examining their unique strengths, and effectiveness in reaching diverse audiences.",
            "Link": "https://www.designrush.com/agency/paid-media-pay-per-click/bing/trends/bing-ads-vs-google-ads"
        },
        {
            "Title": "Top 10 SEO Trends For Lawyers To Know In 2024",
            "Description": "Discover the top 10 SEO trends to watch in 2024 and transform your law firm's digital presence. Stay ahead with AI, voice search, mobile-first indexing, and more.",
            "Link": "https://www.lawfuel.com/top-seo-trends-for-lawyers/"
        },
        {
            "Title": "Demure trend sparks brands' acknowledgment of creators' contributions to viral trends",
            "Description": "Creators from historically marginalized communities have long since been pushing to be credited for viral trends, it seems brands are finally starting to respond to the call.",
            "Link": "https://digiday.com/marketing/demure-trend-sparks-brands-acknowledgment-of-creators-contributions-to-viral-trends/"
        },
        {
            "Title": "Meet the company helping creators and brands reach audiences in China",
            "Description": "Meet East Goes Global works with more than 200 clients to get Western talent in front of audiences in China on Chinese apps.",
            "Link": "https://digiday.com/marketing/meet-the-company-helping-creators-and-brands-reach-audiences-in-china/"
        },
        {
            "Title": "Why puzzle fans lined up around the block for New York Times Games' first live event",
            "Description": "The New York Times approached its first live gaming event as a marketing opportunity.",
            "Link": "https://digiday.com/marketing/why-puzzle-fans-lined-up-around-the-block-for-new-york-times-games-first-live-event/"
        },
        {
            "Title": "Tweet from glenngabe on August 25, 2024",
            "Description": "Semrush can show image pack rankings surging in the core SERPs, but not Image Search results (the image tab). If you are seeing a surge in visibility, then check the organic research reporting, positions report, and check SERP features versus organic.",
            "Link": "https://twitter.com/glenngabe/status/1827709460946768070"
        },
        {
            "Title": "Tweet from glenngabe on August 25, 2024",
            "Description": "And in case you want to know what those image pack rankings look like, see an example below. Huge image pack at the top of the SERP. Again, I'm seeing some sites surge, but when digging in, you can see that rankings in SERP features are the biggest winners. Just something to keep",
            "Link": "https://twitter.com/glenngabe/status/1827691683544224069"
        },
        {
            "Title": "Media Buying Briefing: Agencies create full-time roles for creators as ‘pirates’ of marketing",
            "Description": "Whether it’s a holding company agency or influencer-focused shop, content creators are filling in-house roles from creative and strategy directors to community management for brands. This comes as various agencies need to move rapidly on social media trends and create more consistent, flexible content for their clients.",
            "Link": "https://digiday.com/media-buying/media-buying-briefing-agencies-create-full-time-roles-for-creators-as-pirates-of-marketing/"
        },
        {
            "Title": "Over a year and a half later, Netflix still has a long road ahead to get advertisers on board",
            "Description": "Netflix is currently left offering modest scale in terms of reach, high CPMs, limited targeting capabilities and little in the way of measurement, at least for now.",
            "Link": "https://digiday.com/marketing/over-a-year-and-a-half-later-netflix-still-has-a-long-road-ahead-to-get-advertisers-on-board/"
        },
        {
            "Title": "AI Briefing: The AI search race heats up with more audit tools, ads and pending antitrust outcomes",
            "Description": "Hubspot rolls out a new AI Search Grader tool for ChatGPT while Perplexity prepares advertisers for new formats.",
            "Link": "https://digiday.com/media-buying/ai-briefing-the-ai-search-race-heats-up-with-more-audit-tools-ads-and-pending-antitrust-outcomes/"
        },
        {
            "Title": "Confessions of a performance marketing ad buyer on 'uptick' in platforms' ad rejections amid election advertising",
            "Description": "As political advertising ramps up, one performance marketing ad buyer believes that the platforms are getting more sensitive and potentially taking a harsher look at ads on the platform.",
            "Link": "https://digiday.com/marketing/confessions-of-a-performance-marketing-ad-buyer-on-uptick-in-platforms-ad-rejections-amid-election-advertising/"
        },
        {
            "Title": "Google Says Title Tags \"Maybe\" Impact Rankings",
            "Description": "John Mueller's explanation of title tags' impact on rankings may be surprising, but here's why it makes sense",
            "Link": "https://www.searchenginejournal.com/google-says-title-tags-maybe-impact-rankings/525297/"
        },
        {
            "Title": "@rustybrick: Hardbacon got hit hard by the Google Sep helpful content update, then announced bankruptcy the day before the core update was announced, the next day, their traffic quadrupled seroundtable.com/hardbacon-core…",
            "Description": "Hardbacon got hit hard by the Google Sep helpful content update, then announced bankruptcy the day before the core update was announced, the next day, their traffic quadrupled seroundtable.com/hardbacon-core…",
            "Link": "https://twitter.com/rustybrick/status/1826990527721652331"
        },
        {
            "Title": "Here are some charts of the sites that are seeing surges/resurrections with the Google August 2024 core update after being slammed by the Sep 2023 helpful content update",
            "Description": "Charts of sites seeing ranking changes following the August 2024 Google core update.",
            "Link": "https://twitter.com/rustybrick/status/1828037426235023705"
        },
        {
            "Title": "Google overhauls its video SEO documentation after all the confusion around how to get video thumbnails in Google Search",
            "Description": "Google updates its video SEO documentation, addressing confusion around video thumbnails in search results.",
            "Link": "https://twitter.com/rustybrick/status/1828034908981244099"
        },
        {
            "Title": "Google is testing new default favicon designs",
            "Description": "Google is experimenting with new default designs for favicons.",
            "Link": "https://twitter.com/rustybrick/status/1828032392507936769"
        },
        {
            "Title": "Google's @g33konaut says sending \"bad actor\" fake traffic to a site won't result in the site losing trustworthiness from Google Search",
            "Description": "Google's John Mueller clarifies that sending fake traffic to a website will not negatively impact its trustworthiness in search rankings.",
            "Link": "https://twitter.com/rustybrick/status/1828030253815472440"
        },
        {
            "Title": "Google Business Profile appeal wait time is very delayed",
            "Description": "Google Business Profile users are experiencing significant delays in appeal processing times.",
            "Link": "https://twitter.com/rustybrick/status/1828027359255003567"
        },
        {
            "Title": "Google may now use your OG:title meta tag for your title link in the Google Search results snippet",
            "Description": "Google Search may now utilize the OG:title meta tag for title links in search result snippets.",
            "Link": "https://twitter.com/rustybrick/status/1828025850111123819"
        },
        {
            "Title": "Shopify SEO - How To Optimize Your Shopify Site For Google",
            "Description": "A guide on optimizing Shopify stores for Google search to enhance visibility and drive sales.",
            "Link": "https://www.searchenginejournal.com/shopify-seo-how-to-optimize-shopify-site-for-google/521978/"
        },
        {
            "Title": "Google Explains Why Low-Quality Traffic Can't Impact Rankings",
            "Description": "Google's Martin Splitt explains why low-quality traffic does not affect a website's trustworthiness in search rankings.",
            "Link": "https://www.searchenginejournal.com/google-explains-why-low-quality-traffic-cant-impact-rankings/525350/"
        },
        {
            "Title": "Get Your Free Bing SEO Scan",
            "Description": "An article highlighting the benefits of free site scans in Bing Webmaster Tools for SEO purposes.",
            "Link": "https://www.practicalecommerce.com/get-your-free-bing-seo-scan"
        },
        {
            "Title": "From the #SEOFOMO SEO Consulting Survey: A high share of SEOs expect Google updates benefiting certain sites types and their own features, as well as AI Overviews to become threats to their SEO consulting efforts.",
            "Description": "A tweet discussing findings from the #SEOFOMO SEO Consulting Survey, revealing concerns among SEOs about Google updates and AI impacting their work.",
            "Link": "https://twitter.com/aleyda/status/1827984802953224628"
        },
        {
            "Title": "Google August 2024 core update leads to some September helpful content update resurrections",
            "Description": "Observations about Google's August 2024 core update leading to some sites hit by the September 2023 helpful content update seeing some signs of recovery.",
            "Link": "https://twitter.com/rustybrick/status/1828081466439524383"
        },
        {
            "Title": "Google overhauls its video SEO documentation",
            "Description": "Google has updated its documentation for video SEO.",
            "Link": "https://twitter.com/rustybrick/status/1828077691125240080"
        },
        {
            "Title": "Google tests new default favicon designs",
            "Description": "Google is testing new designs for default favicons in search results.",
            "Link": "https://twitter.com/rustybrick/status/1828073916218200064"
        },
        {
            "Title": "A few important things today 1) HCU site ranking surges? 2) Weird (IMHO) guidelines on videos on the SERP3) @gregfinn has risen!",
            "Description": "Discussion of important Google updates, including surges for sites affected by the Helpful Content Update, new video guidelines, and other observations.",
            "Link": "https://twitter.com/MordyOberstein/status/1828070741012553733"
        },
        {
            "Title": "Google says sending \"bad actor\" fake traffic to a site won't result in the site losing trustworthiness from Google Search",
            "Description": "Google clarifies that sending fake traffic to a site won't necessarily harm its trustworthiness in search rankings.",
            "Link": "https://twitter.com/rustybrick/status/1828070141826871331"
        },
        {
            "Title": "It's New: Aug 26: Google HCU Surges, Video SEO, Merchant Center Next, OG Titles & Business Profile Appeals",
            "Description": "Summary of new developments in Google Search, including surges for sites affected by the Helpful Content Update, video SEO updates, and more.",
            "Link": "https://twitter.com/rustybrick/status/1828069997303726171"
        },
        {
            "Title": "Google Business Profile appeals are super delayed",
            "Description": "Google Business Profile appeals are currently experiencing significant delays.",
            "Link": "https://twitter.com/rustybrick/status/1828066366399623503"
        },
        {
            "Title": "Google may now use your OG title meta tag for your title link in Search",
            "Description": "Google Search may now use the OG title meta tag for title links in search results.",
            "Link": "https://twitter.com/rustybrick/status/1828063598339367360"
        },
        {
            "Title": "Good Morning Google Land! This is the August 26th edition of \"Core Update Notes\". First, some ecommerce and reviews sites are seeing some massive surges. Amazing timing for them leading into Q4 holiday shopping season. That's if those surges stick throughout the fall. If so, they…",
            "Description": "Observations on Google's August 2024 core update, noting significant ranking surges for some e-commerce and review websites.",
            "Link": "https://twitter.com/glenngabe/status/1828056850341765316"
        },
        {
            "Title": "The latest in Digital Marketing was just sent in #MarketingFOMO to +3K subscribers: * 6 Ways Spammers Exploit Google With Reddit * Meta’s New Ad Tools Promise More Precise Customer Targeting * TikTok Lives Can Help Boost Your Following — Here’s How to Go Live + Why You Should *…",
            "Description": "A roundup of recent digital marketing news, including how spammers are exploiting Google using Reddit, Meta's new ad targeting tools, and tips for using TikTok Live.",
            "Link": "https://twitter.com/aleyda/status/1828054156445179942"
        },
        {
            "Title": "\"You can also translate your custom voice-over into other languages.\" -> TikTok Enables Users to Create Their Own AI Voiceover Voice \"TikTok’s now enabling users to create AI simulations of their own voice in the app, so that you can voice over your TikTok clips with your own…",
            "Description": "TikTok now allows users to create AI-generated voiceovers using their own voices, which can also be translated into other languages.",
            "Link": "https://twitter.com/glenngabe/status/1828045687713358261"
        },
        {
            "Title": "Catch up on last week with the SEO Video Recap covering Google fixing the search ranking bug, ongoing August core update swings, AI Overviews, Google Ads bugs and much more",
            "Description": "A weekly SEO video recap covering topics such as Google fixing a search ranking bug, fluctuations from the August core update, AI Overviews, Google Ads bugs, and more.",
            "Link": "https://twitter.com/rustybrick/status/1828045478782443760"
        },
        {
            "Title": "I'll be running the latest numbers soon, but as of yesterday, 73 of the 390+ sites were surging back (to some extent). Many are still down big-time from where they were before the Sep HCU(X), but there are some showing significant recovery (even beyond where they were...) Stay…",
            "Description": "Update on the recovery of websites affected by the September Helpful Content Update, with some sites showing significant improvement in rankings.",
            "Link": "https://twitter.com/glenngabe/status/1828044479921573944"
        },
        {
            "Title": "So, you can worry about the default favicons displayed in the SERPs.... OR YOU CAN FIX YOUR OWN FAVICON AND HAVE THAT RANKING INSTEAD. I like the new versions of the generic favicon being tested, but again, HAVE YOUR OWN FAVICON INSTEAD. Also, I think I know a certain someone…",
            "Description": "Advice to focus on creating a custom favicon for better visibility in search results, rather than worrying about Google's new default favicon designs.",
            "Link": "https://twitter.com/glenngabe/status/1828040591034237043"
        },
        {
            "Title": "Google just updated its documentation for this. Title links in the SERPs can now reflect what og:title contains. From Google: \"Google Search can use content within og:title meta tags to automatically generate title links.\" So definitely check what's used for og:title.. :)",
            "Description": "Google has updated its documentation to reflect that title links in search results can now use the content from the og:title meta tag.",
            "Link": "https://twitter.com/glenngabe/status/1828039269446734304"
        },
        {
            "Title": "Google August 2024 Core Update Helpful Content Surge Charts",
            "Description": "Analysis of Google's August 2024 core update, with charts showing ranking surges for some websites, particularly those affected by the September 2023 helpful content update.",
            "Link": "https://www.seroundtable.com/google-august-core-update-helpful-content-surge-charts-37970.html"
        },
        {
            "Title": "What could go wrong? -> Google’s AI ‘Reimagine’ tool helped us add wrecks, disasters, and corpses to our photos Yep, you could always do this via Photoshop and other tools, but this makes it very, very easy for the average person (or kid) to do... theverge.com/2024/8/21/2422…",
            "Description": "Discussion about the potential misuse of Google's AI \"Reimagine\" tool, which allows users to easily manipulate images and potentially create disturbing content.",
            "Link": "https://twitter.com/glenngabe/status/1828037119605887159"
        },
        {
            "Title": "Google’s Revamped Documentation Shows 4 Reasons To Refresh Content 👀 1. Remove Outdated Content 2. Improved Information Density 3. Add Fresh Information 4. Update For Brevity And Clarity Read article by @martinibuster : searchenginejournal.com/googles-revamp…",
            "Description": "Google's updated documentation highlights four reasons to refresh content: removing outdated information, improving information density, adding fresh insights, and updating for brevity and clarity.",
            "Link": "https://twitter.com/aleyda/status/1828034764877508946"
        },
        {
            "Title": "Google Search may now use OG title for title links",
            "Description": "Google Search has added the OG title meta tag as a potential source for generating title links in search results.",
            "Link": "https://searchengineland.com/google-search-may-now-use-og-title-for-title-links-446023"
        },
        {
            "Title": "RT by @aleyda: Look at this blatant and deliberate removal of my article as a canonical source of information about link inversion. Watch till the end to see the clumsy attempt at hiding.",
            "Description": "Allegation of plagiarism and removal of canonical source information related to the topic of \"link inversion.\"",
            "Link": "https://twitter.com/dejanseo/status/1827947107548016985"
        }
    ],
    "reviewed_urls": [
        "https://www.searchenginejournal.com/google-shows-how-to-block-bots-and-boost-site-performance/525331/",
        "https://twitter.com/aleyda/status/1827763173161865677",
        "https://twitter.com/aleyda/status/1827721761288601732",
        "https://twitter.com/aleyda/status/1827719553377595756",
        "https://www.thehypemagazine.com/2024/08/the-hype-magazine-editor-in-chief-dr-jerry-doby-cited-in-new-seo-research/",
        "https://twitter.com/glenngabe/status/1827693848044159116",
        "https://www.practicalecommerce.com/5-predictions-for-the-2024-holiday-shopping-season",
        "https://twitter.com/glenngabe/status/1827687187170611690",
        "https://twitter.com/glenngabe/status/1827679029635240087",
        "https://twitter.com/glenngabe/status/1827677717354975370",
        "https://twitter.com/glenngabe/status/1827676508548124877",
        "https://twitter.com/rustybrick/status/1827658302609657950",
        "https://www.fox28spokane.com/popular-piano-bar-musician-to-perform-at-bing-crosby-theatre/",
        "https://www.khq.com/news/popular-piano-bar-musician-to-perform-at-bing-crosby-theatre/article_3485d120-628d-11ef-aafc-438d7c027460.html",
        "https://www.gbnews.com/tech/how-to-disable-ai-overviews-in-google-search-uk",
        "https://www.searchenginejournal.com/googles-revamped-documentation-shows-4-reasons-to-refresh-content/525290/",
        "https://business-review.eu/uncategorized-en/best-seo-experts-to-follow-on-facebook-in-2025-267291",
        "https://timesofindia.indiatimes.com/entertainment/english/hollywood/news/matthew-perrys-legacy-beyond-chandler-bing-a-beacon-of-hope-and-resilience/articleshow/112764512.cms",
        "http://www.recordcourier.com/news/2024/aug/24/ranchos-trail-design-prompts-bing-pit-questions/",
        "https://twitter.com/aleyda/status/1827267209472680088",
        "https://twitter.com/aleyda/status/1827244839445971168",
        "https://www.searchenginejournal.com/google-confirms-ai-overviews-affected-by-core-updates/525239/",
        "https://www.scmp.com/tech/big-tech/article/3275717/baidu-blocks-google-bing-scraping-content-amid-demand-data-used-ai-projects",
        "https://www.searchenginejournal.com/6-ways-spammers-exploit-google-with-reddit/525231/",
        "https://www.foxnews.com/entertainment/matthew-perrys-alleged-ketamine-queen-drug-dealer-may-have-called-him-code-name-chandler",
        "https://twitter.com/rustybrick/status/1827093963972735181",
        "https://twitter.com/glenngabe/status/1827083409799200950",
        "https://www.openpr.com/news/3633281/custom-seo-packages-outperform-cookie-cutter-solutions-by-over",
        "https://twitter.com/glenngabe/status/1827064649885635030",
        "https://twitter.com/rustybrick/status/1827058475324555342",
        "https://www.palestineherald.com/news/bing-leaves-lasting-mark-on-westwood-isd/article_66563940-6181-11ef-8a5b-b3c092484eb9.html",
        "https://twitter.com/rustybrick/status/1827054700698779787",
        "https://twitter.com/rustybrick/status/1827052687348904143",
        "https://twitter.com/rustybrick/status/1827050925451575419",
        "https://twitter.com/rustybrick/status/1827047150863446406",
        "https://twitter.com/rustybrick/status/1827043375805018429",
        "https://twitter.com/rustybrick/status/1827039600641970664",
        "https://twitter.com/rustybrick/status/1827037821980250340",
        "https://twitter.com/rustybrick/status/1827036530113966230",
        "https://twitter.com/rustybrick/status/1827035826355892357",
        "https://twitter.com/glenngabe/status/1827035342135763192",
        "https://twitter.com/glenngabe/status/1827035342135763192",
        "https://www.benzinga.com/markets/cannabis/24/08/40533363/how-seo-trauma-is-costing-weed-brands-70-of-sales-and-why-most-dispensaries-fail-jp-donahue-unle",
        "https://twitter.com/rustybrick/status/1827034944511545760",
        "https://digiday.com/media-buying/perplexitys-pitch-deck-offers-advertisers-a-new-vision-for-ai-search/",
        "https://twitter.com/glenngabe/status/1827033934862934098",
        "https://www.daytondailynews.com/lifestyles/premiere-date-set-for-thinktv-bing-davis-documentary/PMIE6QF5SNDLTPIEVTSBIHEOSA/",
        "https://twitter.com/glenngabe/status/1827012161408847986",
        "https://twitter.com/rustybrick/status/1827007256858145259",
        "https://twitter.com/glenngabe/status/1827002570818130268",
        "https://browsermedia.agency/blog/google-ai-overview-what-does-it-mean-for-seo/",
        "https://twitter.com/glenngabe/status/1827001675388686684",
        "https://twitter.com/rustybrick/status/1826998077984821699",
        "https://twitter.com/rustybrick/status/1826996135501693208",
        "https://twitter.com/rustybrick/status/1826994302418813307",
        "https://twitter.com/rustybrick/status/1826989017415450894",
        "https://twitter.com/rustybrick/status/1826988106613956849",
        "https://twitter.com/rustybrick/status/1826987961562313061",
        "https://twitter.com/rustybrick/status/1826986752499679705",
        "https://twitter.com/rustybrick/status/1826986471141560569",
        "https://twitter.com/rustybrick/status/1826982978473607376",
        "https://twitter.com/rustybrick/status/1826979203457376712",
        "https://www.practicalecommerce.com/overstock-relaunches-q2-2024-recap",
        "https://twitter.com/glenngabe/status/1826977464997781922",
        "https://twitter.com/rustybrick/status/1826975427983757519",
        "https://twitter.com/glenngabe/status/1826969342015131804",
        "https://finance.yahoo.com/news/ignite-seo-awarded-top-position-130000555.html",
        "https://twitter.com/rustybrick/status/1826966439456039405",
        "https://twitter.com/rustybrick/status/1826966295218139251",
        "https://twitter.com/glenngabe/status/1826966138753806669",
        "https://twitter.com/rustybrick/status/1826964411535204367",
        "https://twitter.com/rustybrick/status/1826963788228161878",
        "https://twitter.com/rustybrick/status/1826963610049909158",
        "https://www.digitalinformationworld.com/2024/08/how-to-convert-bing-ai-generated-square-images-to-landscape-by-selecting-resize-much-needed-feature.html",
        "https://twitter.com/glenngabe/status/1826961684860108942",
        "https://twitter.com/glenngabe/status/1826957261220040807",
        "https://twitter.com/glenngabe/status/1826957261220040807",
        "https://twitter.com/glenngabe/status/1826956541817221213",
        "https://twitter.com/glenngabe/status/1826954250573779082",
        "https://twitter.com/rustybrick/status/1826952855904719328",
        "https://www.seroundtable.com/video-08-23-2024-37961.html",
        "https://twitter.com/aleyda/status/1826952145800708246",
        "https://twitter.com/glenngabe/status/1826951262178341017",
        "https://twitter.com/aleyda/status/1826950952139583722",
        "https://twitter.com/rustybrick/status/1826950262042325466",
        "https://twitter.com/rustybrick/status/1826949380898713912",
        "https://twitter.com/glenngabe/status/1826949086727037076",
        "https://twitter.com/rustybrick/status/1826948723038916824",
        "https://twitter.com/seroundtable/status/1826948136637485128",
        "https://twitter.com/rustybrick/status/1826947745711853925",
        "https://twitter.com/rustybrick/status/1826945544721215838",
        "https://twitter.com/rustybrick/status/1826945228965552305",
        "https://twitter.com/rustybrick/status/1826942712551203313",
        "https://twitter.com/rustybrick/status/1826940195641385273",
        "https://www.seroundtable.com/bing-images-search-refinement-cards-37927.html",
        "https://twitter.com/rustybrick/status/1826938686262464945",
        "https://hackread.com/best-seo-experts-to-follow-on-x-twitter-in-2025/",
        "https://twitter.com/rustybrick/status/1826937439019323784",
        "https://twitter.com/rustybrick/status/1826922225489817654",
        "https://twitter.com/rustybrick/status/1826919276516717023",
        "https://twitter.com/rustybrick/status/1826919166286123468",
        "https://www.designrush.com/agency/paid-media-pay-per-click/bing/trends",
        "https://www.designrush.com/agency/paid-media-pay-per-click/bing/trends/bing-ads-vs-google-ads",
        "https://www.lawfuel.com/top-seo-trends-for-lawyers/",
        "https://digiday.com/marketing/demure-trend-sparks-brands-acknowledgment-of-creators-contributions-to-viral-trends/",
        "https://digiday.com/marketing/meet-the-company-helping-creators-and-brands-reach-audiences-in-china/",
        "https://digiday.com/marketing/why-puzzle-fans-lined-up-around-the-block-for-new-york-times-games-first-live-event/",
        "https://twitter.com/rustybrick/status/1826775428457267360",
        "https://twitter.com/glenngabe/status/1827709993958973479",
        "https://twitter.com/glenngabe/status/1827709460946768070",
        "https://twitter.com/glenngabe/status/1827691683544224069",
        "https://www.martechcube.com/ignite-seo-ranked-1-seo-agency-in-london-by-design-rush/",
        "https://twitter.com/aleyda/status/1827971129773838412",
        "https://digiday.com/media-buying/media-buying-briefing-agencies-create-full-time-roles-for-creators-as-pirates-of-marketing/",
        "https://digiday.com/marketing/over-a-year-and-a-half-later-netflix-still-has-a-long-road-ahead-to-get-advertisers-on-board/",
        "https://digiday.com/media-buying/ai-briefing-the-ai-search-race-heats-up-with-more-audit-tools-ads-and-pending-antitrust-outcomes/",
        "https://digiday.com/marketing/duolingo-wants-to-make-its-green-owl-mascot-as-famous-as-pikachu-with-its-first-pop-up-store/",
        "https://digiday.com/marketing/confessions-of-a-performance-marketing-ad-buyer-on-uptick-in-platforms-ad-rejections-amid-election-advertising/",
        "https://twitter.com/rustybrick/status/1827886142722580848",
        "https://twitter.com/aleyda/status/1827753681208369424",
        "https://www.searchenginejournal.com/google-says-title-tags-maybe-impact-rankings/525297/",
        "https://twitter.com/rustybrick/status/1826990527721652331",
        "https://twitter.com/rustybrick/status/1828037426235023705",
        "https://twitter.com/rustybrick/status/1828034908981244099",
        "https://twitter.com/rustybrick/status/1828032392507936769",
        "https://twitter.com/rustybrick/status/1828030253815472440",
        "https://twitter.com/rustybrick/status/1828027359255003567",
        "https://twitter.com/rustybrick/status/1828025850111123819",
        "https://twitter.com/rustybrick/status/1828024602800603363",
        "https://www.searchenginejournal.com/shopify-seo-how-to-optimize-shopify-site-for-google/521978/",
        "https://www.searchenginejournal.com/google-explains-why-low-quality-traffic-cant-impact-rankings/525350/",
        "https://www.practicalecommerce.com/get-your-free-bing-seo-scan",
        "https://www.practicalecommerce.com/new-ecommerce-tools-august-26-2024",
        "https://twitter.com/aleyda/status/1827984802953224628",
        "https://www.binghamton.edu/news/story/5082/meet-bing-real-life-bearcat-joins-binghamtons-mascot-lineup",
        "https://www.asiaone.com/business/linkbuilderio-addresses-optimal-timing-link-building-campaigns",
        "https://twitter.com/rustybrick/status/1828081466439524383",
        "https://twitter.com/rustybrick/status/1828077691125240080",
        "https://twitter.com/rustybrick/status/1828073916218200064",
        "https://twitter.com/MordyOberstein/status/1828070741012553733",
        "https://twitter.com/rustybrick/status/1828070141826871331",
        "https://twitter.com/rustybrick/status/1828069997303726171",
        "https://twitter.com/rustybrick/status/1828066366399623503",
        "https://twitter.com/rustybrick/status/1828063598339367360",
        "https://twitter.com/rustybrick/status/1828062592243491006",
        "https://twitter.com/glenngabe/status/1828056850341765316",
        "https://twitter.com/aleyda/status/1828054156445179942",
        "https://twitter.com/glenngabe/status/1828045687713358261",
        "https://twitter.com/rustybrick/status/1828045478782443760",
        "https://twitter.com/glenngabe/status/1828044479921573944",
        "https://twitter.com/glenngabe/status/1828040591034237043",
        "https://twitter.com/glenngabe/status/1828039269446734304",
        "https://www.seroundtable.com/google-august-core-update-helpful-content-surge-charts-37970.html",
        "https://twitter.com/glenngabe/status/1828037119605887159",
        "https://twitter.com/aleyda/status/1828034764877508946",
        "https://searchengineland.com/google-search-may-now-use-og-title-for-title-links-446023",
        "https://twitter.com/dejanseo/status/1827947107548016985",
        "http://en.people.cn/n3/2024/0826/c90000-20210387.html"
    ]
}