{
    "valid_articles": [
        {
            "Title": "Google updates its search ranking algorithm with a focus on Core Web Vitals.",
            "Description": "It's an unusually calm weekend in terms of Google ranking volatility - is this a conspiracy of sorts? (too soon?)",
            "Link": "https://twitter.com/rustybrick/status/1812457312310771862"
        },
        {
            "Title": "Google Search Console update: New settings for shipping and return information",
            "Description": "ICYMI: New Google Search Console settings for shipping and return information",
            "Link": "https://twitter.com/rustybrick/status/1811830635197251812"
        },
        {
            "Title": "Google testing auto-playing video thumbnails in search results",
            "Description": "ICYMI: Google testing auto-playing video thumbnails in the search results?",
            "Link": "https://twitter.com/rustybrick/status/1811826860289880319"
        },
        {
            "Title": "Bing Search tests voting on search results",
            "Description": "ICYMI: Bing Search tests voting on search results",
            "Link": "https://twitter.com/rustybrick/status/1811823085580124191"
        },
        {
            "Title": "Google confirms ads can show up below organic featured snippets as part of its new \"dynamic ad placement evolution\"",
            "Description": "ICYMI: Google confirms ads can show up below organic featured snippets as part of its new \"dynamic ad placement evolution\"",
            "Link": "https://twitter.com/rustybrick/status/1811819310593245587"
        },
        {
            "Title": "A look at MetaFilter, which turns 25 on July 14; owner Jessamyn West, who helped stabilize it after its near death, doesn't plan to license its archives to AI",
            "Description": "With a big surge in visibility with Google's 'Hidden Gems' update in fall of 2023 :) -> A look at MetaFilter, which turns 25 on July 14; owner Jessamyn West, who helped stabilize it after its near death, doesn't plan to license its archives to AI wired.com/story/metafilt… via…",
            "Link": "https://twitter.com/glenngabe/status/1812459470854783274"
        },
        {
            "Title": "How Google AI Overview Selects and Links to Sources",
            "Description": "Good post from @richsangerSEO about why content that's not ranking well for a query could be in AI overviews. This is similar to what @RyanJones covered at SMX Advanced -> How Google AI Overview Selects and Links to Sources \"The AI Overview process for selecting documents…",
            "Link": "https://twitter.com/glenngabe/status/1812108902005342256"
        },
        {
            "Title": "COPIED Act - New Senate bill seeks to protect artists’ and journalists’ content from AI use.",
            "Description": "COPIED Act -> New Senate bill seeks to protect artists’ and journalists’ content from AI use. Stands for \"Content Origin Protection and Integrity from Edited and Deepfaked Media Act\" \"The bill is designed to give content owners, such as journalists, newspapers, artists,…",
            "Link": "https://twitter.com/glenngabe/status/1812106752978022572"
        },
        {
            "Title": "OpenAI working on 'Strawberry' project to improve AI model reasoning capabilities",
            "Description": "\"Navigate the internet autonomously and reliably to perform deep research\" -> OpenAI is working on a project code named 'Strawberry', formerly known as Q*, which aims to improve AI model reasoning capabilities \"The document describes a project that uses Strawberry models with…",
            "Link": "https://twitter.com/glenngabe/status/1812104709068501475"
        },
        {
            "Title": "JavaScript Rendering and SEO",
            "Description": "Interested in JavaScript rendering? Good SOTR podcast with Zoe Clifford, @JohnMu, and @g33konaut covering all things JS rendering and SEO Including: *How rendering is very expensive, but ALL pages are rendered, even pages that don't require JS. *Google can pick up structured…",
            "Link": "https://twitter.com/glenngabe/status/1812119592371630503"
        },
        {
            "Title": "Brandon (retrododo.com) met with Danny Sullivan to discuss the current state of search",
            "Description": "Brandon met with Danny to discuss the current state of search, to provide feedback to Google from a creator's perspective, and more. Brandon runs retrododo.com, which has been heavily impacted by the September HCU(X). You can read the post to learn more about what…",
            "Link": "https://twitter.com/glenngabe/status/1811816637907275984"
        },
        {
            "Title": "Majestic to discontinue its disavow links feature",
            "Description": "Majestic will discontinue its disavow links feature. The company never encouraged customers to use the feature and does not believe it is an effective way to identify toxic links.",
            "Link": "https://twitter.com/glenngabe/status/1811797065946616018"
        },
        {
            "Title": "Amazon's AI shopping assistant Rufus is live",
            "Description": "Amazon's AI shopping assistant, Rufus, is now available to all US customers in the Amazon mobile app. Rufus was first announced in February and has been trained on Amazon's product catalog.",
            "Link": "https://twitter.com/glenngabe/status/1811795595255861718"
        },
        {
            "Title": "Cracking Open The Local SEO Bucket: 5 Finger-lickin' Strategies For 2024",
            "Description": "Explore the core areas of discovery, relevance, experience, engagement, and conversions, with actionable takeaways to master the dynamic landscape of local SEO.",
            "Link": "https://www.searchenginejournal.com/webinar-lp-cracking-open-the-local-seo-bucket-5-finger-lickin-strategies-for-2024/"
        },
        {
            "Title": "SEO Video recap: Google volatility x2, another Google indexing bug, Google Ads defaulting to broad match and YouTube SEO tips",
            "Description": "This week, guess what, we had more volatility over the weekend and also a blip in the middle of the week.  Google also had another indexing bug that lasted only about an hour.  Google Search Console had a bug with new owner notifications. Google Search Console now lets you enter your shipping and return policies in settings. Google said it found the feedback it collected on the last core update really helpful.  Google updated its URL best practices document to say don’t use fragments to change content on the page.  Google Search will now extract composite images with trained algorithmic media types...",
            "Link": "https://twitter.com/rustybrick/status/1811777788015251745"
        },
        {
            "Title": "Remove Thumbtack booking / appointment links on your Google Business Profile",
            "Description": "Google My Business is removing Thumbtack booking and appointment links from business profiles.",
            "Link": "https://twitter.com/rustybrick/status/1811774012034515062"
        },
        {
            "Title": "3D/AR objects in the SERPs is finally expanding to more retailers",
            "Description": "3D/AR objects are appearing in Google Search results for more retailers. This feature was previously in beta and is now rolling out more broadly.",
            "Link": "https://twitter.com/glenngabe/status/1811772822944952515"
        },
        {
            "Title": "New Google Search Console settings for shipping and return information",
            "Description": "Google Search Console now has new settings for businesses to enter their shipping and return policies.",
            "Link": "https://twitter.com/rustybrick/status/1811770237240664229"
        },
        {
            "Title": "Google testing auto-playing video thumbnails in the search results?",
            "Description": "Google is testing auto-playing video thumbnails in its search results.",
            "Link": "https://twitter.com/rustybrick/status/1811766462253518867"
        },
        {
            "Title": "Bing Search tests voting on search results",
            "Description": "Bing is testing a new feature that allows users to vote on search results.",
            "Link": "https://twitter.com/rustybrick/status/1811762687711592494"
        },
        {
            "Title": "Google confirms ads can show up below organic featured snippets as part of its new \"dynamic ad placement evolution\"",
            "Description": "Google has confirmed that ads can now appear below organic featured snippets in search results. This is part of Google's ongoing evolution of dynamic ad placement.",
            "Link": "https://twitter.com/rustybrick/status/1811758912552464433"
        },
        {
            "Title": "Google making more use of the right sidebar on desktop, and overlays in general on mobile.",
            "Description": "Google is making more use of the right sidebar on desktop search results and overlays on mobile search results. This is similar to the experience when clicking on a merchant listing.",
            "Link": "https://twitter.com/glenngabe/status/1811754908829335700"
        },
        {
            "Title": "Ugly Ads Perform Best, Marketer Says",
            "Description": "Barry Hott recommends ugly ads, those that people won't skip over. First reactions to an ad largely determine its performance, he states.",
            "Link": "https://www.practicalecommerce.com/ugly-ads-perform-best-marketer-says"
        },
        {
            "Title": "AI overviews in search results have not dropped to 7%",
            "Description": "Glenn Gabe reports that AI overviews in search results have not dropped to 7%, as previously reported by BrightEdge. Gabe's own tracking shows that AI overviews still make up around 14% of search results.",
            "Link": "https://twitter.com/glenngabe/status/1811741087532482999"
        },
        {
            "Title": "OpenAI search coming?",
            "Description": "OpenAI is reportedly working on a search product. This news comes from an interview with the CEO of The Atlantic, who recently signed a deal with OpenAI.",
            "Link": "https://twitter.com/rustybrick/status/1811737413384839189"
        },
        {
            "Title": "OpenAI is working on a search product",
            "Description": "OpenAI is working on a search product, according to an interview with the CEO of The Atlantic. The CEO stated that OpenAI is building a search product as part of a larger deal between the two companies.",
            "Link": "https://twitter.com/glenngabe/status/1811734656263369055"
        },
        {
            "Title": "Video: Google Volatility, Indexing Bugs, Google Ads Broad Match Default & YouTube SEO Tips",
            "Description": "This video covers recent Google volatility, indexing bugs, Google Ads defaulting to broad match, and YouTube SEO tips.",
            "Link": "https://www.seroundtable.com/video-07-12-2024-37721.html"
        },
        {
            "Title": "Bixby is getting an AI revamp",
            "Description": "Samsung is revamping its Bixby voice assistant with a focus on AI. The company is hoping to make Bixby more competitive with Google Assistant and Apple's Siri.",
            "Link": "https://twitter.com/glenngabe/status/1811730885831475428"
        },
        {
            "Title": "How to remove Thumbtack booking / appointment links on your Google Business Profile when the service is doing it without you asking for it",
            "Description": "How to remove Thumbtack booking / appointment links on your Google Business Profile when the service is doing it without you asking for it",
            "Link": "https://twitter.com/rustybrick/status/1811729972022903133"
        },
        {
            "Title": "Google Search Console now lets you enter your shipping and return information directly in the settings section",
            "Description": "Google Search Console now lets you enter your shipping and return information directly in the settings section",
            "Link": "https://twitter.com/rustybrick/status/1811727455188812280"
        },
        {
            "Title": "Google Search may be testing auto-playing video thumbnails in the search results",
            "Description": "Google Search may be testing auto-playing video thumbnails in the search results",
            "Link": "https://twitter.com/rustybrick/status/1811724938836897963"
        },
        {
            "Title": "Bing Search testing voting on search results, with showing voting distributions  via @shemiadhikarath",
            "Description": "Bing Search testing voting on search results, with showing voting distributions via @shemiadhikarath",
            "Link": "https://twitter.com/rustybrick/status/1811722422124708129"
        },
        {
            "Title": "Bing Search Testing Voting Feature",
            "Description": "Bing is testing a voting feature in the Bing Search results. You can vote up or vote down specific search results in the search results page.  It even shows you the percentage of votes for those who voted it up versus voted it down.",
            "Link": "https://www.seroundtable.com/bing-search-testing-voting-feature-37719.html"
        },
        {
            "Title": "Google's @adsliaison confirms ads can show up below organic featured snippets as part of its new \"dynamic ad placement evolution\"  via @LidiaInfanteM @seostrategaEN @kevin_indig and more",
            "Description": "Google's @adsliaison confirms ads can show up below organic featured snippets as part of its new \"dynamic ad placement evolution\" via @LidiaInfanteM @seostrategaEN @kevin_indig and more",
            "Link": "https://twitter.com/rustybrick/status/1811719905563005206"
        },
        {
            "Title": "Maybe Google Ads is not using broad match for the default for all search campaigns after all?",
            "Description": "Maybe Google Ads is not using broad match for the default for all search campaigns after all?",
            "Link": "https://twitter.com/rustybrick/status/1811699463733346435"
        },
        {
            "Title": "AI Briefing: Senators propose new regulations for privacy, transparency and copyright protections",
            "Description": "A new bill called the COPIED Act aims to pass new transparency standards to protect IP and guard against AI-generated misinformation.",
            "Link": "https://digiday.com/media/ai-briefing-senators-propose-new-regulations-for-privacy-transparency-and-copyright-protections/"
        },
        {
            "Title": "Companies seem determined to make everything a retail media network. How did we get here?",
            "Description": "Brands are leveraging retail media to push the boundaries of where and how we can shop. How did we get here?",
            "Link": "https://digiday.com/marketing/companies-seem-determined-to-make-everything-a-retail-media-network-how-did-we-get-here/"
        },
        {
            "Title": "The era of the in-depth brand and gaming creator partnership has arrived",
            "Description": "To reach gamers outside of video games, brands have moved beyond one-off activations based on specific intellectual properties toward more fully integrated programs that span across all aspects of a creator’s community and fandom.",
            "Link": "https://digiday.com/marketing/the-era-of-the-in-depth-creator-partnership-has-arrived/"
        },
        {
            "Title": "Crypto marketers eye a new window of opportunity – but are keeping a lid on media budgets",
            "Description": "Crypto marketing activity ebbed away in recent years. Hotter markets could see it return.",
            "Link": "https://digiday.com/marketing/crypto-marketers-eye-a-new-window-of-opportunity-but-are-keeping-a-lid-on-media-budgets/"
        },
        {
            "Title": "The rise of forums: Why Google prefers them and how to adapt",
            "Description": "Discussion boards are cool again. Find out why Google now prioritizes them and how to foster community and engagement on your niche website.",
            "Link": "https://searchengineland.com/forums-google-adapt-444065"
        },
        {
            "Title": "Ad execs sound the alarm over Google's risky Privacy Sandbox terms",
            "Description": "Google's Privacy Sandbox outage sparks contractual concerns since its terms of service leave users footing the bill even when it doesn't work.",
            "Link": "https://digiday.com/marketing/ad-execs-sound-the-alarm-over-googles-risky-privacy-sandbox-terms/"
        },
        {
            "Title": "Why longer videos are becoming more commonplace on YouTube",
            "Description": "Short-form videos may have surged in popularity over the past several years, but the long-form video format is on the comeback trail.",
            "Link": "https://digiday.com/future-of-tv/why-longer-videos-are-becoming-more-commonplace-on-youtube/"
        },
        {
            "Title": "'Everything is AI now': Amid AI boom, agencies navigate data security, stability and fairness",
            "Description": "AI tools and platforms, whether they're built on generative AI or glorified machine learning, have flooded the marketplace. In response, agencies are wading through them via sandboxes, internal AI task forces and client contracts.",
            "Link": "https://digiday.com/marketing/everything-is-ai-now-amid-ai-boom-agencies-navigate-data-security-stability-and-fairness/"
        },
        {
            "Title": "Media Buying Briefing: Retail media has become a full-funnel play for media agencies",
            "Description": "Holding companies as well as independents have stepped up their resource-building around retail media and the broader catch-all of commerce media — although there’s a lack of standardization around the terminology used in the space.",
            "Link": "https://digiday.com/media-buying/media-buying-briefing-retail-media-has-become-a-full-funnel-play-for-media-agencies/"
        },
        {
            "Title": "Confessions of a DTC investor on the difficulty of dealing with the 'increasingly common' founder-influencer",
            "Description": "In the latest edition of our Confessions series, in which we trade anonymity for candor, we hear from a DTC investor on what it’s like to work with founder-influencers and why it’s a difficult balance to navigate.",
            "Link": "https://digiday.com/marketing/confessions-of-a-dtc-investor-on-the-difficulty-of-dealing-with-the-increasingly-common-founder-influencer/"
        },
        {
            "Title": "Tweet by @jes_scholz",
            "Description": "RT by @aleyda: 🧵 I can't believe I am about to write this but... the Bing index is crucial in the future of SEO. Why? It's not about Bing the search engine. Bing's index now also powers ChatGPT (and thus, soon Apple's Siri), Meta AI, LinkedIn AI and Microsoft Copilot.",
            "Link": "https://twitter.com/jes_scholz/status/1812693442558087653"
        },
        {
            "Title": "Google Says Having Massive Disavow Lists & Removing Them Should Not Worry You",
            "Description": "John Mueller from Google was asked if you should worry that massive link disavow lists can hurt you negatively and also if you remove the list that it might also hurt you.  John said you should not be worried at all, when he was asked how worried should you be, he said \"zero.\"",
            "Link": "https://www.seroundtable.com/massive-google-disavow-lists-37726.html"
        },
        {
            "Title": "Best SEO services in 2024",
            "Description": "Explore the best SEO services to keep your website optimized and generating leads or sales.",
            "Link": "https://www.cnn.com/cnn-underscored/money/best-seo-services"
        },
        {
            "Title": "Thrasio Slims Down in Comeback Attempt",
            "Description": "The Amazon aggregator averaged one acquisition per week during the pandemic. Then it filed for bankruptcy.",
            "Link": "https://www.practicalecommerce.com/thrasio-slims-down-in-comeback-attempt"
        }
    ],
    "reviewed_urls": [
        "https://twitter.com/rustybrick/status/1812627399747477992",
        "https://twitter.com/aleyda/status/1812579657838903794",
        "https://twitter.com/Wimbledon/status/1812516381557936386",
        "https://twitter.com/aleyda/status/1812483106051334321",
        "https://twitter.com/aleyda/status/1812481380762194344",
        "https://twitter.com/aleyda/status/1812468025313939908",
        "https://twitter.com/glenngabe/status/1812459470854783274",
        "https://twitter.com/rustybrick/status/1812457312310771862",
        "https://www.washingtonpost.com/politics/2024/07/14/trump-rally-shooting-timeline/",
        "https://www.finanznachrichten.de/nachrichten-2024-07/62724253-doctor-marketing-md-seo-for-cosmetic-surgeons-boost-your-practice-s-online-presence-200.htm",
        "https://twitter.com/BarackObama/status/1812271849893442018",
        "https://twitter.com/aleyda/status/1812271808902791600",
        "https://twitter.com/robkhenderson/status/1812205298213626320",
        "https://twitter.com/aleyda/status/1812184363926208574",
        "https://twitter.com/aleyda/status/1812169387828228564",
        "https://twitter.com/aleyda/status/1812121187926810874",
        "https://twitter.com/glenngabe/status/1812119592371630503",
        "https://twitter.com/glenngabe/status/1812108902005342256",
        "https://twitter.com/glenngabe/status/1812106752978022572",
        "https://twitter.com/glenngabe/status/1812104709068501475",
        "https://twitter.com/aleyda/status/1812088266868285675",
        "https://screenanarchy.com/2024/07/locarno-2024-preview-hong-sang-soo-radu-jude-wang-bing-and-bertrand-mandico-to-reveal-new-works.html",
        "https://twitter.com/aleyda/status/1811844125714485665",
        "https://twitter.com/rustybrick/status/1811838185262944705",
        "https://twitter.com/rustybrick/status/1811834409965822391",
        "https://twitter.com/rustybrick/status/1811830635197251812",
        "https://twitter.com/rustybrick/status/1811826860289880319",
        "https://twitter.com/rustybrick/status/1811823085580124191",
        "https://twitter.com/rustybrick/status/1811819310593245587",
        "https://twitter.com/glenngabe/status/1811816637907275984",
        "https://twitter.com/aleyda/status/1811816598908600665",
        "https://twitter.com/rustybrick/status/1811815535576838569",
        "https://twitter.com/aleyda/status/1811813440773652934",
        "https://twitter.com/searchliaison/status/1811810529444528544",
        "https://twitter.com/aleyda/status/1811809575512768821",
        "https://twitter.com/glenngabe/status/1811797065946616018",
        "https://twitter.com/glenngabe/status/1811795595255861718",
        "https://www.searchenginejournal.com/webinar-lp-cracking-open-the-local-seo-bucket-5-finger-lickin-strategies-for-2024/",
        "https://twitter.com/aleyda/status/1811785349657436511",
        "https://twitter.com/rustybrick/status/1811777788015251745",
        "https://twitter.com/rustybrick/status/1811774012034515062",
        "https://twitter.com/glenngabe/status/1811772822944952515",
        "https://twitter.com/rustybrick/status/1811770237240664229",
        "https://twitter.com/rustybrick/status/1811766462253518867",
        "https://twitter.com/rustybrick/status/1811762687711592494",
        "https://twitter.com/rustybrick/status/1811758912552464433",
        "https://twitter.com/rustybrick/status/1811755138006286607",
        "https://twitter.com/glenngabe/status/1811754908829335700",
        "https://twitter.com/lilyraynyc/status/1811754849547010350",
        "https://www.practicalecommerce.com/ugly-ads-perform-best-marketer-says",
        "https://www.elyecho.com/article/1594,trout-whisperer-bing-spa-loosh",
        "https://twitter.com/glenngabe/status/1811741087532482999",
        "https://twitter.com/glenngabe/status/1811739247826629105",
        "https://twitter.com/rustybrick/status/1811737413384839189",
        "https://twitter.com/glenngabe/status/1811736245120180499",
        "https://twitter.com/glenngabe/status/1811734656263369055",
        "https://www.seroundtable.com/video-07-12-2024-37721.html",
        "https://twitter.com/rustybrick/status/1811732387790762314",
        "https://www.uema.br/2024/07/uema-homenageia-primeiros-egressos-do-curso-de-agronomia-durante-solenidade/",
        "https://twitter.com/glenngabe/status/1811730885831475428",
        "https://twitter.com/rustybrick/status/1811729972022903133",
        "https://twitter.com/glenngabe/status/1811729962665132531",
        "https://twitter.com/rustybrick/status/1811727455188812280",
        "https://twitter.com/rustybrick/status/1811724938836897963",
        "https://twitter.com/rustybrick/status/1811722422124708129",
        "https://www.seroundtable.com/bing-search-testing-voting-feature-37719.html",
        "https://twitter.com/rustybrick/status/1811721638087467423",
        "https://twitter.com/rustybrick/status/1811719905563005206",
        "https://twitter.com/rustybrick/status/1811717137201004904",
        "https://www.searchenginejournal.com/best-digital-marketing-courses-free-paid/516639/",
        "https://twitter.com/rustybrick/status/1811699463733346435",
        "https://campaignme.com/alternative-digital-agency-expands-expertise-in-innovation-and-seo/",
        "https://digiday.com/media/ai-briefing-senators-propose-new-regulations-for-privacy-transparency-and-copyright-protections/",
        "https://digiday.com/marketing/sifting-through-the-noise-ai-tools-for-hr-are-evolving-fast-heres-how-to-catch-up/",
        "https://digiday.com/marketing/companies-seem-determined-to-make-everything-a-retail-media-network-how-did-we-get-here/",
        "https://digiday.com/marketing/the-era-of-the-in-depth-creator-partnership-has-arrived/",
        "https://digiday.com/marketing/crypto-marketers-eye-a-new-window-of-opportunity-but-are-keeping-a-lid-on-media-budgets/",
        "https://www.hometownstation.com/featured-stories/top-10-best-seo-companies-to-boost-your-online-presence-in-2024-514194",
        "https://searchengineland.com/forums-google-adapt-444065",
        "https://twitter.com/aleyda/status/1812753095102771216",
        "https://digiday.com/marketing/ad-execs-sound-the-alarm-over-googles-risky-privacy-sandbox-terms/",
        "https://digiday.com/future-of-tv/why-longer-videos-are-becoming-more-commonplace-on-youtube/",
        "https://digiday.com/marketing/everything-is-ai-now-amid-ai-boom-agencies-navigate-data-security-stability-and-fairness/",
        "https://digiday.com/media-buying/media-buying-briefing-retail-media-has-become-a-full-funnel-play-for-media-agencies/",
        "https://digiday.com/marketing/confessions-of-a-dtc-investor-on-the-difficulty-of-dealing-with-the-increasingly-common-founder-influencer/",
        "https://twitter.com/jes_scholz/status/1812693442558087653",
        "https://twitter.com/glenngabe/status/1812816972175786001",
        "https://twitter.com/rustybrick/status/1812807068962652608",
        "https://www.seroundtable.com/massive-google-disavow-lists-37726.html",
        "https://twitter.com/rustybrick/status/1812805559487442994",
        "https://twitter.com/rustybrick/status/1812804312118309109",
        "https://twitter.com/rustybrick/status/1812798306038288565",
        "https://twitter.com/rustybrick/status/1812794936569311397",
        "https://www.cnn.com/cnn-underscored/money/best-seo-services",
        "https://www.practicalecommerce.com/thrasio-slims-down-in-comeback-attempt",
        "https://twitter.com/sitebulb/status/1812753793781522861",
        "https://www.ahmedabadmirror.com/digital-pr-world-offering-guarantee-seo-ranking-services/81871660.html"
    ]
}