{
    "valid_articles": [
        {
            "Title": "Google testing blue visit button for search result snippets",
            "Description": "Google is testing a blue \"visit\" button for search result snippets.",
            "Link": "https://twitter.com/rustybrick/status/1794098954239365199"
        },
        {
            "Title": "Google Search update: Airlines, hotels and retailers fear SEO algorithm changes",
            "Description": "Companies fear direct sales drop from Google's changes",
            "Link": "https://gulfnews.com/business/retail/google-search-update-airlines-hotels-and-retailers-fear-seo-algorithm-changes-1.1716576326350"
        },
        {
            "Title": "Google's site reputation abuse policy is still only being enforced using manual actions",
            "Description": "Google's site reputation abuse policy is still only being enforced using manual actions",
            "Link": "https://twitter.com/rustybrick/status/1794077404539023538"
        },
        {
            "Title": "Google Search can now index Electronic Publication (.epub)",
            "Description": "Google Search can now index Electronic Publication (.epub)",
            "Link": "https://twitter.com/rustybrick/status/1794073629694783505"
        },
        {
            "Title": "Follow @Goog_Enough to find embarrassing, funny and sometimes harmful Google AI Overviews",
            "Description": "Follow @Goog_Enough to find embarrassing, funny and sometimes harmful Google AI Overviews",
            "Link": "https://twitter.com/rustybrick/status/1794069854804406306"
        },
        {
            "Title": "GA4 adds real-time users in last 5 minutes",
            "Description": "GA4 adds real-time users in last 5 minutes",
            "Link": "https://twitter.com/rustybrick/status/1794066080018661793"
        },
        {
            "Title": "Bing now fully fixed?",
            "Description": "Bing now fully fixed?",
            "Link": "https://twitter.com/rustybrick/status/1794059907953508464"
        },
        {
            "Title": "\"Increase social media usage\" and \"Use AI to suggest content\" among the steps provided by Google AI Overview for \"how to recover from the hcu\"",
            "Description": "\"Increase social media usage\" and \"Use AI to suggest content\" among the steps provided by Google AI Overview for \"how to recover from the hcu\" 👀 #badaioverviews",
            "Link": "https://twitter.com/aleyda/status/1794051825907192179"
        },
        {
            "Title": "Google AI Overviews under fire for dangerous and wrong answers",
            "Description": "RT by @rustybrick: Google AI Overviews under fire for dangerous and wrong answers via @MrDannyGoodwin searchengineland.com/google-ai-over…",
            "Link": "https://twitter.com/sengineland/status/1794029758453305689"
        },
        {
            "Title": "SEO Video Recap: Google ranking volatility, ads in AI Overviews, more Google Ads news, Sundar Pichai interview, heartfelt helpful content, and Reddit, plus more",
            "Description": "SEO Video Recap: Google ranking volatility, ads in AI Overviews, more Google Ads news, Sundar Pichai interview, heartfelt helpful content, and Reddit, plus more youtube.com/watch?v=d_MVVR…",
            "Link": "https://twitter.com/rustybrick/status/1794020782605222241"
        },
        {
            "Title": "The brand’s guide to full-funnel creator strategies: Tactics and insights for creator partnerships, engagement and ROI",
            "Description": "This Tactics + Insights guide, sponsored by creator marketing platform Collective Voice, examines how brands work with creators to reach and engage audiences across multiple touchpoints and channels. As the sales funnel has evolved to be non-linear, creators are essential for brands to reach consumers throughout all customer journey stages.",
            "Link": "https://digiday.com/sponsored/the-brands-guide-to-full-funnel-creator-strategies/"
        },
        {
            "Title": "Flair Remakes Product Photography",
            "Description": "The 2022 startup deploys AI models to provide virtual scenes and settings for existing photos.",
            "Link": "https://www.practicalecommerce.com/flair-remakes-product-photography"
        },
        {
            "Title": "Mainstream media on bad Google AI Overviews",
            "Description": "Mainstream media on bad Google AI Overviews bbc.com/news/articles/… and arstechnica.com/information-te… and axios.com/2024/05/24/goo…",
            "Link": "https://twitter.com/rustybrick/status/1793990307601912031"
        },
        {
            "Title": "And when will Spotify extend DJ X to be a true AI assistant? I'm sure they are working on that :) -&gt; Google Gemini's YouTube Music extension is finally live \"Once enabled, you can ask Gemini on your phone to “Play [song]” or “Play [artist],” and it will start playing the…",
            "Description": "And when will Spotify extend DJ X to be a true AI assistant? I'm sure they are working on that :) -&gt; Google Gemini's YouTube Music extension is finally live \"Once enabled, you can ask Gemini on your phone to “Play [song]” or “Play [artist],” and it will start playing the…",
            "Link": "https://twitter.com/glenngabe/status/1793983411704467691"
        },
        {
            "Title": "Did Google fire Peter The Greeter? His Instagram channel is gone :(",
            "Description": "Speculation about the disappearance of Google's \"Peter The Greeter\" Instagram channel.",
            "Link": "https://twitter.com/rustybrick/status/1793981034754969781"
        },
        {
            "Title": "Really hard to believe the team working on AI Overviews didn't find a number of these issues during testing...",
            "Description": "Discussion about issues with Google's AI Overviews feature, particularly for YMYL queries.",
            "Link": "https://twitter.com/glenngabe/status/1793977650681172346"
        },
        {
            "Title": "SEO Video Recap covering Google ranking volatility, ads in AI Overviews, more Google Ads news, Sundar Pichai interview, heartfelt helpful content, and Reddit, plus more",
            "Description": "Recap of recent SEO news, including Google ranking volatility, ads in AI Overviews, Google Ads updates, and more.",
            "Link": "https://twitter.com/rustybrick/status/1793975505458286638"
        },
        {
            "Title": "How important are backlinks for SEO in 2024?",
            "Description": "Discussion on the continued importance of backlinks for SEO in 2024.",
            "Link": "https://searchengineland.com/backlinks-seo-importance-442529"
        },
        {
            "Title": "From Danny: \"We're only doing manual actions right now. The algorithmic component will indeed come, as we've said, but that's not live yet.\"",
            "Description": "Update on Google's site reputation abuse policy, stating that it is currently being enforced manually, with algorithmic enforcement to come later.",
            "Link": "https://twitter.com/glenngabe/status/1793974185305247818"
        },
        {
            "Title": "Google's site reputation abuse policy is not being enforced using algorithmic means yet, still only manual actions",
            "Description": "Confirmation that Google's site reputation abuse policy is currently being enforced manually.",
            "Link": "https://twitter.com/rustybrick/status/1793972966432420330"
        },
        {
            "Title": "Meta AI Agents, including \"monetization agents\"",
            "Description": "News about Meta's development of AI agents, including potential monetization strategies.",
            "Link": "https://twitter.com/glenngabe/status/1793972601968038084"
        },
        {
            "Title": "Google Search can now index epub files",
            "Description": "Announcement that Google Search can now index .epub files.",
            "Link": "https://twitter.com/rustybrick/status/1793970449874903278"
        },
        {
            "Title": "Google Search Can Now Index Electronic Publication (.epub)",
            "Description": "Detailed information about Google Search's ability to index .epub files.",
            "Link": "https://www.seroundtable.com/google-search-index-electronic-publication-epub-37446.html"
        },
        {
            "Title": "How to find embarrassing, funny and sometimes harmful Google AI Overviews - follow @Goog_Enough",
            "Description": "Guide on finding examples of Google AI Overviews that are inaccurate or misleading.",
            "Link": "https://twitter.com/rustybrick/status/1793967933137285237"
        },
        {
            "Title": "Google Analytics now shows real-time users in last 5 minutes (and keeps last 30 minutes too) - reminds me of UA3 real-time metrics",
            "Description": "Update on Google Analytics' real-time user data display, now showing users from the last 5 minutes.",
            "Link": "https://twitter.com/rustybrick/status/1793965416563261861"
        },
        {
            "Title": "Microsoft outage takes down Bing, ChatGPT and DuckGoGo",
            "Description": "Report on a major Microsoft outage that affected Bing, ChatGPT, and other services.",
            "Link": "https://dataconomy.com/2024/05/24/microsoft-outage-bing-chatgpt-duckgogo/"
        },
        {
            "Title": "Google to roll out new Google Profiles that let you manage your reviews and notes, plus in a month let other users see them publicly",
            "Description": "Announcement of upcoming changes to Google Profiles, allowing users to manage reviews and notes, with public visibility coming soon.",
            "Link": "https://twitter.com/rustybrick/status/1793962900245344609"
        },
        {
            "Title": "Google's @JohnMu said the Google Search Console team is investigating the weird product snippets search performance report surge, it is likely a bug and unrelated to AI Overviews he said - story updated at",
            "Description": "Update on the Google Search Console product snippets search performance report surge, with John Mueller suggesting it is likely a bug.",
            "Link": "https://twitter.com/rustybrick/status/1793944963279110561"
        },
        {
            "Title": "Massive outage disrupts Microsoft services, Bing, and AI tools globally",
            "Description": "Report on a widespread Microsoft outage affecting Bing, AI tools, and other services.",
            "Link": "https://www.globalvillagespace.com/massive-outage-disrupts-microsoft-services-bing-and-ai-tools-globally/"
        },
        {
            "Title": "\"Add at least 5 internal links per page\" to rank better on Google? WTH AI Overview 😅",
            "Description": "Criticism of potentially misleading advice provided by Google's AI Overview feature regarding internal links.",
            "Link": "https://twitter.com/aleyda/status/1793935315318538445"
        },
        {
            "Title": "Microsoft outage disrupts search engines, AI tools",
            "Description": "News about a Microsoft outage impacting search engines and AI tools.",
            "Link": "https://www.computing.co.uk/news/4214199/microsoft-outage-disrupts-search-engines-ai-tools"
        },
        {
            "Title": "RT by @aleyda: Google's new AI overview feature is a disaster. AI is awesome. Tacking on AI to a product that hundreds of millions use without it working is not. 13 hilarious examples:",
            "Description": "Retweet highlighting criticism of Google's AI Overview feature and its perceived shortcomings.",
            "Link": "https://twitter.com/NathanLands/status/1793925296967782434"
        },
        {
            "Title": "Microsoft weirdly renames \"Explain with Copilot\" feature on Notepad to \"Define with Bing\"",
            "Description": "Report on Microsoft's renaming of the \"Explain with Copilot\" feature in Notepad to \"Define with Bing.\"",
            "Link": "https://mspoweruser.com/microsoft-weirdly-renames-explain-with-copilot-feature-on-notepad-to-define-with-bing/"
        },
        {
            "Title": "Microsoft outage affects Bing, Copilot, ChatGPT other services globally",
            "Description": "News about a global Microsoft outage affecting Bing, Copilot, ChatGPT, and other services.",
            "Link": "https://www.sentinelassam.com/more-news/science-and-technology/microsoft-outage-affects-bing-copilot-chatgpt-other-services-globally"
        },
        {
            "Title": "How Snapchat, Meta, Pinterest and Google are eyeing up TikTok ad dollars",
            "Description": "Analysis of how Snapchat, Meta, Pinterest, and Google are competing for advertising revenue with TikTok.",
            "Link": "https://digiday.com/marketing/how-snapchat-meta-pinterest-and-google-are-eyeing-up-tiktok-ad-dollars/"
        },
        {
            "Title": "Inside The New York Times' plans to correlate attention levels to other metrics",
            "Description": "Insights into The New York Times' strategy for measuring and leveraging attention metrics in advertising.",
            "Link": "https://digiday.com/media/inside-the-new-york-times-plans-to-correlate-attention-levels-to-other-metrics/"
        },
        {
            "Title": "Why publishers are preparing to federate their sites",
            "Description": "Exploration of the reasons why publishers are considering federating their websites, using The Verge and 404 Media as examples.",
            "Link": "https://digiday.com/media/why-publishers-are-preparing-to-federate-their-sites/"
        },
        {
            "Title": "Why publishers fear traffic, ad declines from Google's AI-generated search results",
            "Description": "Discussion of concerns among publishers about potential traffic and ad revenue declines due to Google's AI-generated search results.",
            "Link": "https://digiday.com/media/why-publishers-fear-traffic-ad-declines-from-googles-ai-generated-search-results/"
        },
        {
            "Title": "Google: You know what’s worst than being left behind? Launching something on a rush overlooking feedback that told you it wasn’t good just to get backlash from users and more negative coverage by the media: “Google's AI search is telling car drivers to consider changing their…",
            "Description": "Criticism of Google's handling of the AI Overview feature launch, suggesting a rushed release despite negative feedback.",
            "Link": "https://twitter.com/aleyda/status/1793852400479920479"
        },
        {
            "Title": "AI Overviews: Measuring the Impact on SEO",
            "Description": "Analysis of the impact of Google's AI Overviews on SEO, including data on presence across industries and query types.",
            "Link": "https://twitter.com/aleyda/status/1793849699037839516"
        },
        {
            "Title": "Bing and Copilot were down, affecting search services worldwide, now restored",
            "Description": "Microsoft Bing Search, Copilot, and associated services, including DuckDuckGo, experienced a significant outage.",
            "Link": "https://thetechportal.com/2024/05/24/bing-and-copilot-were-down-affecting-search-services-worldwide-now-restored/"
        },
        {
            "Title": "ChatGPT, Copilot, Bing, DuckDuckGo, and others down due to a major Microsoft outage",
            "Description": "The news blog specialized in Japanese culture, odd news, gadgets and all other funny stuffs. Updated everyday.",
            "Link": "http://gigazine.net/gsc_news/en/20240524-microsoft-outage-affects-chatgpt/"
        },
        {
            "Title": "There was a glitch in the Bing API that caused Microsoft's web search features Copilot, DuckDuckGo and ChatGPT to stop working",
            "Description": "Yesterday, 23 May, there were glitches in the work of Microsoft's search engine Bing. At ...",
            "Link": "https://gagadget.com/en/462799-there-was-a-glitch-in-the-bing-api-that-caused-microsofts-web-search-features-copilot-duckduckgo-and-chatgpt-to-stop-working/"
        },
        {
            "Title": "Google Confirms: No Algorithmic Actions For Site Reputation Abuse Yet",
            "Description": "Google confirms algorithmic actions for site reputation abuse are not live, and will only impact specific content.",
            "Link": "https://www.searchenginejournal.com/google-confirms-no-algorithmic-actions-for-site-reputation-abuse-yet/517337/"
        },
        {
            "Title": "Bing outage shows just how little competition Google search really has",
            "Description": "Opinion: Actively searching without Google or Bing is harder than it looks.",
            "Link": "https://arstechnica.com/gadgets/2024/05/bing-outage-shows-just-how-little-competition-google-search-really-has/"
        },
        {
            "Title": "Windows chief Pavan Davuluri responds to a long-running complaint about Bing",
            "Description": "Given Microsoft's history, can we believe Pavan Davuluri when he says he hears our complaints about Bing ads in Windows?",
            "Link": "https://www.laptopmag.com/software/browsers-search-engines/windows-chief-responds-to-a-long-running-complaint-i-hear-you-on-it"
        },
        {
            "Title": "Microsoft Copilot is \"continuing to recover\" from an extended Bing outage",
            "Description": "Microsoft says its Copilot generative AI assistant is \"continuing to recover\" after an outage occurred in its Bing search engine API earlier this morning. Bing is still out for some users.",
            "Link": "https://www.neowin.net/news/microsoft-copilot-is-continuing-to-recover-from-an-extended-bing-outage/"
        },
        {
            "Title": "Bing and DuckDuckGo offline overnight, Google says thanks for the data",
            "Description": "Google remained online during the Bing and DuckDuckGo outages, giving it hours of search data from frustrated users of its competitors.",
            "Link": "https://protos.com/bing-and-duckduckgo-offline-overnight-google-says-thanks-for-the-data/"
        },
        {
            "Title": "New for 2024! Compare 16 top SEO platforms",
            "Description": "Whether you're looking to revamp your SEO strategy, upgrade your toolkit, or stay ahead of industry shifts, this guide has you covered.",
            "Link": "https://searchengineland.com/new-for-2024-compare-16-top-seo-platforms-442523"
        },
        {
            "Title": "Microsoft's ChatGPT, Copilot, Bing facing THESE major glitches",
            "Description": "Bill Gates-founded tech giant Microsoft reportedly suffered a massive blackout of its services that impacted its search engine Bing and artificial intelligence  powered chatbot services and Copilot, reported ZDnet.Users of Microsoft...",
            "Link": "https://www.geo.tv/latest/545591-microsofts-chatgpt-copilot-bing-facing-these-major-glitches"
        },
        {
            "Title": "Bing’s API was down, taking Microsoft Copilot, DuckDuckGo and ChatGPT's web search feature down too",
            "Description": "Bing, Microsoft’s search engine, was working improperly for several hours on Thursday in Europe.  At first, we noticed it wasn’t possible to perform a web search at all.  Now it seems search results are loading properly.",
            "Link": "https://techcrunch.com/2024/05/23/bing-is-down-bringing-duckduckgo-and-ecosia-down-too/"
        },
        {
            "Title": "EU Threatens Microsoft with $2 Billion Fine Over Bing AI Data Request",
            "Description": "Microsoft faces a potential fine of up to 1% of its annual revenue from the European Union if it fails to respond to a request for information by May 27. This demand relates to concerns under the EU’s Digital Services Act about the Bing search engine and its generative artificial intelligence (AI) services. On May 17, the European Commission announced on X that it seeks details from Microsoft regarding “generative AI risks on Bing.” The Commission noted, “Bing may pose risks linked to generative AI, such as so-called ‘hallucinations’, deepfakes, as well as the automated manipulation of services that can",
            "Link": "https://cryptodaily.co.uk/news-in-crypto/crypto-intelligence:eu-threatens-microsoft-with-2-billion-fine-over-bing-ai-data-request"
        },
        {
            "Title": "Microsoft Bing Outage Takes Down Copilot and ChatGPT Web Searches",
            "Description": "A Microsoft Bing platform outage knocked web searches offline for hours at some of the largest generative AI services, including the company's own Copilot and ChatGPT Plus.",
            "Link": "https://www.techopedia.com/news/microsoft-bing-outage-takes-down-copilot-and-chatgpt-web-searches"
        },
        {
            "Title": "Global outages hit Microsoft Bing, DuckDuckGo, ChatGPT Search and Copilot ",
            "Description": "Global outages hit Microsoft Bing, DuckDuckGo, ChatGPT Search and Copilot - SiliconANGLE",
            "Link": "https://siliconangle.com/2024/05/23/global-outages-hit-microsoft-bing-duckduckgo-chatgpt-search-copilot/"
        },
        {
            "Title": "Google's robots.txt parser was updated on GitHub",
            "Description": "Google's robots.txt parser was updated on GitHub seroundtable.com/google-updates…",
            "Link": "https://twitter.com/rustybrick/status/1793654618758738261"
        },
        {
            "Title": "Google Ads referral program",
            "Description": "Google Ads referral program seroundtable.com/google-ads-ref…",
            "Link": "https://twitter.com/rustybrick/status/1793650843977458077"
        },
        {
            "Title": "Microsoft outage affects Bing, Copilot, DuckDuckGo, and ChatGPT",
            "Description": "The company is aware of the issue and working to fix it.",
            "Link": "https://mashable.com/article/microsoft-outage-affects-bing-copilot-duckduckgo-chatgpt"
        },
        {
            "Title": "Microsoft Bing API outage disrupts search engines worldwide, sparks social media frenzy",
            "Description": "A significant outage in Microsoft's Bing API caused widespread disruptions across search platforms, affecting services dependent on the API. While Bing search engine is now functioning normally, other search engines like DuckDuckGo and Ecosia are still impacted.",
            "Link": "https://www.livemint.com/technology/tech-news/microsoft-bing-api-outage-disrupts-search-engines-worldwide-sparks-social-media-frenzy-11716472503091.html"
        },
        {
            "Title": "Google Search related searches replacing people also search for?",
            "Description": "Google Search related searches replacing people also search for? seroundtable.com/google-replaci…",
            "Link": "https://twitter.com/rustybrick/status/1793647068935754201"
        },
        {
            "Title": "It's New - May 23 - Bing Search Goes Down, Reddit Gets Google Treatment & More with @gregfinn - we left out @CrystalontheWeb and @MordyOberstein from this recording",
            "Description": "It's New - May 23 - Bing Search Goes Down, Reddit Gets Google Treatment & More with @gregfinn - we left out @CrystalontheWeb and @MordyOberstein from this recording youtube.com/watch?v=o7ro3r…",
            "Link": "https://twitter.com/rustybrick/status/1793644641121939862"
        },
        {
            "Title": "Microsoft suffering from outage — Bing, Copilot, and DuckDuckGo inaccessible for several hours",
            "Description": "Microsoft's search services have been offline for at least four hours across the globe.",
            "Link": "https://www.tomshardware.com/software/search-engines/microsoft-suffering-from-outage-bing-copilot-and-duckduckgo-inaccessible-for-several-hours"
        },
        {
            "Title": "Google Search tests \"from sources across the web\" without image thumbnails",
            "Description": "Google Search tests \"from sources across the web\" without image thumbnails seroundtable.com/google-sources…",
            "Link": "https://twitter.com/rustybrick/status/1793643294326734904"
        },
        {
            "Title": "Driving traffic but not leads? How to win with SEO and CRO",
            "Description": "Combining SEO and CRO forms a harmonious union. Explore these helpful tools and tips if you’re struggling to convert traffic.",
            "Link": "https://searchengineland.com/driving-traffic-not-leads-seo-cro-440747"
        },
        {
            "Title": "Google tests special Reddit search result snippets",
            "Description": "Google tests special Reddit search result snippets seroundtable.com/google-special…",
            "Link": "https://twitter.com/rustybrick/status/1793639519205359894"
        },
        {
            "Title": "PPCers at Google Marketing Live",
            "Description": "PPCers at Google Marketing Live seroundtable.com/photos/ppc-com…",
            "Link": "https://twitter.com/rustybrick/status/1793635744499835346"
        },
        {
            "Title": "A massive Microsoft outage is impacting Bing, Copilot, ChatGPT, and DuckDuckGo",
            "Description": "The rest of ChatGPT stills works, but its internet search functionality is affected.",
            "Link": "https://www.zdnet.com/article/a-massive-microsoft-outage-is-impacting-bing-copilot-chatgpt-and-duckduckgo/"
        },
        {
            "Title": "Microsoft's Search Engine Bing Down for Hours; Services Relying on Bing API Still Not Working",
            "Description": "Several search engines and programs relying on Bing's API, including DuckDuckGo, Ecosia, Microsoft Copilot, and ChatGPT Plus, are facing outages due to a Bing API issue.",
            "Link": "https://www.techtimes.com/articles/304925/20240523/microsoft-search-engine-bing-down-hours-services-relying-api-still.htm"
        },
        {
            "Title": "Microsoft's Bing service is down for many and it's affecting Copilot and DuckDuckGo as well",
            "Description": "A problem with Microsoft's Bing API has caused many not to be able to use the search engine for a number of hours this morning. It's also affected Copilot and third-party services like DuckDuckGo.",
            "Link": "https://www.neowin.net/news/microsofts-bing-service-is-down-for-many-and-its-affecting-copilot-and-duckduckgo-as-well/"
        },
        {
            "Title": "It's not just you: Bing, DuckDuckGo are currently down",
            "Description": "It's not a good day if you prefer alternatives to Google Search.",
            "Link": "https://www.androidauthority.com/bing-duckduckgo-down-3445742/"
        },
        {
            "Title": "Major Bing outage disrupts services on ChatGPT Search, Copilot, DuckDuckGo and others",
            "Description": "The issues started around 3 AM ET (8 AM WAT)  and seem to be linked to Bing’s API and any service that depends on it.",
            "Link": "https://www.techloy.com/major-bing-outage-disrupts-services-on-chatgpt-search-copilot-duckduckgo-and-others/"
        },
        {
            "Title": "Microsoft Outage Takes Down Bing, Copilot, DuckDuckGo, ChatGPT Search",
            "Description": "A Microsoft outage has taken down several key online services, including Bing.com, Copilot for web and mobile, Copilot in Windows, ChatGPT internet search, and DuckDuckGo.",
            "Link": "https://www.mactrast.com/2024/05/microsoft-outage-takes-down-bing-copilot-duckduckgo-chatgpt-search/"
        },
        {
            "Title": "Is Microsoft Bing down today (May 23)? DuckDuckGo, Copilot, and Ecosia not working explored",
            "Description": "Microsoft Bing is now partially back after a long outage this afternoon. The search engine took down Copilot, DuckDuckgo, and Ecosia, all of which are interdependent in one way or another.",
            "Link": "https://www.sportskeeda.com/gaming-tech/news-is-microsoft-bing-today-may-23-duckduckgo-copilot-ecosia-working-explored"
        },
        {
            "Title": "Microsoft Services Outage: Bing, Copilot And ChatGPT Web Search Affected Globally",
            "Description": "Microsoft Bing outage is causing disruptions to search capabilities for ChatGPT, Copilot, DuckDuckGo, and other platforms.",
            "Link": "https://zeenews.india.com/technology/microsoft-services-outage-bing-copilot-and-chatgpt-web-search-affected-globally-2751839.html"
        },
        {
            "Title": "DuckDuckGo down: What happened and when search engine could be back",
            "Description": "Users have been facing issues with the website since this morning",
            "Link": "https://inews.co.uk/news/bing-chatgpt-duckduckgo-down-3070942"
        },
        {
            "Title": "Google updates its robots.txt parser on GitHub",
            "Description": "Google's John Mueller released an update to the open-source version of Google's robots.txt parser on GitHub.",
            "Link": "https://twitter.com/rustybrick/status/1793610578386206983"
        },
        {
            "Title": "Microsoft is \"transitioning requests to alternate service components to expedite service recovery\" for Bing and other services",
            "Description": "Microsoft is \"transitioning requests to alternate service components to expedite service recovery\" for Bing and other services.",
            "Link": "https://twitter.com/rustybrick/status/1793607874473808033"
        },
        {
            "Title": "Microsoft outage takes down Bing, DuckDuckGo and ChatGPT",
            "Description": "It's across the UK.",
            "Link": "https://metro.co.uk/2024/05/23/microsoft-outage-takes-bing-duckduckgo-chatgpt-20895946/"
        },
        {
            "Title": "Massive Microsoft Outage Affect Bing, Copilot and Other Services Globally",
            "Description": "A massive outage on Thursday affected several Microsoft services such as Bing Search, Copilot, ChatGPT and more globally, including India. Users turned to social media to report the outage, which also impacted third-party services such as search engine DuckDuckGo which relies on Microsoft’s infrastructure.",
            "Link": "https://www.latestly.com/quickly/technology/massive-microsoft-outage-affect-bing-copilot-and-other-services-globally-5985125.html"
        },
        {
            "Title": "Microsoft Outage: Massive Interruption Affect Services Like Bing Search, Copilot, ChatGPT and More Globally, Including India; Check Details",
            "Description": "A massive outage on Thursday affected several Microsoft services such as Bing Search, Copilot, ChatGPT and more globally, including India. Users turned to social media to report the outage, which also impacted third-party services such as search engine DuckDuckGo which relies on Microsoft’s infrastructure.",
            "Link": "https://www.latestly.com/technology/microsoft-outage-massive-interruption-affect-services-like-bing-search-copilot-chatgpt-and-more-globally-including-india-check-details-5985125.html"
        },
        {
            "Title": "Google testing replacing related searches with people also search for",
            "Description": "Google is testing replacing \"related searches\" with \"people also search for\".",
            "Link": "https://twitter.com/rustybrick/status/1793605545263239238"
        },
        {
            "Title": "Microsoft outage affects Bing, Copilot, other services globally",
            "Description": "New Delhi, May 23 (IANS) A massive outage on Thursday affected several Microsoft services such as Bing Search, Copilot, ChatGPT and more globally, including India. Users […]",
            "Link": "https://www.sarkaritel.com/microsoft-outage-affects-bing-copilot-other-services-globally/"
        },
        {
            "Title": "Microsoft Bing API Outage Affects Search Engines and AI Tools",
            "Description": "Earlier today, a major outage originating from the Microsoft Bing application programming interface (API) caused widespread disruption…",
            "Link": "https://techeconomy.ng/microsoft-bing-api-outage-affects-search-engines-and-ai-tools/"
        },
        {
            "Title": "Copilot, Bing, and other Microsoft services are down and ChatGPT can't search the web",
            "Description": "Outages to Copilot and Bing started spiking this morning, but they will likely be back up and running soon.",
            "Link": "https://www.windowscentral.com/software-apps/copilot-bing-and-other-microsoft-services-are-down-and-chatgpt-cant-search-the-web"
        },
        {
            "Title": "Microsoft services down globally; outage affects Bing, Copilot, more: Here's how users reacted",
            "Description": "Microsoft suffered a widespread global outage today. Due to the outage, various Microsoft services including Bing Search, Copilot, and ChatGPT were down. Here’s how users reacted on social media.",
            "Link": "https://www.indiatvnews.com/technology/news/microsoft-services-down-globally-outage-affects-bing-copilot-more-here-s-how-users-reacted-2024-05-23-932992"
        },
        {
            "Title": "Bing API glitch breaks Copilot, ChatGPT, and DuckDuckGo search functions",
            "Description": "Currently, the search capabilities of ChatGPT, Copilot, DuckDuckGo, and other platforms are partially unavailable due to a Microsoft outage, which is",
            "Link": "https://itc.ua/en/news/bing-api-glitch-breaks-copilot-chatgpt-and-duckduckgo-search-functions/"
        },
        {
            "Title": "Bing, DuckDuckGo, ChatGPT Search, Copilot Hit With Outage",
            "Description": "Bing's API experiences an outage. Other tools like DuckDuckGo, Bing, ChatGPT Search, and Microsoft's Copilot AI tool are also impacted.",
            "Link": "https://www.pcmag.com/news/bing-duckduckgo-chatgpt-search-copilot-hit-with-outage"
        },
        {
            "Title": "Bing and Copilot fall from the clouds",
            "Description": "Alternatively, true AGI has been reached, and the machines decided to delete themselves",
            "Link": "https://www.theregister.com/2024/05/23/bing_and_copilot_fall_from/"
        },
        {
            "Title": "Microsoft Bing, Copilot stop working for several users",
            "Description": "Microsoft's websites, including those for Bing and Copilot, are down for users across the globe.",
            "Link": "https://www.indiatoday.in/technology/news/story/microsoft-bing-copilot-stops-working-for-several-users-2542931-2024-05-23"
        },
        {
            "Title": "Bing down for many; Copilot, DuckDuckGo, ChatGPT search also",
            "Description": "Microsoft’s search engine Bing is down for many, with Copilot similarly unavailable for affected users. DuckDuckGo and ChatGPT search are...",
            "Link": "https://9to5mac.com/2024/05/23/bing-down/"
        },
        {
            "Title": "Microsoft Outage: Bing Search And Copilot Down, Users Unable To Access",
            "Description": "Microsoft Bing Search and Copilot, the GPT-4 AI chatbot, are experiencing downtime, Microsoft reacted to the outage. Know details. , Technology & Science News - Times Now",
            "Link": "https://www.timesnownews.com/technology-science/microsoft-outage-bing-search-and-copilot-down-users-unable-to-access-article-110364335"
        },
        {
            "Title": "AI vs. Human Content: A Benchmark and Case Study by @Terakeet",
            "Description": "\"AI is not the end-all solution to creating content that authentically connects with human audiences. It’s not a method for search visibility or shareability, either. But AI can be an efficient and capable tool…",
            "Link": "https://twitter.com/aleyda/status/1793567474367029712"
        },
        {
            "Title": "Nice update to @semrush keyword magic tool!",
            "Description": "It gives you a personalized keyword difficulty metric if you add your domain, taking into account your current rankings for the terms. Much more useful than the generic KD!",
            "Link": "https://twitter.com/aleyda/status/1793557776087871534"
        },
        {
            "Title": "Google Introduces Search Reviews Profile (1/4)",
            "Description": "Starting today, you can see all of your written reviews in a new profile, and more easily manage or delete them. Right now, this space is visible only to you. Starting June 24, other Google users will be able to see your…",
            "Link": "https://twitter.com/gaganghotra_/status/1793523019174047954"
        },
        {
            "Title": "The Growing Impact Of AI In Search: SEO Job Listings Experience 37% Decline In Q1 Of 2024",
            "Description": "SEO job listings fall 37% in Q1, largely due to AI automation, affecting mid-level roles most.",
            "Link": "https://www.digitalinformationworld.com/2024/05/the-growing-impact-of-ai-in-search-seo.html"
        },
        {
            "Title": "WTF is ID spoofing?",
            "Description": "ID spoofing, cookie stuffing, ID stuffing, etc. What does it mean when an SSP's user ID doesn't match the DSP's ID?",
            "Link": "https://digiday.com/media-buying/wtf-is-id-spoofing/"
        },
        {
            "Title": "Snap eyes growth as TikTok faces uncertain future in the U.S.",
            "Description": "TikTok’s uncertain future in the U.S. could be a win for Snap, especially as the TikTok ban calls into question the billions of dollars currently driving the short-form video app’s ad business.",
            "Link": "https://digiday.com/marketing/what-tiktoks-uncertain-future-in-the-u-s-could-mean-for-snaps-ad-business/"
        },
        {
            "Title": "Goodway Group launches retail media accelerator to bring order to a growing industry",
            "Description": "Digital media and marketing agency network Goodway Group added two new brands to focus on the modern marketing funnel and retail media expertise as part of its strategic expansion into growing areas of the industry.",
            "Link": "https://digiday.com/media-buying/goodway-group-launches-retail-media-accelerator-to-bring-order-to-a-growing-industry/"
        },
        {
            "Title": "Research Briefing: Despite challenges, marketers plan to increase programmatic spending in 2024",
            "Description": "In this edition of the Digiday+ Research Briefing, we examine the challenges marketers are facing within the programmatic ad market, what publishers are saying about diversifying revenue streams and how YouTube refined its pitch ahead of last week’s upfront event, as seen in recent data from Digiday+ Research.",
            "Link": "https://digiday.com/marketing/research-briefing-despite-challenges-marketers-plan-to-increase-programmatic-spending-in-2024/"
        },
        {
            "Title": "Media Briefing: Why some publishers are resurrecting their print magazines",
            "Description": "Nylon and Complex are bringing back print, but see more opportunity than just pure ad revenue.",
            "Link": "https://digiday.com/media/media-briefing-why-some-publishers-are-resurrecting-their-print-magazines/"
        },
        {
            "Title": "Google is testing special snippet treatment for Reddit search results",
            "Description": "This will very likely lead to even more traffic sent by Google Search to Reddit.",
            "Link": "https://searchengineland.com/google-is-testing-special-snippet-treatment-for-reddit-search-results-440729"
        },
        {
            "Title": "TikTok moves toward 'performance automation vision' with latest machine learning ad tools",
            "Description": "Just like Google, Meta and Amazon, TikTok wants to make advertising easy.",
            "Link": "https://digiday.com/marketing/tiktok-moves-toward-performance-automation-vision-with-latest-machine-learning-ad-tools/"
        },
        {
            "Title": "Why advertisers are using AI to manage ‘choice overload’ and unlock first-party data",
            "Description": "Daniel Engelke, Content Marketing Manager, Viant Advertisers exploring, if not currently using, AI-powered solutions from their ad tech partners need to ask if those tools are truly solving their everyday challenges.  These challenges span from the decline of third-party cookies (even if their end date has once again been pushed off) and new digital privacy […]",
            "Link": "https://digiday.com/sponsored/why-advertisers-are-using-ai-to-manage-choice-overload-and-unlock-first-party-data/"
        },
        {
            "Title": "Lessons from John Deere's 'The Furrow'",
            "Description": "Launched in 1895, \"The Furrow\" magazine was content marketing long before that term existed.",
            "Link": "https://www.practicalecommerce.com/lessons-from-john-deeres-magazine-the-furrow"
        },
        {
            "Title": "Google Search Ranking Volatility Spike On May 22",
            "Description": "After a few days of calm Google weather, we are now seeing a spike in volatility, fluctuations and SEO chatter around Google search ranking movement. It is somewhat early on but I am seeing both a spike in SEOs noticing ranking movement and many of the tools are showing a spike in volatility.",
            "Link": "https://www.seroundtable.com/google-search-ranking-volatility-spike-37431.html"
        },
        {
            "Title": "New iGB webinar delves into SEO strategies for the Brazilian market",
            "Description": "In partnership with Gainchanger, a leading SEO consultancy firm that specialises in iGaming, iGB presents the webinar “How to rank first place in Google: Advanced SEO strategies for Brazil.” Taking place this Wednesday, May 22nd, it will analyze the intricacies of SEO strategies tailored specifically for the Brazilian market.",
            "Link": "https://www.gamesbras.com/english-version/2024/5/21/new-igb-webinar-delves-into-seo-strategies-for-the-brazilian-market-45086.html"
        },
        {
            "Title": "Keeping Pace: How Agile Content Marketing Wins in a Fast-Changing Digital World",
            "Description": "Discover how agile content marketing helps brands stay relevant and engage audiences effectively in a fast-evolving digital landscape.",
            "Link": "https://www.marketingprofs.com/articles/2024/51307/keeping-pace-how-agile-content-marketing-wins-in-a-fast-changing-digital-world"
        },
        {
            "Title": "Weird Surge In Google Search Console Product Snippets Search Impressions",
            "Description": "Google Search Console may have another data bug, maybe, this time with product snippets. If you look at your Search Performance report, then filter by search appearance for product snippets, you will likely see a surge in impressions and clicks over the past few days.",
            "Link": "https://www.seroundtable.com/surge-product-snippets-search-impressions-gsc-37429.html"
        },
        {
            "Title": "Charts: U.S. Retail Ecommerce Sales Q1 2024",
            "Description": "Total Q1 retail sales — physical and online — were roughly unchanged from Q4 2023. Ecommerce only increased 2.1%.",
            "Link": "https://www.practicalecommerce.com/charts-u-s-retail-ecommerce-sales"
        },
        {
            "Title": "A lot has been said about coupons, but you can also clearly see the effect in igaming SERPs from the reputation abuse that went into effect on May 5th 👀 Many authoritative publications with betting / casino sections previously ranking for them, dropping in their visibility…",
            "Description": "Many authoritative publications with betting/casino sections previously ranking for coupons, experienced a drop in search engine visibility after Google's reputation abuse algorithm update on May 5th.",
            "Link": "https://twitter.com/aleyda/status/1793194811626832065"
        },
        {
            "Title": "Pitch deck: How Amazon is talking to marketers about Performance+",
            "Description": "Amazon is pitching its new Performance+ platform to marketers, designed to simplify campaign creation and management within its demand-side platform.",
            "Link": "https://digiday.com/marketing/pitch-deck-how-amazon-is-talking-to-marketers-about-performance/"
        },
        {
            "Title": "Why Purina's premium brand sees eye-tracking as a viable replacement for third-party cookies",
            "Description": "Purina's premium pet food brand is exploring eye-tracking technology as a potential alternative to third-party cookies for measuring advertising performance and understanding consumer attention.",
            "Link": "https://digiday.com/marketing/why-purinas-premium-brand-sees-eye-tracking-as-a-viable-replacement-for-third-party-cookies/"
        },
        {
            "Title": "As Roblox expands its advertising network, child safety concerns are on the horizon",
            "Description": "Roblox's expansion into advertising presents opportunities for marketers targeting Gen Z and gamers, but raises concerns about child safety given the platform's young user base.",
            "Link": "https://digiday.com/marketing/as-roblox-expands-its-advertising-network-child-safety-concerns-are-on-the-horizon/"
        },
        {
            "Title": "Future of TV Briefing: One area where the upfront measurement currency conversation is advancing",
            "Description": "The Future of TV Briefing discusses the progress made in establishing measurement currencies for advanced audiences in the upfront TV advertising market.",
            "Link": "https://digiday.com/future-of-tv/future-of-tv-briefing-one-area-where-the-upfront-measurement-currency-conversation-is-advancing/"
        },
        {
            "Title": "Google rolls out more tools for advertisers — including new formats for AI-generated search",
            "Description": "Google introduces new advertising formats for its AI-generated search results, expanding monetization options for advertisers less than a week after expanding AI-generated search.",
            "Link": "https://digiday.com/media-buying/google-rolls-out-more-tools-for-advertisers-including-new-formats-for-ai-generated-search/"
        },
        {
            "Title": "Improving content quality at scale with AI",
            "Description": "Discover how to leverage AI to uncover unanswered questions in your content, helping you enhance and improve it.",
            "Link": "https://searchengineland.com/improving-content-quality-scale-ai-442546"
        },
        {
            "Title": "SEO job listings down 37% in Q1 – bad omen or blip?",
            "Description": "We're living through a disruptive moment due to AI – and more turbulence is expected in the SEO job market.",
            "Link": "https://searchengineland.com/seo-job-listings-q1-2024-report-440725"
        },
        {
            "Title": "The myth of manufacturing author E-E-A-T",
            "Description": "Most brands are getting author E-E-A-T wrong. Here's a pragmatic approach to leveraging and showcasing true subject matter expertise.",
            "Link": "https://searchengineland.com/myth-manufacturing-author-e-e-a-t-440675"
        }
    ],
    "reviewed_urls": [
        "https://twitter.com/rustybrick/status/1794131858248142868",
        "https://twitter.com/rustybrick/status/1794115597661270023",
        "https://digiday.com/es/pepsico-se-lanza-a-la-conquista-del-consumidor-multicultural-con-las-galletas-marias-de-gamesa-favoritas-en-mexico/",
        "https://www.phillyvoice.com/bing-bing-dim-sum-cheu-noodle-closing-east-passyunk-fishtown/",
        "https://twitter.com/rustybrick/status/1794098954239365199",
        "https://twitter.com/rustybrick/status/1794081179638923662",
        "https://twitter.com/rustybrick/status/1794077404539023538",
        "https://gulfnews.com/business/retail/google-search-update-airlines-hotels-and-retailers-fear-seo-algorithm-changes-1.1716576326350",
        "https://twitter.com/rustybrick/status/1794073629694783505",
        "https://twitter.com/rustybrick/status/1794069854804406306",
        "https://twitter.com/rustybrick/status/1794066080018661793",
        "https://twitter.com/rustybrick/status/1794059907953508464",
        "https://twitter.com/rustybrick/status/1794059907953508464",
        "https://twitter.com/rustybrick/status/1794058530368156124",
        "https://www.dailymail.co.uk/tvshowbiz/article-13457069/elizabeth-hurley-kinder-deaths-steve-bing-shane-warne.html",
        "https://twitter.com/aleyda/status/1794051825907192179",
        "https://twitter.com/sengineland/status/1794029758453305689",
        "https://www.mirror.co.uk/3am/celebrity-news/liz-hurley-breaks-silence-losing-32886645",
        "https://twitter.com/rustybrick/status/1794020782605222241",
        "https://twitter.com/rustybrick/status/1794017006683099175",
        "https://twitter.com/rustybrick/status/1794013231872131099",
        "https://twitter.com/rustybrick/status/1794009456818163868",
        "https://twitter.com/rustybrick/status/1794005682439561623",
        "https://digiday.com/sponsored/the-brands-guide-to-full-funnel-creator-strategies/",
        "https://www.practicalecommerce.com/flair-remakes-product-photography",
        "https://twitter.com/rustybrick/status/1793998132327678270",
        "https://twitter.com/rustybrick/status/1793992903834112396",
        "https://twitter.com/rustybrick/status/1793991717479203027",
        "https://twitter.com/rustybrick/status/1793990307601912031",
        "https://twitter.com/glenngabe/status/1793983411704467691",
        "https://twitter.com/rustybrick/status/1793981034754969781",
        "https://twitter.com/glenngabe/status/1793977650681172346",
        "https://twitter.com/rustybrick/status/1793975505458286638",
        "https://searchengineland.com/backlinks-seo-importance-442529",
        "https://twitter.com/glenngabe/status/1793974185305247818",
        "https://twitter.com/rustybrick/status/1793972966432420330",
        "https://twitter.com/glenngabe/status/1793972601968038084",
        "https://twitter.com/rustybrick/status/1793970449874903278",
        "https://www.seroundtable.com/google-search-index-electronic-publication-epub-37446.html",
        "https://twitter.com/rustybrick/status/1793967933137285237",
        "https://twitter.com/rustybrick/status/1793965416563261861",
        "https://dataconomy.com/2024/05/24/microsoft-outage-bing-chatgpt-duckgogo/",
        "https://twitter.com/rustybrick/status/1793962900245344609",
        "https://twitter.com/rustybrick/status/1793960144407044390",
        "https://twitter.com/rustybrick/status/1793944963279110561",
        "https://www.globalvillagespace.com/massive-outage-disrupts-microsoft-services-bing-and-ai-tools-globally/",
        "https://www.prweb.com/releases/ignite-visibility-introduces-new-generative-engine-optimization-service-focused-on-boosting-visibility-in-ai-powered-search-engines-302153896.html",
        "https://www.medianews4u.com/sbi-general-insurance-onboards-1702-digital-for-seo-and-aso-services/",
        "https://twitter.com/aleyda/status/1793935315318538445",
        "https://www.computing.co.uk/news/4214199/microsoft-outage-disrupts-search-engines-ai-tools",
        "https://www.zdnet.com/article/what-is-copilot-formerly-bing-chat-heres-everything-you-need-to-know/",
        "https://twitter.com/NathanLands/status/1793925296967782434",
        "https://mspoweruser.com/microsoft-weirdly-renames-explain-with-copilot-feature-on-notepad-to-define-with-bing/",
        "https://www.sentinelassam.com/more-news/science-and-technology/microsoft-outage-affects-bing-copilot-chatgpt-other-services-globally",
        "https://digiday.com/marketing/how-snapchat-meta-pinterest-and-google-are-eyeing-up-tiktok-ad-dollars/",
        "https://digiday.com/media/inside-the-new-york-times-plans-to-correlate-attention-levels-to-other-metrics/",
        "https://digiday.com/media/why-publishers-are-preparing-to-federate-their-sites/",
        "https://digiday.com/media/why-publishers-fear-traffic-ad-declines-from-googles-ai-generated-search-results/",
        "https://twitter.com/aleyda/status/1793852400479920479",
        "https://twitter.com/aleyda/status/1793849699037839516",
        "https://thetechportal.com/2024/05/24/bing-and-copilot-were-down-affecting-search-services-worldwide-now-restored/",
        "http://gigazine.net/gsc_news/en/20240524-microsoft-outage-affects-chatgpt/",
        "https://gagadget.com/en/462799-there-was-a-glitch-in-the-bing-api-that-caused-microsofts-web-search-features-copilot-duckduckgo-and-chatgpt-to-stop-working/",
        "https://www.searchenginejournal.com/google-confirms-no-algorithmic-actions-for-site-reputation-abuse-yet/517337/",
        "https://digiday.com/sponsored/which-podcast-trends-are-capturing-advertisers-attention-in-2024/",
        "https://twitter.com/aleyda/status/1793741702039044235",
        "https://twitter.com/rustybrick/status/1793738328140882128",
        "https://arstechnica.com/gadgets/2024/05/bing-outage-shows-just-how-little-competition-google-search-really-has/",
        "https://www.laptopmag.com/software/browsers-search-engines/windows-chief-responds-to-a-long-running-complaint-i-hear-you-on-it",
        "https://www.neowin.net/news/microsoft-copilot-is-continuing-to-recover-from-an-extended-bing-outage/",
        "https://twitter.com/rustybrick/status/1793715016757391720",
        "https://twitter.com/rustybrick/status/1793713703298240706",
        "https://twitter.com/rustybrick/status/1793711241635975231",
        "https://twitter.com/rustybrick/status/1793707466800148826",
        "https://twitter.com/rustybrick/status/1793703692266254607",
        "https://twitter.com/rustybrick/status/1793699917052973136",
        "https://twitter.com/rustybrick/status/1793696142297010249",
        "https://protos.com/bing-and-duckduckgo-offline-overnight-google-says-thanks-for-the-data/",
        "https://searchengineland.com/new-for-2024-compare-16-top-seo-platforms-442523",
        "https://www.geo.tv/latest/545591-microsofts-chatgpt-copilot-bing-facing-these-major-glitches",
        "https://twitter.com/rustybrick/status/1793682863285850346",
        "https://techcrunch.com/2024/05/23/bing-is-down-bringing-duckduckgo-and-ecosia-down-too/",
        "https://twitter.com/searchliaison/status/1793681720283435109",
        "https://twitter.com/rustybrick/status/1793679144385159648",
        "https://cryptodaily.co.uk/news-in-crypto/crypto-intelligence:eu-threatens-microsoft-with-2-billion-fine-over-bing-ai-data-request",
        "https://twitter.com/Laikateam_/status/1793676982427033800",
        "https://twitter.com/googlesearchc/status/1793673243305410909",
        "https://www.techopedia.com/news/microsoft-bing-outage-takes-down-copilot-and-chatgpt-web-searches",
        "https://twitter.com/aleyda/status/1793670037599092953",
        "https://twitter.com/aleyda/status/1793669395195265327",
        "https://www.financialexpress.com/life/technology-microsoft-bing-issue-takes-down-copilot-chatgpt-search-users-report-widespread-outage-3499320/",
        "https://siliconangle.com/2024/05/23/global-outages-hit-microsoft-bing-duckduckgo-chatgpt-search-copilot/",
        "https://twitter.com/rustybrick/status/1793654618758738261",
        "https://twitter.com/rustybrick/status/1793650843977458077",
        "https://mashable.com/article/microsoft-outage-affects-bing-copilot-duckduckgo-chatgpt",
        "https://www.livemint.com/technology/tech-news/microsoft-bing-api-outage-disrupts-search-engines-worldwide-sparks-social-media-frenzy-11716472503091.html",
        "https://twitter.com/rustybrick/status/1793647068935754201",
        "https://yespunjab.com/microsoft-outage-affects-bing-copilot-other-services-globally/",
        "https://twitter.com/rustybrick/status/1793644641121939862",
        "https://www.tomshardware.com/software/search-engines/microsoft-suffering-from-outage-bing-copilot-and-duckduckgo-inaccessible-for-several-hours",
        "https://twitter.com/rustybrick/status/1793643294326734904",
        "https://www.forbes.com/advisor/business/software/website-optimization-tips/",
        "https://searchengineland.com/driving-traffic-not-leads-seo-cro-440747",
        "https://digiday.com/sponsored/why-brands-are-relying-on-multi-screen-attribution-insights/",
        "https://www.dailymail.co.uk/sciencetech/article-13451983/bing-duckduckgo-outage-fury-stone-age.html",
        "https://twitter.com/rustybrick/status/1793639519205359894",
        "https://twitter.com/rustybrick/status/1793635744499835346",
        "https://www.zdnet.com/article/a-massive-microsoft-outage-is-impacting-bing-copilot-chatgpt-and-duckduckgo/",
        "https://www.techtimes.com/articles/304925/20240523/microsoft-search-engine-bing-down-hours-services-relying-api-still.htm",
        "https://www.practicalecommerce.com/favorite-books-of-ecommerce-pros-q2-2024",
        "https://www.neowin.net/news/microsofts-bing-service-is-down-for-many-and-its-affecting-copilot-and-duckduckgo-as-well/",
        "https://twitter.com/glenngabe/status/1793622281886810589",
        "https://www.hometownstation.com/featured-stories/seo-myths-debunked-what-are-common-misconceptions-about-seo-508868",
        "https://www.androidauthority.com/bing-duckduckgo-down-3445742/",
        "https://www.techloy.com/major-bing-outage-disrupts-services-on-chatgpt-search-copilot-duckduckgo-and-others/",
        "https://www.mactrast.com/2024/05/microsoft-outage-takes-down-bing-copilot-duckduckgo-chatgpt-search/",
        "https://twitter.com/glenngabe/status/1793617062599749658",
        "https://www.sportskeeda.com/gaming-tech/news-is-microsoft-bing-today-may-23-duckduckgo-copilot-ecosia-working-explored",
        "https://zeenews.india.com/technology/microsoft-services-outage-bing-copilot-and-chatgpt-web-search-affected-globally-2751839.html",
        "https://inews.co.uk/news/bing-chatgpt-duckduckgo-down-3070942",
        "https://twitter.com/glenngabe/status/1793611856021541230",
        "https://twitter.com/rustybrick/status/1793610578386206983",
        "https://twitter.com/glenngabe/status/1793609638555914358",
        "https://twitter.com/glenngabe/status/1793608682397462883",
        "https://twitter.com/rustybrick/status/1793608061740879978",
        "https://twitter.com/rustybrick/status/1793607874473808033",
        "https://metro.co.uk/2024/05/23/microsoft-outage-takes-bing-duckduckgo-chatgpt-20895946/",
        "https://twitter.com/glenngabe/status/1793607578691285035",
        "https://www.latestly.com/quickly/technology/massive-microsoft-outage-affect-bing-copilot-and-other-services-globally-5985125.html",
        "https://www.latestly.com/technology/microsoft-outage-massive-interruption-affect-services-like-bing-search-copilot-chatgpt-and-more-globally-including-india-check-details-5985125.html",
        "https://twitter.com/rustybrick/status/1793605545263239238",
        "https://www.sarkaritel.com/microsoft-outage-affects-bing-copilot-other-services-globally/",
        "https://techeconomy.ng/microsoft-bing-api-outage-affects-search-engines-and-ai-tools/",
        "https://www.windowscentral.com/software-apps/copilot-bing-and-other-microsoft-services-are-down-and-chatgpt-cant-search-the-web",
        "https://www.indiatvnews.com/technology/news/microsoft-services-down-globally-outage-affects-bing-copilot-more-here-s-how-users-reacted-2024-05-23-932992",
        "https://twitter.com/glenngabe/status/1793599383495450812",
        "https://itc.ua/en/news/bing-api-glitch-breaks-copilot-chatgpt-and-duckduckgo-search-functions/",
        "https://www.pcmag.com/news/bing-duckduckgo-chatgpt-search-copilot-hit-with-outage",
        "https://www.theregister.com/2024/05/23/bing_and_copilot_fall_from/",
        "https://www.indiatoday.in/technology/news/story/microsoft-bing-copilot-stops-working-for-several-users-2542931-2024-05-23",
        "https://9to5mac.com/2024/05/23/bing-down/",
        "https://www.timesnownews.com/technology-science/microsoft-outage-bing-search-and-copilot-down-users-unable-to-access-article-110364335",
        "https://twitter.com/aleyda/status/1793567474367029712",
        "https://twitter.com/aleyda/status/1793557776087871534",
        "https://www.streetinsider.com/Newsfile/LinkDaddy+Announces+Use+of+Ahrefs+Backlink+Checker+for+SEO+Ranking+Service/23266350.html",
        "https://twitter.com/gaganghotra_/status/1793523019174047954",
        "https://www.digitalinformationworld.com/2024/05/the-growing-impact-of-ai-in-search-seo.html",
        "https://digiday.com/media-buying/wtf-is-id-spoofing/",
        "https://digiday.com/marketing/what-tiktoks-uncertain-future-in-the-u-s-could-mean-for-snaps-ad-business/",
        "https://digiday.com/media-buying/goodway-group-launches-retail-media-accelerator-to-bring-order-to-a-growing-industry/",
        "https://digiday.com/marketing/research-briefing-despite-challenges-marketers-plan-to-increase-programmatic-spending-in-2024/",
        "https://digiday.com/media/media-briefing-why-some-publishers-are-resurrecting-their-print-magazines/",
        "https://www.openpr.com/news/3508898/freelancers-hub-unveils-versatile-seo-service-suite-tailored",
        "https://www.theglobeandmail.com/investing/markets/markets-news/Newsfile/26399795/linkdaddy-announces-use-of-ahrefs-backlink-checker-for-seo-ranking-service/",
        "https://twitter.com/aleyda/status/1793401060507177412",
        "https://twitter.com/aleyda/status/1793385639544520729",
        "https://twitter.com/aleyda/status/1793359015054864661",
        "https://twitter.com/aleyda/status/1793352699901022496",
        "https://twitter.com/glenngabe/status/1793323571063697414",
        "https://twitter.com/glenngabe/status/1793321306743529501",
        "https://www.asiaone.com/business/yourseoboard-launches-cutting-edge-white-label-seo-solution-effortless-business-growth",
        "https://twitter.com/glenngabe/status/1793318798105117169",
        "https://twitter.com/glenngabe/status/1793306550162915700",
        "https://searchengineland.com/google-is-testing-special-snippet-treatment-for-reddit-search-results-440729",
        "https://twitter.com/ajkohn/status/1793284944103628985",
        "https://digiday.com/marketing/tiktok-moves-toward-performance-automation-vision-with-latest-machine-learning-ad-tools/",
        "https://digiday.com/sponsored/why-advertisers-are-using-ai-to-manage-choice-overload-and-unlock-first-party-data/",
        "https://twitter.com/aleyda/status/1793273194079486215",
        "https://twitter.com/glenngabe/status/1793263639455039792",
        "https://www.practicalecommerce.com/lessons-from-john-deeres-magazine-the-furrow",
        "https://twitter.com/glenngabe/status/1793259931765751823",
        "https://twitter.com/glenngabe/status/1793258234322551153",
        "https://twitter.com/glenngabe/status/1793252190712103367",
        "https://twitter.com/levelsio/status/1793251750788358573",
        "https://www.seroundtable.com/google-search-ranking-volatility-spike-37431.html",
        "https://twitter.com/glenngabe/status/1793250562340753850",
        "https://www.gamesbras.com/english-version/2024/5/21/new-igb-webinar-delves-into-seo-strategies-for-the-brazilian-market-45086.html",
        "https://www.marketingprofs.com/articles/2024/51307/keeping-pace-how-agile-content-marketing-wins-in-a-fast-changing-digital-world",
        "https://twitter.com/glenngabe/status/1793246599717560461",
        "https://www.seroundtable.com/surge-product-snippets-search-impressions-gsc-37429.html",
        "https://www.practicalecommerce.com/charts-u-s-retail-ecommerce-sales",
        "https://twitter.com/aleyda/status/1793216180741669327",
        "https://twitter.com/aleyda/status/1793194811626832065",
        "https://www.forbes.com/advisor/business/seo-strategy/",
        "https://www.financialexpress.com/business/brandwagon-grapes-appoints-akshay-bhatla-as-vice-president-of-growth-for-seo-and-organic-verticals-3497196/",
        "https://twitter.com/aleyda/status/1793168391219339404",
        "https://digiday.com/marketing/pitch-deck-how-amazon-is-talking-to-marketers-about-performance/",
        "https://digiday.com/marketing/why-purinas-premium-brand-sees-eye-tracking-as-a-viable-replacement-for-third-party-cookies/",
        "https://digiday.com/marketing/as-roblox-expands-its-advertising-network-child-safety-concerns-are-on-the-horizon/",
        "https://digiday.com/future-of-tv/future-of-tv-briefing-one-area-where-the-upfront-measurement-currency-conversation-is-advancing/",
        "https://digiday.com/media-buying/where-do-middle-managers-find-support-for-themselves-the-return-podcast-season-3-episode-5/",
        "https://digiday.com/media-buying/google-rolls-out-more-tools-for-advertisers-including-new-formats-for-ai-generated-search/",
        "https://www.inquirer.com/food/restaurants/cheu-bing-bing-closing-philadelphia-restaurants-20240524.html",
        "https://searchengineland.com/improving-content-quality-scale-ai-442546",
        "https://searchengineland.com/seo-job-listings-q1-2024-report-440725",
        "https://searchengineland.com/myth-manufacturing-author-e-e-a-t-440675"
    ]
}