{
    "valid_articles": [
        {
            "Title": "ICYMI: SEO Video Recap: Google Search data leak, ranking volatility, Search Console link declines, core SEO advice, Google tests and so much more",
            "Description": "ICYMI: SEO Video Recap: Google Search data leak, ranking volatility, Search Console link declines, core SEO advice, Google tests and so much more youtube.com/watch?v=rOAbK-",
            "Link": "https://twitter.com/rustybrick/status/1796617894559674540"
        },
        {
            "Title": "ICYMI: Google AI Overviews are here to stay - here is how Google responded to the criticism",
            "Description": "ICYMI: Google AI Overviews are here to stay - here is how Google responded to the criticism seroundtable.com/google-ai-over…",
            "Link": "https://twitter.com/rustybrick/status/1796614119488921814"
        },
        {
            "Title": "Google SGE: How to Make the Best of AI Overviews by Kai Blum in the @Mailchimp blog 👀 thanks for adding my tips! 👇",
            "Description": "Google SGE: How to Make the Best of AI Overviews by Kai Blum in the @Mailchimp blog 👀 thanks for adding my tips! 👇 mailchimp.com/resources/goog…",
            "Link": "https://twitter.com/aleyda/status/1796612712832618764"
        },
        {
            "Title": "ICYMI: Google Search Shopping ideas carousel",
            "Description": "ICYMI: Google Search Shopping ideas carousel seroundtable.com/google-search-…",
            "Link": "https://twitter.com/rustybrick/status/1796610344682684426"
        },
        {
            "Title": "ICYMI: Google Knowledge Panels \"see also\"",
            "Description": "ICYMI: Google Knowledge Panels \"see also\" seroundtable.com/google-knowled…",
            "Link": "https://twitter.com/rustybrick/status/1796606569783919086"
        },
        {
            "Title": "Learn How to track your AI Overviews Inclusions and Traffic Impact so Far [Paid & Free Methods]. In this guide I show how to track and assess the traffic from the queries: * Showing AI Overviews and including your pages, not including your pages, and not showing AIO at all to…",
            "Description": "Learn How to track your AI Overviews Inclusions and Traffic Impact so Far [Paid & Free Methods]. In this guide I show how to track and assess the traffic from the queries: * Showing AI Overviews and including your pages, not including your pages, and not showing AIO at all to…",
            "Link": "https://twitter.com/aleyda/status/1796603708878324056"
        },
        {
            "Title": "Learn How to track your AI Overviews Inclusions and Traffic Impact so Far [Paid & Free Methods]. In this guide I show how to track the queries: * Showing AI Overviews and including your pages, not including your pages, and not showing AIO at all to compare their before/after *…",
            "Description": "Learn How to track your AI Overviews Inclusions and Traffic Impact so Far [Paid & Free Methods]. In this guide I show how to track the queries: * Showing AI Overviews and including your pages, not including your pages, and not showing AIO at all to compare their before/after *…",
            "Link": "https://twitter.com/aleyda/status/1796603063156830428"
        },
        {
            "Title": "ICYMI: Only 10% of SEOs trust Google",
            "Description": "ICYMI: Only 10% of SEOs trust Google seroundtable.com/10-of-seos-tru…",
            "Link": "https://twitter.com/rustybrick/status/1796602795220726060"
        },
        {
            "Title": "What's in the leak of Google's internal search documents?",
            "Description": "A significant number of internal Google documents leaked this week, offering insight into how the search engine ranks websites.",
            "Link": "https://boingboing.net/2024/05/31/whats-in-the-leak-of-googles-internal-search-documents.html"
        },
        {
            "Title": "ICYMI: Google tests opening the first people also ask snippet by default",
            "Description": "ICYMI: Google tests opening the first people also ask snippet by default seroundtable.com/google-people-…",
            "Link": "https://twitter.com/rustybrick/status/1796599019986211125"
        },
        {
            "Title": "Google is seeking to patent a system for “using user input to adapt search results” provided in an automated assistant context. Google’s system modifies search results based on user feedback in a turn-based conversation \"When a user…",
            "Description": "Like having a conversation with Jarvis :) -> Google is seeking to patent a system for “using user input to adapt search results” provided in an automated assistant context. Google’s system modifies search results based on user feedback in a turn-based conversation \"When a user…",
            "Link": "https://twitter.com/glenngabe/status/1796588054456525040"
        },
        {
            "Title": "Great addition -> Chrome’s new Minimized Custom Tabs are genius \"We now have the ability to use a PIP (picture-in-picture) feature in Chrome Custom Tabs to minimize a tab and leave it floating on-screen for viewing later.\" \"A the top of the Custom Tab, you can simply click the…",
            "Description": "Great addition -> Chrome’s new Minimized Custom Tabs are genius \"We now have the ability to use a PIP (picture-in-picture) feature in Chrome Custom Tabs to minimize a tab and leave it floating on-screen for viewing later.\" \"A the top of the Custom Tab, you can simply click the…",
            "Link": "https://twitter.com/glenngabe/status/1796585212350005463"
        },
        {
            "Title": "I didn't notice, but the first link in Google's AI Overviews update post is to something I wrote in 2019",
            "Description": "I didn't notice, but the first link in Google's AI Overviews update post is to something I wrote in 2019 blog.google/products/searc…",
            "Link": "https://twitter.com/rustybrick/status/1796574212049539121"
        },
        {
            "Title": "RT by @glenngabe: The issue has now been resolved.",
            "Description": "RT by @glenngabe: The issue has now been resolved.",
            "Link": "https://twitter.com/searchliaison/status/1796570551936512034"
        },
        {
            "Title": "RT by @aleyda: The issue has now been resolved.",
            "Description": "RT by @aleyda: The issue has now been resolved.",
            "Link": "https://twitter.com/searchliaison/status/1796570551936512034"
        },
        {
            "Title": "The Google News / Discover issue is fully resolved - story updated at seroundtable.com/google-news-ta…",
            "Description": "The Google News / Discover issue is fully resolved - story updated at seroundtable.com/google-news-ta…",
            "Link": "https://twitter.com/rustybrick/status/1796568330272112897"
        },
        {
            "Title": "SEO Video Recap: Google Search data leak, ranking volatility, Search Console link declines, core SEO advice, Google tests and so much more",
            "Description": "SEO Video Recap: Google Search data leak, ranking volatility, Search Console link declines, core SEO advice, Google tests and so much more youtube.com/watch?v=rOAbK-",
            "Link": "https://twitter.com/rustybrick/status/1796557497022697965"
        },
        {
            "Title": "Google News went down and I tried Bing News – I might never go back",
            "Description": "The news platform you're not using",
            "Link": "https://www.techradar.com/computing/search-engines/google-news-went-down-and-i-tried-bing-news-i-might-never-go-back"
        },
        {
            "Title": "Google AI Overviews are here to stay - here is how Google responded to the criticism - Ray Google AI Overviews Update",
            "Description": "Google AI Overviews are here to stay - here is how Google responded to the criticism - Ray Google AI Overviews Update seroundtable.com/google-ai-over…",
            "Link": "https://twitter.com/rustybrick/status/1796553721695908176"
        },
        {
            "Title": "The biggest findings in the Google Search leak",
            "Description": "The documents detail data collected by Google.",
            "Link": "https://www.theverge.com/2024/5/31/24167119/google-search-algorithm-documents-leak-seo-chrome-clicks"
        },
        {
            "Title": "RT by @glenngabe: Features included some results on Google News, Discover and other products, for those who have asked about specific ones.",
            "Description": "RT by @glenngabe: Features included some results on Google News, Discover and other products, for those who have asked about specific ones.",
            "Link": "https://twitter.com/searchliaison/status/1796552935067001206"
        },
        {
            "Title": "Features included some results on Google News, Discover and other products, for those who have asked about specific ones.",
            "Description": "Google has identified and is working on a fix for an ongoing issue affecting the serving of some features in Google Search, including Google News and Discover.",
            "Link": "https://twitter.com/searchliaison/status/1796552935067001206"
        },
        {
            "Title": "Google Search Shopping ideas carousel",
            "Description": "Google is testing a new \"Shopping Ideas\" carousel in search results, providing users with product suggestions related to their search queries.",
            "Link": "https://twitter.com/rustybrick/status/1796549947015516209"
        },
        {
            "Title": "Google Knowledge Panels \"see also\"",
            "Description": "Google Knowledge Panels are now featuring a \"See also\" section, providing links to related entities and topics.",
            "Link": "https://twitter.com/rustybrick/status/1796546171961307281"
        },
        {
            "Title": "Only 10% of SEOs trust Google",
            "Description": "A recent survey reveals that only 10% of SEOs trust Google, highlighting the strained relationship between the search giant and the SEO community.",
            "Link": "https://twitter.com/rustybrick/status/1796542397217898940"
        },
        {
            "Title": "Google has now confirmed the issue - story updated",
            "Description": "Google has officially confirmed the ongoing issue affecting Google News and other services, stating that they are working on a fix.",
            "Link": "https://twitter.com/rustybrick/status/1796540734985863634"
        },
        {
            "Title": "There's an ongoing issue with serving some features in Google Search. We've identified the issue and we're working on a fix.",
            "Description": "Google acknowledges an ongoing issue affecting the serving of some features in Google Search and is actively working on a resolution.",
            "Link": "https://twitter.com/searchliaison/status/1796540379187351794"
        },
        {
            "Title": "Google tests opening the first people also ask snippet by default",
            "Description": "Google is experimenting with automatically expanding the first \"People also ask\" snippet in search results, potentially increasing visibility for featured snippets.",
            "Link": "https://twitter.com/rustybrick/status/1796538622121766950"
        },
        {
            "Title": "Google News search tab and Google News home page seems to be coming back for me - I see news results again - story updated at",
            "Description": "Google News services, including the search tab and home page, appear to be gradually restoring functionality after experiencing outages.",
            "Link": "https://twitter.com/rustybrick/status/1796536613817975066"
        },
        {
            "Title": "Google News services going offline a conspiracy???",
            "Description": "Speculation arises regarding the recent outages affecting Google News services, with some questioning the cause of the disruptions.",
            "Link": "https://twitter.com/rustybrick/status/1796532778286391438"
        },
        {
            "Title": "tip @Techmeme Google News is down",
            "Description": "Reports emerge of Google News experiencing downtime, impacting users' ability to access news content through the platform.",
            "Link": "https://twitter.com/rustybrick/status/1796529307709591887"
        },
        {
            "Title": "Google To Limit AI Overviews For \"Nonsensical\" Queries",
            "Description": "Google announces plans to refine its AI-powered search overviews, limiting their appearance for queries deemed nonsensical or lacking clear search intent.",
            "Link": "https://www.searchenginejournal.com/google-to-limit-ai-overviews-for-nonsensical-queries/518063/"
        },
        {
            "Title": "Some important info regarding OpenAI publisher deals, how models are trained & the blocking of GPTBot, the importance of smaller publisher partnerships, and the timeline of displaying publisher data in ChatGPT \"It is “incumbent” on OpenAI to make sure smaller publishers get the…",
            "Description": "OpenAI addresses concerns and provides insights into its publisher deals, AI model training practices, and the importance of partnerships with smaller publishers.",
            "Link": "https://twitter.com/glenngabe/status/1796525836985585760"
        },
        {
            "Title": "This is also impacting the Google Discover feed, where sometimes no news is loaded on the Google home page. Plus some Google News sections and Google Trends, and more are not showing",
            "Description": "The ongoing Google News outage is reported to be affecting other services, including Google Discover, Google Trends, and various sections of the Google home page.",
            "Link": "https://twitter.com/rustybrick/status/1796525197622681640"
        },
        {
            "Title": "Yep, it's blank. Wow. A big heads-up for news publishers.",
            "Description": "Confirmation of the Google News outage, highlighting the significant impact on news publishers relying on the platform for traffic and visibility.",
            "Link": "https://twitter.com/glenngabe/status/1796523601593851905"
        },
        {
            "Title": "Still learning GA4? -> How To Create A Custom Report in GA4 For Analyzing Campaigns Using UTM Parameters",
            "Description": "A helpful resource for users transitioning to Google Analytics 4 (GA4), providing guidance on creating custom reports for campaign analysis using UTM parameters.",
            "Link": "https://twitter.com/glenngabe/status/1796521141873623361"
        },
        {
            "Title": "Google News tab is bugging out for some, so if you see less traffic from Google Search's news tab today, this might be why thanks",
            "Description": "Users are advised that the Google News tab is experiencing issues, potentially leading to reduced traffic from Google Search for news-related queries.",
            "Link": "https://twitter.com/rustybrick/status/1796520410802262018"
        },
        {
            "Title": "Local SEO According To The Leaked Google API Documents \"Here is a summary of 271 Google API Docs and 461 attributes that we have identified as relevant to Local SEO. We identified various terms that implied “local,” then crawled them with Screaming Frog V.20 connected to ChatGPT…",
            "Description": "Analysis of leaked Google API documents reveals insights and attributes relevant to local SEO, potentially providing valuable information for optimizing local search presence.",
            "Link": "https://twitter.com/glenngabe/status/1796519787536830592"
        },
        {
            "Title": "TikTok’s Exploring a US Only Version of its Feed Algorithm “TikTok is working on a clone of its recommendation algorithm for its 170 million U.S. users that may result in a version that operates independently of its Chinese parent and be more palatable to American lawmakers…",
            "Description": "TikTok is reportedly developing a US-specific version of its feed algorithm, aiming to address concerns from US lawmakers regarding data security and content moderation.",
            "Link": "https://twitter.com/glenngabe/status/1796518441261621589"
        },
        {
            "Title": "The Ray Update. I dig it. :) And things will continue to improve on the AI Overviews front. The link cards I'm seeing are stronger than what I saw a week ago (and especially for health/medical queries). It's not perfect, but better.",
            "Description": "Positive feedback on Google's recent \"Ray\" update, particularly regarding improvements to AI-powered search overviews and the quality of link cards in search results.",
            "Link": "https://twitter.com/glenngabe/status/1796514597803085827"
        },
        {
            "Title": "More from Liz Reid's post about improving AI overviews -> \"For topics like news and health, we already have strong guardrails in place. For example, we aim to not show AI Overviews for hard news topics, where freshness and factuality are important. In the case of health, we…",
            "Description": "Google emphasizes its commitment to responsible AI implementation, highlighting existing safeguards for sensitive topics like news and health in AI-powered search overviews.",
            "Link": "https://twitter.com/glenngabe/status/1796510083339129076"
        },
        {
            "Title": "Google AI Overviews are here to stay, with some improvements - in fact, Google said they are as accurate as featured snippets. Let's call this the Ray Google AI Overviews Update",
            "Description": "Google AI Overviews are here to stay, with some improvements - in fact, Google said they are as accurate as featured snippets. Let's call this the Ray Google AI Overviews Update",
            "Link": "https://twitter.com/rustybrick/status/1796509681415803128"
        },
        {
            "Title": "OpenAI unveils ChatGPT Edu, an “affordable” version for universities, including GPT-4o access, custom GPT creation, and higher message limits than the free tier \"ChatGPT Edu can reason across text and vision and use advanced tools such as data analysis. This new offering…",
            "Description": "OpenAI unveils ChatGPT Edu, an “affordable” version for universities, including GPT-4o access, custom GPT creation, and higher message limits than the free tier \"ChatGPT Edu can reason across text and vision and use advanced tools such as data analysis. This new offering…",
            "Link": "https://twitter.com/glenngabe/status/1796509041889325514"
        },
        {
            "Title": "Google \"shopping ideas\" carousel within Search",
            "Description": "Google \"shopping ideas\" carousel within Search",
            "Link": "https://twitter.com/rustybrick/status/1796507164762099980"
        },
        {
            "Title": "Google Knowledge Panels \"see also\" feature (is it new?)",
            "Description": "Google Knowledge Panels \"see also\" feature (is it new?)",
            "Link": "https://twitter.com/rustybrick/status/1796504648498483560"
        },
        {
            "Title": "Only 10% of SEOs trust Google statements on search (it is the same percentage from 10 years ago)",
            "Description": "Only 10% of SEOs trust Google statements on search (it is the same percentage from 10 years ago)",
            "Link": "https://twitter.com/rustybrick/status/1796502131824029868"
        },
        {
            "Title": "Google testing opening the first people also ask snippet by default",
            "Description": "Google testing opening the first people also ask snippet by default",
            "Link": "https://twitter.com/rustybrick/status/1796499615187177844"
        },
        {
            "Title": "A must read from @richsangerSEO going through the Generative summaries for search results patent and how AI Overviews work 👀 👇 richsanger.com/how-googles-ai…",
            "Description": "A must read from @richsangerSEO going through the Generative summaries for search results patent and how AI Overviews work 👀 👇 richsanger.com/how-googles-ai…",
            "Link": "https://twitter.com/aleyda/status/1796492854816379007"
        },
        {
            "Title": "A massive leak of Google Search documents sparks fury across the SEO industry: 'This is another level of war'",
            "Description": "How Google organizes the web has been one of the greatest unsolved mysteries of the internet. The black box was finally opened this week.",
            "Link": "https://www.businessinsider.com/google-search-documents-seo-leak-ranking-2024-5"
        },
        {
            "Title": "📬 Daily Brief: Leaky docs",
            "Description": "Google’s search division is under fire from internet experts after leaks about its SEO tactics.",
            "Link": "https://qz.com/emails/daily-brief/1851510817/google-seo-leak-mcdonald-inflation-donald-trump-guilty"
        },
        {
            "Title": "RT by @aleyda: If you're not changing anything about how you do SEO following the Google Leak... You're not paying attention. I'm not even in search, and I'm changing a whole heap of tactics and strategy! New post & video on SparkToro with details.",
            "Description": "RT by @aleyda: If you're not changing anything about how you do SEO following the Google Leak... You're not paying attention. I'm not even in search, and I'm changing a whole heap of tactics and strategy! New post & video on SparkToro with details.",
            "Link": "https://twitter.com/randfish/status/1796457746193322108"
        },
        {
            "Title": "Dual Power: How to Leverage Google Ads and SEO for Total Maximum Impact",
            "Description": "Attend the translation and localization industry’s leading events, network with thought leaders, and grow your career and business online.",
            "Link": "https://slator.com/event/dual-power-how-to-leverage-google-ads-and-seo-for-total-maximum-impact/"
        },
        {
            "Title": "This! Also, it’s important to note that while is also expected and healthy to question things, *HOW* you do it makes a huge difference. Debating thoughts or concepts while being professional, constructive and empathic to clarify and/or improve on something should be obviously…",
            "Description": "This! Also, it’s important to note that while is also expected and healthy to question things, *HOW* you do it makes a huge difference. Debating thoughts or concepts while being professional, constructive and empathic to clarify and/or improve on something should be obviously…",
            "Link": "https://twitter.com/aleyda/status/1796420340773499079"
        },
        {
            "Title": "Google answering to the backlash from the AI Overviews, explaining how they work and improvements they’ve made: * While AI Overviews are powered by a customized language model, the model is integrated with Google core web ranking systems, built to only show information that is…",
            "Description": "Google answering to the backlash from the AI Overviews, explaining how they work and improvements they’ve made: * While AI Overviews are powered by a customized language model, the model is integrated with Google core web ranking systems, built to only show information that is…",
            "Link": "https://twitter.com/aleyda/status/1796409934663295368"
        },
        {
            "Title": "FullThrottle.AI creates audience planner tool using an AI assistant",
            "Description": "AI and data company FullThrottle.AI is developing an audience targeting tool for agencies using an AI assistant.",
            "Link": "https://digiday.com/media-buying/fullthrottle-ai-creates-audience-planner-tool-using-an-ai-assistant/"
        },
        {
            "Title": "How Klarna is using AI for cost savings, changing 'extremely frustrating' creative processes",
            "Description": "Klarna has started to use AI for ideation, image creation and translation efforts to create more personalized campaigns for consumers across the 45 markets that it operates in currently.",
            "Link": "https://digiday.com/marketing/how-klarna-is-using-ai-for-cost-savings-changing-extremely-frustrating-creative-processes/"
        },
        {
            "Title": "Digiday+ Research: Publishers continue to rely on programmatic revenue, despite recent issues",
            "Description": "Programmatic marketing has its fair share of issues. But the fact is that publishers continue to depend on the revenue they get from programmatic advertising.",
            "Link": "https://digiday.com/media/digiday-research-publishers-continue-to-rely-on-programmatic-revenue-despite-recent-issues/"
        },
        {
            "Title": "Shrinking budgets leave programmatic marketers with a raw deal",
            "Description": "Shrinking budgets mean clients are less willing to shell out enough money to cover tech tools, staff working hours and commissions, leaving programmatic marketers with the short end of the stick.",
            "Link": "https://digiday.com/marketing/shrinking-budgets-leaves-programmatic-marketers-with-a-raw-deal/"
        },
        {
            "Title": "\"In the case of health, Google said it launched additional triggering refinements to enhance our quality protections.\"",
            "Description": "\"In the case of health, Google said it launched additional triggering refinements to enhance our quality protections.\"",
            "Link": "https://twitter.com/glenngabe/status/1796346815690006999"
        },
        {
            "Title": "Google is looking into the massive drop in links reported by Google Search Console - story updated at seroundtable.com/google-search-…",
            "Description": "Google is looking into the massive drop in links reported by Google Search Console - story updated at seroundtable.com/google-search-…",
            "Link": "https://twitter.com/rustybrick/status/1796342296402944223"
        },
        {
            "Title": "Google explains how it is improving its AI Overviews",
            "Description": "Google explains how it is improving its AI Overviews",
            "Link": "https://twitter.com/rustybrick/status/1796340986278244673"
        },
        {
            "Title": "RT by @aleyda: Exciting news! Ahrefs & Yep now support IndexNow! This move marks a growing list of platforms adopting IndexNow to improve data freshness and indexing speed across the web. Quit waiting for your latest content to be crawled! Click for details: ahrefs.com/blog/indexnow-…",
            "Description": "RT by @aleyda: Exciting news! Ahrefs & Yep now support IndexNow! This move marks a growing list of platforms adopting IndexNow to improve data freshness and indexing speed across the web. Quit waiting for your latest content to be crawled! Click for details: ahrefs.com/blog/indexnow-…",
            "Link": "https://twitter.com/facan/status/1796310182546522553"
        },
        {
            "Title": "Google still dominates AI search performance: SOCi",
            "Description": "According to search focus marking platform SOCi, Google's (GOOG, GOOGL) AI search software continues to outperform its competitors, while OpenAI's ChatGPT pales in comparison, coming in dead last. SOCi CEO Afif Khoury joins Asking For a Trend to discusses the study's methodology and findings. Khoury elaborates on the findings: \"The spin on it may currently not be in favor of GPT in the sense that, generative AI tools, they have access to the internet. So GPT has access to this local data as much as Bing or Google do because it's public, publicly found information, but it does come down to how they write their algorithms and what they prioritize and Google has been in the local game for a long time and heavily prioritizes that data. So I wouldn't say it's unfair in that different companies have access to different information, but if when you pick a certain topic, some may be better than others for that topic, depending on what they prioritize.\" For more expert insight and the latest ma",
            "Link": "https://finance.yahoo.com/video/google-still-dominates-ai-search-213358825.html"
        },
        {
            "Title": "Mini SEO Case Study: Getting a site ranking in multiple Google AI Overviews • Simply updated the webpage to closely match the text of the AI Overview🤷 • If the site was ranking in the top 10, it typically won a reference link • Easy come, easy go. These things change A LOT",
            "Description": "None",
            "Link": "https://twitter.com/CyrusShepard/status/1796256862402396260"
        },
        {
            "Title": "SEO Experts: Leaked Documents Expose How Google Has Been Lying About Its Search Algorithm",
            "Description": "Leaked documents reveal Google's discrepancies in search algorithm practices, showing biases favoring larger websites and contradicting public claims about neutrality and ranking factors.",
            "Link": "https://www.techtimes.com/articles/305182/20240530/seo-experts-leaked-documents-expose-google-lying-search-algorithm.htm"
        },
        {
            "Title": "ICYMI: Google confirmed search data ranking leak but urges caution seroundtable.com/google-confirm…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796251731581403464"
        },
        {
            "Title": "ICYMI: Google added site reputation and expire domain abuse to the spam reporting tool seroundtable.com/google-report-…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796248711854539040"
        },
        {
            "Title": "ICYMI: Google Search Console link report having issues? Many reporting declines in link counts, even zero links reported seroundtable.com/google-search-…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796247956854567131"
        },
        {
            "Title": "ICYMI: Google people also asked colored boxed-in design seroundtable.com/google-people-…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796244181985440194"
        },
        {
            "Title": "RT by @aleyda: I wrote a post for the gold standard publication in our space @sengineland talking about how I think we move forward after the Google documentation leak searchengineland.com/how-seo-moves-… Draw your own conclusions, but these are my thoughts.",
            "Description": "None",
            "Link": "https://twitter.com/iPullRank/status/1796240565912162461"
        },
        {
            "Title": "ICYMI: Google Search \"early adopter\" badge seroundtable.com/google-early-a…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796240407363469367"
        },
        {
            "Title": "RT by @rustybrick: How SEO moves forward with the Google Content Warehouse API leak via @iPullRank searchengineland.com/how-seo-moves-…",
            "Description": "None",
            "Link": "https://twitter.com/sengineland/status/1796238601526648877"
        },
        {
            "Title": "ICYMI: Google Maps adds wheelchair-accessible icon to business listings seroundtable.com/google-maps-wh…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796236632221172167"
        },
        {
            "Title": "How to use X (formerly Twitter) for SEO",
            "Description": "In this guide, we will look at the various strategies and best practices on X to boost SEO.",
            "Link": "https://www.techloy.com/how-to-use-x-formerly-twitter-for-seo/"
        },
        {
            "Title": "ICYMI: Google Fiber light up letter sign seroundtable.com/photos/google-…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796232857473663080"
        },
        {
            "Title": "Leaked Google documents frustrate internet experts: ‘We’ve been lied to’",
            "Description": "SEO specialists dove into 2,500 pages of leaked documents from Google's Search Division showing which information it collects from websites and users",
            "Link": "https://qz.com/leaked-google-documents-about-its-search-engine-data-an-1851509445"
        },
        {
            "Title": "Yep, AI agents could be huge... And if you're an affiliate marketer, a big heads-up about the example they provided -> Anthropic’s AI now lets you create bots to work for you (it can buy shoes, read emails, or do whatever you want) \"For instance, the tool can analyze data to…",
            "Description": "None",
            "Link": "https://twitter.com/glenngabe/status/1796223727186702403"
        },
        {
            "Title": "What?? \"All these pages are publishable and also searchable through Google.\" -> Perplexity AI’s new feature will turn your searches into shareable pages \"Perplexity said its algorithms work to create a detailed article with different sections. You can ask the AI tool to rewrite…",
            "Description": "None",
            "Link": "https://twitter.com/glenngabe/status/1796220795250724920"
        },
        {
            "Title": "Probably tied to AI agents (like the article covers). i.e. Project Astra -> Google and Magic Leap partner to work on building immersive experiences that blend the physical and digital worlds, but offer few details \"While short on details, the announcement adds to signals that…",
            "Description": "None",
            "Link": "https://twitter.com/glenngabe/status/1796219005352526239"
        },
        {
            "Title": "Pre @DigitalOlympus dinner with such an awesome crew of SEOs speaking tomorrow! @AlexTachalova come here asap 😬🙌 with @JudithLewis @BibiBuzzCom @Fernando1Angulo @hellemans @n_minkov @FelipeBazon and more! PS: can you guess what’s the no. 1 topic we’re all talking about?! 😂",
            "Description": "None",
            "Link": "https://twitter.com/aleyda/status/1796216508563050681"
        },
        {
            "Title": "RT by @rustybrick: Our NYC @localuniv is over 3 months away, and we're already getting low on available tickets. I've had lots of people tell me they are planning on coming who have not yet bought a ticket. If that is you, please don't wait as I think they are going to sell out >",
            "Description": "None",
            "Link": "https://twitter.com/JoyanneHawkins/status/1796216105888895279"
        },
        {
            "Title": "Internal document leak sheds light on how Google Search works",
            "Description": "A leak of 2,500 pages worth of internal company documents from Google appears to give some insight into how Google Search ranks websites.",
            "Link": "https://nbcmontana.com/news/nation-world/internal-document-leak-how-google-search-works-algorithm-website-ranking-news-nonprofits-politicans-search-engine-optimization-experts-consultant-erfan-azimi"
        },
        {
            "Title": "Google confirmed search data ranking leak but urges caution seroundtable.com/google-confirm…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796191333708865810"
        },
        {
            "Title": "Google added site reputation and expire domain abuse to the spam reporting tool seroundtable.com/google-report-…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796188565732503629"
        },
        {
            "Title": "Google Search Console link report having issues? Many reporting declines in link counts, even zero links reported seroundtable.com/google-search-…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796187559015702723"
        },
        {
            "Title": "RT by @aleyda: I hate the fact that 'SEO' has become synonymous to 'Google SEO', without the most of us even realizing. There is so much more out there, beyond Google! That's why I decided to research the SERP features on Bing, Brave and DuckDuckGo. Have a read! ⬇️⬇️⬇️ linkedin.com/posts/nataliaw…",
            "Description": "None",
            "Link": "https://twitter.com/witczyk/status/1796185580050448890"
        },
        {
            "Title": "Google people also asked colored boxed-in design seroundtable.com/google-people-…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796183783995248925"
        },
        {
            "Title": "RT by @aleyda: A first look at the presence of AI Overviews by industry. We asked @seoClarity clients to send us keywords for which they were concerned about effect from AIO. The chart below is our initial findings from nearly 2000 keywords. Will be updating as this data grows!",
            "Description": "None",
            "Link": "https://twitter.com/marktraphagen/status/1796182097364742342"
        },
        {
            "Title": "Google Search \"early adopter\" badge seroundtable.com/google-early-a…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796180009679257698"
        },
        {
            "Title": "It's New - May 30 - Google confirms search leak, core update case study from @glenngabe , spam report and GSC links drop with @MordyOberstein @CrystalontheWeb @gregfinn youtube.com/watch?v=C_UwEr…",
            "Description": "None",
            "Link": "https://twitter.com/rustybrick/status/1796179807077544118"
        },
        {
            "Title": "A thoughtful analysis by @patrickstox on the interpretation of the leaks, assumptions of some of the most important topics, while doing it so with insights and in a professional / constructive way 👏 Also, I completely agree about SEOs shouldn’t be angry with the Google Search…",
            "Description": "None",
            "Link": "https://twitter.com/aleyda/status/1796177488055263518"
        },
        {
            "Title": "Google Maps adds wheelchair-accessible icon to business listings",
            "Description": "Google Maps adds wheelchair-accessible icon to business listings seroundtable.com/google-maps-wh…",
            "Link": "https://twitter.com/rustybrick/status/1796176234306847026"
        },
        {
            "Title": "Charts: Global Consumer Trends Q1 2024",
            "Description": "Per the recent PwC survey, climate concerns are among the top consumer priorities in early 2024.",
            "Link": "https://www.practicalecommerce.com/charts-global-consumer-trends"
        },
        {
            "Title": "Google Search Console link report may be broken today",
            "Description": "Many are noticing huge declines in the number of links reported in the link report within the Google tool.",
            "Link": "https://searchengineland.com/google-search-console-link-report-may-be-broken-today-442736"
        },
        {
            "Title": "Leaked Documents Reveal How Google Search Gatekeeps the Internet",
            "Description": "SEO experts say a massive leak of 14,000 ranking features exposes the blueprint for how Google secretly curates the Internet.",
            "Link": "https://gizmodo.com/google-search-seo-leak-reveal-gatekeeps-internet-1851508410"
        },
        {
            "Title": "RT by @aleyda: We forget there's more to the Search Experience than the Google Experience. Check out @witczyk's amazing article on alternative search experiences with Bing, DuckDuckGo & Brave Search 👉 buff.ly/3VlSYss #SEO #DigitalMarketing",
            "Description": "RT by @aleyda: We forget there's more to the Search Experience than the Google Experience. Check out @witczyk's amazing article on alternative search experiences with Bing, DuckDuckGo & Brave Search 👉 buff.ly/3VlSYss #SEO #DigitalMarketing",
            "Link": "https://twitter.com/awebranking/status/1796165375312179541"
        },
        {
            "Title": "6 guiding principles to leverage AI for SEO content production",
            "Description": "AI can be a helpful tool for search-driven content production, but without these guiding principles, you might not see results.",
            "Link": "https://searchengineland.com/ai-seo-content-production-guiding-principles-442684"
        },
        {
            "Title": "Shrinking amount of referral traffic -> Facebook's \"Widely Viewed Content Report\" Q4 2023: Hollywood Gossip Up, Referral Traffic Down \"The report also underlines the shrinking amount of referral traffic from Facebook, with 95.2% of the posts displayed in user feeds not…",
            "Description": "Shrinking amount of referral traffic -> Facebook's \"Widely Viewed Content Report\" Q4 2023: Hollywood Gossip Up, Referral Traffic Down \"The report also underlines the shrinking amount of referral traffic from Facebook, with 95.2% of the posts displayed in user feeds not…",
            "Link": "https://twitter.com/glenngabe/status/1796159819293847783"
        },
        {
            "Title": "Yep, massive decreases in the link reporting within GSC. Clearly a bug that I'm sure will be corrected. Just saw one site that lost 30M links in the past day or so (in the reporting)...",
            "Description": "Yep, massive decreases in the link reporting within GSC. Clearly a bug that I'm sure will be corrected. Just saw one site that lost 30M links in the past day or so (in the reporting)...",
            "Link": "https://twitter.com/glenngabe/status/1796156018528813233"
        },
        {
            "Title": "Interesting, Discover could change to \"Home\" and then another tab could arrive called \"Browse\". You can read more in the article -> androidpolice.com/google-app-ren…",
            "Description": "Interesting, Discover could change to \"Home\" and then another tab could arrive called \"Browse\". You can read more in the article -> androidpolice.com/google-app-ren…",
            "Link": "https://twitter.com/glenngabe/status/1796149932031615134"
        },
        {
            "Title": "RT by @aleyda: Google has confirmed the search data ranking leak but urges caution when making assumptions based on the details seroundtable.com/google-confirm…",
            "Description": "RT by @aleyda: Google has confirmed the search data ranking leak but urges caution when making assumptions based on the details seroundtable.com/google-confirm…",
            "Link": "https://twitter.com/rustybrick/status/1796147293542142040"
        },
        {
            "Title": "More OpenAI deals with publishers and includes links to relevant articles from each publisher. Also includes info about \"real-time discovery products focused on news\" -> The Atlantic and Vox Media sign multi-year licensing and product deals with OpenAI \"Both multi-year…",
            "Description": "More OpenAI deals with publishers and includes links to relevant articles from each publisher. Also includes info about \"real-time discovery products focused on news\" -> The Atlantic and Vox Media sign multi-year licensing and product deals with OpenAI \"Both multi-year…",
            "Link": "https://twitter.com/glenngabe/status/1796146739662966967"
        },
        {
            "Title": "Google Search algorithm documents have leaked. Here's what experts are saying.",
            "Description": "This is big.",
            "Link": "https://mashable.com/article/google-search-content-api-warehouse-seo-leak"
        },
        {
            "Title": "AI Search, Cookieless Ads Boost Content Marketing",
            "Description": "Content marketing is more than articles. Taking a broader view and using alternative content forms can overcome traffic losses.",
            "Link": "https://www.practicalecommerce.com/ai-search-cookieless-ads-boost-content-marketing"
        },
        {
            "Title": "RT by @aleyda: Quickly identify the most important (most used) modules from the #GoogleLeak. I've created this interactive visualization where you can see how they connect with each other. Check out the tool at the link below 👇",
            "Description": "RT by @aleyda: Quickly identify the most important (most used) modules from the #GoogleLeak. I've created this interactive visualization where you can see how they connect with each other. Check out the tool at the link below 👇",
            "Link": "https://twitter.com/natzir9/status/1796100824118018454"
        },
        {
            "Title": "Google Search's elusive search algorithm revealed in leaked documents? Yes, say SEO experts. Details here",
            "Description": "Google's secretive Search algorithm has come under scrutiny due to leaked internal documents which brought under question the company's transparency related to SEO and rankings. Google is yet to respond to questions, but did not confirm or deny the authenticity of the leaked information.",
            "Link": "https://www.livemint.com/companies/news/google-searchs-elusive-algorithm-likely-revealed-in-leaked-documents-yes-say-seo-experts-details-here-api-ranking-data-11717052976298.html"
        },
        {
            "Title": "It's interesting how the reaction to the Google leaks reminded me of my early times in the SEO industry when there were far more *unknowns* of how things worked, as well as testing/hypothesis/findings going on that people would share on social. The bad? How some would…",
            "Description": "It's interesting how the reaction to the Google leaks reminded me of my early times in the SEO industry when there were far more *unknowns* of how things worked, as well as testing/hypothesis/findings going on that people would share on social. The bad? How some would…",
            "Link": "https://twitter.com/aleyda/status/1796081201402253725"
        },
        {
            "Title": "How To Find Competitors' Keywords: Tips & Tools",
            "Description": "Discover how to find competitor keywords & gain a competitive edge in SEO. Outperform your competitors in SERPs with effective targeting.",
            "Link": "https://www.searchenginejournal.com/competitor-keywords-tips-tools-seranking-spa/516881/"
        },
        {
            "Title": "A year after a revamp by Epic Games, the Fortnite ecosystem is having its YouTube moment",
            "Description": "Over the past year, Epic’s updates to the Fortnite Creative ecosystem have sparked an influx of digital creators into the platform, who have brought with them both their communities and the marketing dollars of the brands looking to reach them.",
            "Link": "https://digiday.com/marketing/a-year-after-a-revamp-by-epic-games-fortnite-creative-is-having-its-youtube-moment/"
        },
        {
            "Title": "Media Briefing: Publishers' H1 pulse check on ad spend in digital media",
            "Description": "Publishers share which ad categories are up — or not — so far in 2024.",
            "Link": "https://digiday.com/media/media-briefing-publishers-h1-pulse-check-on-ad-spend-in-digital-media/"
        },
        {
            "Title": "Marketers take drastic measures as ad tech snafus erupt",
            "Description": "Plenty of marketers still don’t know — or care — how their money flows through ad tech.",
            "Link": "https://digiday.com/marketing/marketers-take-drastic-measures-as-ad-tech-snafus-erupt/"
        },
        {
            "Title": "A brand safety watchdog wants to galvanize ad tech vendors to save publishers from MFA classification",
            "Description": "IAS confirms participation in a Brand Safety Institute-led scheme to help publishers understand how MFA is flagged.",
            "Link": "https://digiday.com/media/a-brand-safety-watchdog-wants-to-galvanize-ad-tech-vendors-to-save-publishers-from-mfa-classification/"
        },
        {
            "Title": "Research Briefing: Publisher events and influencer partnerships offer key brand marketing opportunities",
            "Description": "In this edition of the Digiday+ Research Briefing, we examine how publisher-hosted events and influencer partnerships offer brands more key marketing opportunities, how The New Yorker refocused its newsletter strategy in the last year, and how digital media companies are exploring the fediverse, as seen in recent data from Digiday+ Research.",
            "Link": "https://digiday.com/marketing/research-briefing-publisher-events-and-influencer-partnerships-offer-key-brand-marketing-opportunities/"
        },
        {
            "Title": "Google answer to leak, is the one expected in these circumstances: “We would caution against making inaccurate assumptions about Search based on out-of-context, outdated, or incomplete information. We’ve shared extensive information about how Search works and the types of factors…",
            "Description": "A tweet from Alejda Solis relaying Google's response to the recent leak of search algorithm details. Google cautions against making assumptions based on the leaked information, stating it is out of context, outdated, or incomplete.",
            "Link": "https://twitter.com/aleyda/status/1795918448054137113"
        },
        {
            "Title": "Google won't provide specifics. Not shocking. :) You can check Barry's post for the official response from Google.",
            "Description": "Glenn Gabe tweets that Google won't be providing specifics about the recent leak of search algorithm details. He directs readers to Barry Schwartz's post for Google's official response.",
            "Link": "https://twitter.com/glenngabe/status/1795909901123756355"
        },
        {
            "Title": "The timing is still interesting considering AI overviews just launched then. :)",
            "Description": "Glenn Gabe points out the interesting timing of the Google leak, coinciding with the launch of AI overviews in search results.",
            "Link": "https://twitter.com/glenngabe/status/1795904853782204694"
        },
        {
            "Title": "Yep, quite a bit of traffic... I hope SER was ready for that. :)",
            "Description": "Glenn Gabe comments on the significant traffic driven to Barry Schwartz's site due to his coverage of the Google leak story.",
            "Link": "https://twitter.com/glenngabe/status/1795875840414331051"
        },
        {
            "Title": "How big was the Google leak story? Drudge Report has a link to Barry's coverage as the first link. I'm sure that's driving quite a bit of traffic. Wow. :)",
            "Description": "Glenn Gabe highlights the prominence of the Google leak story, noting that Drudge Report links to Barry Schwartz's coverage as the first link, indicating significant traffic.",
            "Link": "https://twitter.com/glenngabe/status/1795875151923523700"
        },
        {
            "Title": "If you're interested in the March core update, and the powerful tremors we have seen since it completed, then you should check out my latest case study. I cover a site that got hammered in the fall of 2023 by two core updates and the September HCU(X), addressed a big content…",
            "Description": "Glenn Gabe promotes his latest case study about the March 2024 Google core update and its impact on a specific website.",
            "Link": "https://twitter.com/glenngabe/status/1795862995110646043"
        },
        {
            "Title": "Two interesting patents: 1) The race to Jarvis continues -> Microsoft wants to patent a system for “spoken natural stylistic conversations” with large language models. Microsoft’s tech aims to give language models the capability to carry our natural, emotionally expressive voice…",
            "Description": "Glenn Gabe discusses two interesting patents, one of which involves Microsoft's efforts to develop a system for more natural and expressive conversations with large language models.",
            "Link": "https://twitter.com/glenngabe/status/1795861191157244364"
        },
        {
            "Title": "Interesting development for TikTok announced yesterday -> A US appeals court sets a fast-track schedule to consider legal challenges to the US law requiring a TikTok sale or ban, with oral arguments in September 2024 \"The U.S. Court of Appeals for the District of Columbia…",
            "Description": "Glenn Gabe shares news about a US appeals court setting a fast-track schedule to consider legal challenges to the law requiring a TikTok sale or ban.",
            "Link": "https://twitter.com/glenngabe/status/1795858607226957881"
        },
        {
            "Title": "Focus on advertising? Will be interesting to follow Netflix ads -> Who Needs YouTube? - Netflix Ads: The Video Ads Game Changer \"Netflix video ads are displayed across various devices. These include TV, mobile, desktop, and tablet, in formats such as Non-Skippable, Pre-roll, and…",
            "Description": "Glenn Gabe comments on Netflix's focus on advertising and the potential impact of Netflix ads on the video advertising landscape.",
            "Link": "https://twitter.com/glenngabe/status/1795857335560151167"
        },
        {
            "Title": "Microsoft will retire Bing Maps for Enterprise; will merge its tech and data with Azure Maps",
            "Description": "Microsoft announces the retirement of its Bing Maps for Enterprise service, with plans to merge its technology and data with Azure Maps.",
            "Link": "https://www.neowin.net/news/microsoft-will-retire-bing-maps-for-enterprise-will-merge-its-tech-and-data-with-azure-maps/"
        },
        {
            "Title": "EU chases Microsoft’s Bing over AI hallucinations, deepfakes",
            "Description": "The European Commission orders Microsoft to provide information on how its systems detect and prevent the spread of deepfakes and voter manipulation on Bing.",
            "Link": "https://coingeek.com/eu-chases-microsoft-bing-over-ai-hallucinations-deepfakes/"
        },
        {
            "Title": "Google seemingly leaked a treasure trove of technical search algorithm details by accident and now SEO people are getting real aggro",
            "Description": "PC Gamer reports on the leak of Google's search algorithm details and the reactions from the SEO community, with some claiming that Google has been dishonest about its practices.",
            "Link": "https://www.pcgamer.com/hardware/google-seemingly-leaked-a-treasure-trove-of-technical-search-algorithm-details-by-accident-and-now-seo-people-are-getting-real-aggro/"
        },
        {
            "Title": "You might need a pot of coffee for this one. :) I had to write this case study. It's been wild -> Google March 2024 Core Update Case Study: A tale of four tremors, reversals, and a great example of the counterbalancing of systems My post covers a site that was hit hard in the…",
            "Description": "Glenn Gabe announces his new case study about the Google March 2024 Core Update and its impact on a specific website.",
            "Link": "https://twitter.com/glenngabe/status/1795794454902657355"
        },
        {
            "Title": "Yep, I'm seeing this drop back down across sites. Very weird bug in GSC, and coincided with the rollout of AI overviews.",
            "Description": "Glenn Gabe observes a bug in Google Search Console that coincided with the rollout of AI overviews.",
            "Link": "https://twitter.com/glenngabe/status/1795791502402068927"
        },
        {
            "Title": "It's early, and AI overviews will change over time, but interesting to see some early data. And it really seems all over the place at this point. Remember, AI overviews don't show up for incognito searches (at least for now). So tracking overviews will be tough... And GSC doesn't…",
            "Description": "Glenn Gabe shares early observations about the rollout of AI overviews in Google Search, noting inconsistencies and challenges in tracking their impact.",
            "Link": "https://twitter.com/glenngabe/status/1795790861281660977"
        },
        {
            "Title": "Does Google's SEO stand for Scam Everyone Openly?",
            "Description": "Techzine questions Google's honesty regarding its SEO practices in light of leaked documents, suggesting that the company may not be transparent about its methods.",
            "Link": "https://www.techzine.eu/news/analytics/120453/does-googles-seo-stand-for-scam-everyone-openly/"
        },
        {
            "Title": "Navigating Google’s AI Changes to Search: Is SEO Dead?",
            "Description": "InformationWeek discusses the impact of Google's AI changes to search, particularly the emergence of AI Overview, and its implications for content, brand, and ad positioning on the web.",
            "Link": "https://www.informationweek.com/machine-learning-ai/navigating-google-s-ai-changes-to-search-is-seo-dead-"
        },
        {
            "Title": "WorԁPress SEO: Adapting to Changes in Search Engine Algorithms",
            "Description": "WorԁPress sites still rely heavily on Seаrсh Engine Oрtimizаtion (SEO) to thrive in the ever-сhаnging ԁigitаl mаrketing lаnԁsсарe.",
            "Link": "https://www.bbntimes.com/companies/wordpress-seo-adapting-to-changes-in-search-engine-algorithms"
        },
        {
            "Title": "HubSpot shares jump on talks of potential Google deal",
            "Description": "With a market cap of ~$33B, it would be Google's largest deal ever -&gt; HubSpot shares jump on talks of potential Google deal \"Its products would presumably fill a gap in helping Google provide marketing technology and customer relationship management tools to its customers,…",
            "Link": "https://twitter.com/glenngabe/status/1795785641847832625"
        },
        {
            "Title": "Google plans to shut down Google Business Profile chat",
            "Description": "Saw this email yesterday -&gt; Google plans to shut down Google Business Profile chat, which let customers reach out to businesses in Maps and Search via text chat, on July 31, 2024 “We are reaching out to share that we will be winding down Google’s chat and call history features…",
            "Link": "https://twitter.com/glenngabe/status/1795784660171030905"
        },
        {
            "Title": "Google Search Working To Surface Site In Search Results When Site Name Is Mentioned",
            "Description": "There have been a number of complaints that when you search for a query and the site name, Google doesn't always show results from the site you mentioned in the query. But Google's Search Liaison, Danny Sullivan, said the Google Search team is working on adjusting that so the site mentioned in the query is surfaced higher in the search results.",
            "Link": "https://www.seroundtable.com/google-search-site-name-query-37467.html"
        },
        {
            "Title": "Google Ads Now Being Mixed In With Organic Results",
            "Description": "Google has been discreetly mixing ads within organic results for almost a year, recently making it official with a documentation update.",
            "Link": "https://www.searchenginejournal.com/google-ads-now-being-mixed-in-with-organic-results/516940/"
        },
        {
            "Title": "Search Central Live is coming to APAC starting with Jakarta on Jul 25!",
            "Description": "Search Central Live is coming to APAC starting with Jakarta on Jul 25! 🇮🇩 Join us as a participant or even as a lightning talk speaker. Not in Indonesia? We have other APAC countries in planning! 🤩 More→ goo.gle/3Vgsf0a",
            "Link": "https://twitter.com/googlesearchc/status/1795716513204240714"
        },
        {
            "Title": "Making The Web More Sustainable: The SEO Survey",
            "Description": "Explore the industry’s opinion on digital sustainability and learn how SEO can drive positive environmental change. Click to find out more…",
            "Link": "https://www.elixirrdigital.com/2024/05/29/making-the-web-more-sustainable-the-seo-survey/"
        },
        {
            "Title": "AIO Impact for Product Queries",
            "Description": "🚨 AIO Impact for Product Queries: Although still early, for product related queries for which the site is ranking in traditional SERPs in top positions already, I'm consistently finding a trend that: * When AIO is shown and the site is included in it = traffic growth (higher…",
            "Link": "https://twitter.com/aleyda/status/1795706678861562005"
        },
        {
            "Title": "Browse and filter easily the Google 14K ranking features leaked from Google Search’s Content Warehouse API",
            "Description": "Browse and filter easily the Google 14K ranking features leaked from Google Search’s Content Warehouse API (made available by @randfish & @iPullRank) in this searchable list configured by @Dixon_Jones 👀👇 dixonjones.com/google-ranking…",
            "Link": "https://twitter.com/aleyda/status/1795701648683413993"
        },
        {
            "Title": "Internal documents about Google's search algorithm leaked, revealing Google's lies, such as using Chrome data for page ranking",
            "Description": "The news blog specialized in Japanese culture, odd news, gadgets and all other funny stuffs. Updated everyday.",
            "Link": "http://gigazine.net/gsc_news/en/20240529-google-internal-documents-api-content-warehouse/"
        },
        {
            "Title": "Future of TV Briefing: How TV and streaming companies’ advertising businesses fared in Q1 2024",
            "Description": "This week’s Future of TV Briefing looks at what TV and streaming companies’ latest quarterly earnings reports indicate about the state of the TV and streaming ad business.",
            "Link": "https://digiday.com/future-of-tv/future-of-tv-briefing-how-tv-and-streaming-companies-advertising-businesses-fared-in-q1-2024/"
        },
        {
            "Title": "As X's turbulence continues, can alternative social platforms catch marketers' attention?",
            "Description": "Marketers weren’t sold on X/Twitter's competitors. But as turbulence continues, can they be convinced?",
            "Link": "https://digiday.com/marketing/as-xs-turbulence-continues-can-alternative-social-platforms-catch-marketers-attention/"
        },
        {
            "Title": "Rival cinema ad firms collaborate to make their data streams easier for media agencies to access",
            "Description": "National CineMedia and Screenvision partnered with mobile and location tech firm The People Platform to integrate their joint cinema audience data into Nielsen’s Respondent Level Data (RLD) feed for the first time.",
            "Link": "https://digiday.com/media-buying/cinema-ad-firms-make-their-data-streams-easier-for-media-agencies-to-access/"
        },
        {
            "Title": "From SGE patent it seems that an answer is generated first then it looks for citations.",
            "Description": "From SGE patent it seems that an answer is generated first then it looks for citations. Unlike other systems like Perplexity which fetch the content of like URLs and generate the summary. This seems to answer the question which people have noticed with AI Overviews linking to…",
            "Link": "https://twitter.com/gaganghotra_/status/1795654988687188294"
        },
        {
            "Title": "How SEO moves forward with the Google Content Warehouse API leak",
            "Description": "Addressing common questions, critiques and concerns following the massive Google Search leak and how your approach to SEO should change.",
            "Link": "https://searchengineland.com/how-seo-moves-forward-google-leak-442749"
        }
    ],
    "reviewed_urls": [
        "https://medium.com/@sleepyemo220/rask-ais-seo-optimization-a-comprehensive-guide-for-marketing-agencies-0b601785d1a9",
        "https://www.krqe.com/new-mexico-living/bing-tea-is-a-business-born-out-of-a-love-of-boba/",
        "https://twitter.com/aleyda/status/1796642014361948210",
        "https://twitter.com/rustybrick/status/1796617894559674540",
        "https://twitter.com/rustybrick/status/1796614119488921814",
        "https://twitter.com/aleyda/status/1796612712832618764",
        "https://twitter.com/rustybrick/status/1796610344682684426",
        "https://twitter.com/rustybrick/status/1796606569783919086",
        "https://twitter.com/aleyda/status/1796603708878324056",
        "https://twitter.com/aleyda/status/1796603063156830428",
        "https://twitter.com/rustybrick/status/1796602795220726060",
        "https://boingboing.net/2024/05/31/whats-in-the-leak-of-googles-internal-search-documents.html",
        "https://twitter.com/rustybrick/status/1796599019986211125",
        "https://twitter.com/rustybrick/status/1796595245238583712",
        "https://www.asiaone.com/business/seotoolboxio-introduces-new-seo-tool-powered-ai-shows-website-owners-how-rank-higher",
        "https://www.einnews.com/pr_news/716239540/digitech-web-design-austin-pioneering-advanced-seo-technologies-for-the-future",
        "https://twitter.com/glenngabe/status/1796588054456525040",
        "https://twitter.com/aleyda/status/1796586101127496016",
        "https://twitter.com/glenngabe/status/1796585212350005463",
        "https://twitter.com/aleyda/status/1796583990058746076",
        "https://twitter.com/rustybrick/status/1796574212049539121",
        "https://bigeasymagazine.com/2024/05/31/seo-companies-in-ny-and-their-role-in-community-engagement/",
        "https://twitter.com/searchliaison/status/1796570551936512034",
        "https://twitter.com/searchliaison/status/1796570551936512034",
        "https://twitter.com/rustybrick/status/1796568330272112897",
        "https://twitter.com/rustybrick/status/1796557497022697965",
        "https://www.techradar.com/computing/search-engines/google-news-went-down-and-i-tried-bing-news-i-might-never-go-back",
        "https://twitter.com/rustybrick/status/1796553721695908176",
        "https://www.theverge.com/2024/5/31/24167119/google-search-algorithm-documents-leak-seo-chrome-clicks",
        "https://twitter.com/searchliaison/status/1796552935067001206",
        "https://twitter.com/searchliaison/status/1796552935067001206",
        "https://twitter.com/rustybrick/status/1796549947015516209",
        "https://twitter.com/rustybrick/status/1796546171961307281",
        "https://twitter.com/rustybrick/status/1796542397217898940",
        "https://twitter.com/rustybrick/status/1796540734985863634",
        "https://twitter.com/searchliaison/status/1796540379187351794",
        "https://twitter.com/searchliaison/status/1796540379187351794",
        "https://twitter.com/rustybrick/status/1796538622121766950",
        "https://twitter.com/rustybrick/status/1796536613817975066",
        "https://twitter.com/rustybrick/status/1796534847394942989",
        "https://www.practicalecommerce.com/retailer-2bigfeet-shifts-to-dtc",
        "https://twitter.com/rustybrick/status/1796532778286391438",
        "https://twitter.com/rustybrick/status/1796529307709591887",
        "https://www.searchenginejournal.com/google-to-limit-ai-overviews-for-nonsensical-queries/518063/",
        "https://twitter.com/glenngabe/status/1796525836985585760",
        "https://twitter.com/rustybrick/status/1796525197622681640",
        "https://twitter.com/aleyda/status/1796524259461787676",
        "https://twitter.com/glenngabe/status/1796523601593851905",
        "https://twitter.com/aleyda/status/1796521306680377544",
        "https://twitter.com/glenngabe/status/1796521141873623361",
        "https://twitter.com/rustybrick/status/1796520410802262018",
        "https://twitter.com/glenngabe/status/1796519787536830592",
        "https://www.analyticsinsight.net/artificial-intelligence/bing-ai-image-generator-a-detailed-review",
        "https://twitter.com/glenngabe/status/1796518441261621589",
        "https://twitter.com/rustybrick/status/1796515423028125953",
        "https://twitter.com/glenngabe/status/1796514597803085827",
        "https://twitter.com/JudithLewis/status/1796513356746281235",
        "https://twitter.com/rustybrick/status/1796512291506036849",
        "https://twitter.com/glenngabe/status/1796511730052247878",
        "https://twitter.com/glenngabe/status/1796510083339129076",
        "https://www.openpr.com/news/3517447/from-bigcommerce-multi-storefront-setup-to-seo-services",
        "https://twitter.com/rustybrick/status/1796509681415803128",
        "https://twitter.com/glenngabe/status/1796509041889325514",
        "https://twitter.com/rustybrick/status/1796507164762099980",
        "https://twitter.com/rustybrick/status/1796504648498483560",
        "https://twitter.com/rustybrick/status/1796502131824029868",
        "https://twitter.com/rustybrick/status/1796499615187177844",
        "https://twitter.com/rustybrick/status/1796496848590426197",
        "https://twitter.com/aleyda/status/1796492854816379007",
        "https://www.businessinsider.com/google-search-documents-seo-leak-ranking-2024-5",
        "https://qz.com/emails/daily-brief/1851510817/google-seo-leak-mcdonald-inflation-donald-trump-guilty",
        "https://twitter.com/randfish/status/1796457746193322108",
        "https://techeconomy.ng/startup-survival-guide-essential-seo-strategies-for-new-businesses/",
        "https://www.whatech.com/og/markets-research/industrial/834139-future-proofing-growth-of-corporate-search-engine-optimization-tools-market-size-analytical-overview-growth-factors-demand-and-trends-forecast-to-2031-moz-semrush-ahrefs-google-search-console-screaming-frog",
        "https://slator.com/event/dual-power-how-to-leverage-google-ads-and-seo-for-total-maximum-impact/",
        "https://twitter.com/aleyda/status/1796420340773499079",
        "https://twitter.com/aleyda/status/1796409934663295368",
        "https://digiday.com/media/wtf-is-app-sprawl-and-how-does-hr-get-organized/",
        "https://digiday.com/media-buying/fullthrottle-ai-creates-audience-planner-tool-using-an-ai-assistant/",
        "https://digiday.com/marketing/how-klarna-is-using-ai-for-cost-savings-changing-extremely-frustrating-creative-processes/",
        "https://digiday.com/media/digiday-research-publishers-continue-to-rely-on-programmatic-revenue-despite-recent-issues/",
        "https://digiday.com/marketing/shrinking-budgets-leaves-programmatic-marketers-with-a-raw-deal/",
        "https://pucksandpitchforks.com/posts/jack-hughes-still-gets-love-for-lady-bing-trophy-but-two-other-devils-do-better",
        "https://www.therolladailynews.com/analyzing-the-impact-of-mobile-optimization-on-shopify-seo-after-google-updates/",
        "https://twitter.com/glenngabe/status/1796346815690006999",
        "https://twitter.com/rustybrick/status/1796342296402944223",
        "https://twitter.com/rustybrick/status/1796340986278244673",
        "https://www.01net.com/en/seo/tools/surfer-seo/",
        "https://twitter.com/facan/status/1796310182546522553",
        "https://twitter.com/rustybrick/status/1796298992168615994",
        "https://finance.yahoo.com/video/google-still-dominates-ai-search-213358825.html",
        "https://twitter.com/CyrusShepard/status/1796256862402396260",
        "https://www.techtimes.com/articles/305182/20240530/seo-experts-leaked-documents-expose-google-lying-search-algorithm.htm",
        "https://twitter.com/rustybrick/status/1796251731581403464",
        "https://twitter.com/rustybrick/status/1796248711854539040",
        "https://twitter.com/rustybrick/status/1796247956854567131",
        "https://twitter.com/rustybrick/status/1796244181985440194",
        "https://twitter.com/iPullRank/status/1796240565912162461",
        "https://twitter.com/rustybrick/status/1796240407363469367",
        "https://twitter.com/sengineland/status/1796238601526648877",
        "https://twitter.com/rustybrick/status/1796236632221172167",
        "https://www.techloy.com/how-to-use-x-formerly-twitter-for-seo/",
        "https://twitter.com/rustybrick/status/1796232857473663080",
        "https://qz.com/leaked-google-documents-about-its-search-engine-data-an-1851509445",
        "https://twitter.com/glenngabe/status/1796223727186702403",
        "https://twitter.com/glenngabe/status/1796220795250724920",
        "https://twitter.com/glenngabe/status/1796219005352526239",
        "https://twitter.com/aleyda/status/1796216508563050681",
        "https://twitter.com/JoyanneHawkins/status/1796216105888895279",
        "https://nbcmontana.com/news/nation-world/internal-document-leak-how-google-search-works-algorithm-website-ranking-news-nonprofits-politicans-search-engine-optimization-experts-consultant-erfan-azimi",
        "https://www.openpr.com/news/3519643/a-comprehensive-digital-marketing-services-company-hire-seo",
        "https://twitter.com/rustybrick/status/1796191333708865810",
        "https://twitter.com/rustybrick/status/1796188565732503629",
        "https://twitter.com/rustybrick/status/1796187559015702723",
        "https://twitter.com/witczyk/status/1796185580050448890",
        "https://twitter.com/rustybrick/status/1796183783995248925",
        "https://twitter.com/marktraphagen/status/1796182097364742342",
        "https://twitter.com/rustybrick/status/1796180009679257698",
        "https://twitter.com/rustybrick/status/1796179807077544118",
        "https://twitter.com/aleyda/status/1796177488055263518",
        "https://twitter.com/rustybrick/status/1796176234306847026",
        "https://www.practicalecommerce.com/charts-global-consumer-trends",
        "https://searchengineland.com/google-search-console-link-report-may-be-broken-today-442736",
        "https://twitter.com/rustybrick/status/1796172459420614910",
        "https://gizmodo.com/google-search-seo-leak-reveal-gatekeeps-internet-1851508410",
        "https://twitter.com/awebranking/status/1796165375312179541",
        "https://searchengineland.com/ai-seo-content-production-guiding-principles-442684",
        "https://twitter.com/glenngabe/status/1796159819293847783",
        "https://twitter.com/glenngabe/status/1796156018528813233",
        "https://twitter.com/glenngabe/status/1796154547825418311",
        "https://twitter.com/glenngabe/status/1796149932031615134",
        "https://twitter.com/glenngabe/status/1796148710860009522",
        "https://twitter.com/rustybrick/status/1796147293542142040",
        "https://twitter.com/glenngabe/status/1796146739662966967",
        "https://mashable.com/article/google-search-content-api-warehouse-seo-leak",
        "https://www.practicalecommerce.com/ai-search-cookieless-ads-boost-content-marketing",
        "https://twitter.com/natzir9/status/1796100824118018454",
        "https://www.livemint.com/companies/news/google-searchs-elusive-algorithm-likely-revealed-in-leaked-documents-yes-say-seo-experts-details-here-api-ranking-data-11717052976298.html",
        "https://www.simplilearn.com/future-of-seo-article",
        "https://twitter.com/aleyda/status/1796081201402253725",
        "https://www.searchenginejournal.com/competitor-keywords-tips-tools-seranking-spa/516881/",
        "https://twitter.com/fabiojcortes/status/1796034746415255734",
        "https://digiday.com/marketing/a-year-after-a-revamp-by-epic-games-fortnite-creative-is-having-its-youtube-moment/",
        "https://digiday.com/media/media-briefing-publishers-h1-pulse-check-on-ad-spend-in-digital-media/",
        "https://digiday.com/marketing/why-crypto-exchange-okx-is-choosing-an-f1-sponsorship-over-a-traditional-media-mix/",
        "https://digiday.com/podcasts/microsofts-top-ai-tips-for-managers-the-return-podcast-season-3-episode-6/",
        "https://digiday.com/marketing/marketers-take-drastic-measures-as-ad-tech-snafus-erupt/",
        "https://digiday.com/media/a-brand-safety-watchdog-wants-to-galvanize-ad-tech-vendors-to-save-publishers-from-mfa-classification/",
        "https://digiday.com/marketing/research-briefing-publisher-events-and-influencer-partnerships-offer-key-brand-marketing-opportunities/",
        "https://finance.yahoo.com/news/yourseoboard-unveils-innovative-white-label-034600971.html",
        "https://www.spokesman.com/stories/2024/may/30/guitar-shreds-and-buckethead-coming-to-the-bing/",
        "https://bmmagazine.co.uk/business/enhancing-your-manufacturing-businesss-online-reputation-with-seo/",
        "https://twitter.com/aleyda/status/1795918448054137113",
        "https://twitter.com/glenngabe/status/1795909901123756355",
        "https://twitter.com/glenngabe/status/1795904853782204694",
        "https://www.searchenginepeople.com/city/seo-edmonton",
        "https://twitter.com/aleyda/status/1795889524150587398",
        "https://twitter.com/aleyda/status/1795888648853848323",
        "https://www.einnews.com/pr_news/715603989/the-role-of-local-seo-in-web-advertising-for-new-orleans-companies",
        "https://twitter.com/glenngabe/status/1795875840414331051",
        "https://twitter.com/glenngabe/status/1795875151923523700",
        "https://twitter.com/glenngabe/status/1795862995110646043",
        "https://twitter.com/glenngabe/status/1795861191157244364",
        "https://twitter.com/glenngabe/status/1795858607226957881",
        "https://twitter.com/glenngabe/status/1795857335560151167",
        "https://www.searchenginejournal.com/webinar-lp-2024-trend-updates-what-really-works-in-seo-content-marketing/",
        "https://www.neowin.net/news/microsoft-will-retire-bing-maps-for-enterprise-will-merge-its-tech-and-data-with-azure-maps/",
        "https://www.prolificnorth.co.uk/news/ai-healthtech-tortus-appoints-the-seo-works/",
        "https://www.cmswire.com/digital-experience/yet-another-case-for-composable-content-ai-powered-search/",
        "https://coingeek.com/eu-chases-microsoft-bing-over-ai-hallucinations-deepfakes/",
        "https://twitter.com/natzir9/status/1795831584614138334",
        "https://twitter.com/cyberandy/status/1795822338052878396",
        "https://www.pcgamer.com/hardware/google-seemingly-leaked-a-treasure-trove-of-technical-search-algorithm-details-by-accident-and-now-seo-people-are-getting-real-aggro/",
        "https://www.yardbarker.com/entertainment/articles/the_20_funniest_chandler_bing_moments_on_friends/s1__39492887",
        "https://twitter.com/glenngabe/status/1795794454902657355",
        "https://twitter.com/glenngabe/status/1795791502402068927",
        "https://twitter.com/glenngabe/status/1795790861281660977",
        "https://www.techzine.eu/news/analytics/120453/does-googles-seo-stand-for-scam-everyone-openly/",
        "https://www.marketingprofs.com/articles/2024/51307/keeping-pace-how-agile-content-marketing-wins-in-a-fast-changing-digital-world",
        "https://www.informationweek.com/machine-learning-ai/navigating-google-s-ai-changes-to-search-is-seo-dead-",
        "https://www.bbntimes.com/companies/wordpress-seo-adapting-to-changes-in-search-engine-algorithms",
        "https://twitter.com/glenngabe/status/1795785641847832625",
        "https://twitter.com/glenngabe/status/1795784660171030905",
        "https://www.seroundtable.com/google-search-site-name-query-37467.html",
        "https://www.zdnet.com/article/chatgpt-vs-copilot/",
        "https://www.searchenginejournal.com/google-ads-now-being-mixed-in-with-organic-results/516940/",
        "https://www.practicalecommerce.com/new-ecommerce-tools-may-29-2024",
        "https://twitter.com/googlesearchc/status/1795716513204240714",
        "https://twitter.com/aleyda/status/1795712549163544587",
        "https://twitter.com/aleyda/status/1795710021852176606",
        "https://www.elixirrdigital.com/2024/05/29/making-the-web-more-sustainable-the-seo-survey/",
        "https://twitter.com/aleyda/status/1795706678861562005",
        "https://twitter.com/aleyda/status/1795701648683413993",
        "https://twitter.com/aleyda/status/1795693477650682230",
        "http://gigazine.net/gsc_news/en/20240529-google-internal-documents-api-content-warehouse/",
        "https://digiday.com/future-of-tv/future-of-tv-briefing-how-tv-and-streaming-companies-advertising-businesses-fared-in-q1-2024/",
        "https://digiday.com/marketing/as-xs-turbulence-continues-can-alternative-social-platforms-catch-marketers-attention/",
        "https://digiday.com/marketing/10-years-with-esports-org-team-liquid-a-conversation-with-juan-hungrybox-debiedma/",
        "https://digiday.com/media/how-times-collectible-covers-make-the-case-for-a-print-comeback/",
        "https://digiday.com/media-buying/cinema-ad-firms-make-their-data-streams-easier-for-media-agencies-to-access/",
        "https://twitter.com/gaganghotra_/status/1795654988687188294",
        "https://searchengineland.com/how-seo-moves-forward-google-leak-442749"
    ]
}