{
    "data": [
        {
            "Title": "Google Completes August 2024 Core Update",
            "Category": "Search Engine Optimization",
            "Description": "Google's August 2024 core update is complete, and few websites saw full recoveries. Some experienced small recoveries, but most saw no change or even further declines. The update's impact is analyzed with volatility charts and insights from the SEO community. The update took 19 days to rollout and was a pretty impactful update.",
            "Links": [
                "https://twitter.com/rustybrick/status/1831298916601462817",
                "https://www.seroundtable.com/google-august-2024-core-update-done-38013.html",
                "https://www.searchenginejournal.com/googles-august-core-update-rollout-completed/526070/"
            ]
        },
        {
            "Title": "Google Search Updates",
            "Category": "Search Engine Optimization",
            "Description": "Google has updated its image search with a \"from this image\" refinement feature.",
            "Links": [
                "https://twitter.com/rustybrick/status/1831327857294848185",
                "https://twitter.com/glenngabe/status/1831299961712955489",
                "https://twitter.com/rustybrick/status/1831661304966455549"
            ]
        },
        {
            "Title": "Snapchat Expands Ad Opportunities with Sponsored Snaps",
            "Category": "Social Media Marketing",
            "Description": "Snapchat is adding sponsored snaps to its platform, expanding its advertising opportunities. The sponsored snaps will appear in the chat inbox as a new snap without a push notification, and opening the message is optional.",
            "Links": [
                "https://twitter.com/glenngabe/status/1831308364808171933"
            ]
        },
        {
            "Title": "Google's Handling of Canonical Tags",
            "Category": "Search Engine Optimization",
            "Description": "A recent test revealed that Google might completely ignore canonical tags in certain situations. This finding, based on a Google documentation update, highlights the importance of careful canonical tag implementation. Google updates its canonical documentation to say \"Don't specify a fragment URL as canonical, as Google generally doesn't support fragment URLs.\"",
            "Links": [
                "https://twitter.com/glenngabe/status/1831303451290034345",
                "https://twitter.com/rustybrick/status/1831296400090391003"
            ]
        },
        {
            "Title": "SEO Poisoning and VPN Spoofing Used to Spread WikiLoader Malware",
            "Category": "Cybersecurity",
            "Description": "Palo Alto saw its VPN tool being spoofed to spread malware",
            "Links": [
                "https://www.techradar.com/pro/vpn/seo-poisoning-and-vpn-spoofing-used-to-target-anything-and-everything-with-wikiloader-malware"
            ]
        },
        {
            "Title": "The Impact of AI on SEO and Law Firm Marketing",
            "Category": "Artificial Intelligence",
            "Description": "With the emergence of Artificial Intelligence (AI) technology, many business owners have feared that marketing as we know it is coming to an end. After all, Google Gemini is routinely surfacing AI-generated responses over organic search results, AI content is abundant, and AI-driven tools are being used more than ever to automate tasks previously performed by human marketers.",
            "Links": [
                "https://natlawreview.com/article/seo-dead-why-ai-isnt-end-law-firm-marketing"
            ]
        },
        {
            "Title": "The Future of Search and Information Retrieval in the Age of AI",
            "Category": "Artificial Intelligence",
            "Description": "A deep dive into how AI is disrupting search engines and its impact on SEO, digital marketing and the future of information access.",
            "Links": [
                "https://searchengineland.com/will-chatgpt-be-the-new-google-446223"
            ]
        }
    ],
    "date": "2024-09-05"
}