{
    "data": [
        {
            "Title": "Google Search Console Reports: Numbers Reflect Sitelinks, Not Canonicalization",
            "Category": "SEO",
            "Description": "Google clarifies that the numbers in Google Search Console reports are related to Google Sitelinks, not canonicalization. This clarification addresses confusion about the use of \"#\" in these reports.",
            "Links": [
                "https://twitter.com/rustybrick/status/1803137101057110187",
                "https://twitter.com/rustybrick/status/1803076703226401178",
                "https://twitter.com/rustybrick/status/1803032662929490078"
            ]
        },
        {
            "Title": "Google Ads Credit Card Billing Changes: No Specific Thresholds",
            "Category": "Advertising",
            "Description": "Google announces changes to its credit card billing system for Google Ads, stating that there are no \"specific thresholds\" for the change. The move aims to reduce credit card processing fees for Google.",
            "Links": [
                "https://twitter.com/rustybrick/status/1803136118755307531",
                "https://twitter.com/rustybrick/status/1802667758523494791"
            ]
        },
        {
            "Title": "Google Maps Enhances Business Profile Management with New \"Edit\" and \"Post\" Buttons",
            "Category": "Local Search",
            "Description": "Google Maps introduces new \"edit\" and \"post\" buttons for Business Profile listings, providing businesses with easier access to update their information and engage with customers directly on the platform.",
            "Links": [
                "https://twitter.com/rustybrick/status/1803133326263476316",
                "https://twitter.com/rustybrick/status/1803072928336249283",
                "https://twitter.com/rustybrick/status/1803030146359705842"
            ]
        },
        {
            "Title": "Google Search Profiles Get New Privacy Toggle",
            "Category": "Privacy",
            "Description": "Google rolls out a new privacy toggle for Google Search Profiles, giving users more control over the data associated with their search activity and personalized results.",
            "Links": [
                "https://twitter.com/rustybrick/status/1803130748192399442"
            ]
        },
        {
            "Title": "Google Search Results Don't Always Highlight Original Source of Content",
            "Category": "SEO",
            "Description": "John Mueller, Google Search Advocate, confirms that Google's search results may not always display the original source of content. This revelation raises concerns about content attribution and potential for plagiarism.",
            "Links": [
                "https://twitter.com/rustybrick/status/1803129551272436114",
                "https://twitter.com/rustybrick/status/1803069153592451126",
                "https://www.seroundtable.com/google-search-results-original-source-37577.html"
            ]
        },
        {
            "Title": "Bing Webmaster Tools Can Display CTR Higher Than 100%",
            "Category": "SEO",
            "Description": "Bing Webmaster Tools users observe CTR exceeding 100%, prompting an explanation from Bing. The anomaly occurs when searchers click multiple times on the same search result, inflating the CTR calculation.",
            "Links": [
                "https://twitter.com/rustybrick/status/1803125776839221376",
                "https://twitter.com/rustybrick/status/1803065378966274224",
                "https://twitter.com/rustybrick/status/1803025113064865929"
            ]
        },
        {
            "Title": "Google Search Volatility Impacts Finance Sites with Surges and Drops",
            "Category": "SEO",
            "Description": "Glenn Gabe observes significant volatility in Google Search results for finance sites, with some experiencing large drops followed by surges. The fluctuations suggest ongoing algorithm updates and adjustments by Google.",
            "Links": [
                "https://twitter.com/glenngabe/status/1803123372093485194",
                "https://twitter.com/glenngabe/status/1803047239864013104"
            ]
        },
        {
            "Title": "Google Experiments with Black Sitelinks in Search Results",
            "Category": "SEO",
            "Description": "Google is testing black sitelinks in its search results, deviating from the traditional blue color. The visual change aims to improve the readability and user experience of search result snippets.",
            "Links": [
                "https://twitter.com/rustybrick/status/1803122001722409423",
                "https://twitter.com/rustybrick/status/1803061603488891085",
                "https://twitter.com/rustybrick/status/1803022596587638848"
            ]
        },
        {
            "Title": "Case Study: How Recent Google Updates Affect Good SEO Practices",
            "Category": "SEO",
            "Description": "A new case study examines the impact of recent Google algorithm updates on websites implementing good SEO practices. The study analyzes factors like page update frequency, schema usage, anchor text, and page titles to understand the effects of these updates.",
            "Links": [
                "https://twitter.com/CyrusShepard/status/1803118579333857675"
            ]
        },
        {
            "Title": "Genspark Emerges as Latest AI-Powered Search Engine Contender",
            "Category": "Artificial Intelligence",
            "Description": "Genspark joins the growing field of AI-powered search engines, utilizing multiple specialized AI models to handle different query types. The platform's \"Sparkpages\" aim to provide comprehensive and informative search results.",
            "Links": [
                "https://twitter.com/glenngabe/status/1803108858828603739"
            ]
        },
        {
            "Title": "Google's Display & Video 360 API Receives Two New Updates",
            "Category": "Advertising",
            "Description": "Google updates its Display & Video 360 API, adding features for managing advertiser-level keyword targeting and an optimization objective field for insertion orders. These enhancements provide advertisers with more granular control over their campaigns.",
            "Links": [
                "https://searchengineland.com/google-display-video-360-api-updates-443306"
            ]
        },
        {
            "Title": "Daily Mail to Launch a Dozen YouTube Shows in 2024",
            "Category": "Media",
            "Description": "Daily Mail plans to expand its presence on YouTube with the launch of twelve new shows by the end of 2024. This move signifies the publication's commitment to long-form video content and reaching a wider audience.",
            "Links": [
                "https://digiday.com/media/daily-mail-plans-to-debut-a-dozen-youtube-shows-in-2024-in-long-form-video-push/"
            ]
        },
        {
            "Title": "Reddit Launches Updated Conversation Ads with Larger Media Placements",
            "Category": "Advertising",
            "Description": "Reddit introduces updated Conversation Ads, featuring larger media placements within the discussion element of Reddit posts. The enhanced ad format aims to improve visibility and engagement for advertisers.",
            "Links": [
                "https://twitter.com/glenngabe/status/1803041480489005089"
            ]
        },
        {
            "Title": "Google Discover Tests Bottom Search Bar in In-App Browser",
            "Category": "Search",
            "Description": "Google Discover is experimenting with a bottom search bar in its in-app browser, potentially encouraging more queries and changing the search experience within the app.",
            "Links": [
                "https://twitter.com/glenngabe/status/1803034480938017111"
            ]
        },
        {
            "Title": "Google Gemini Expands to Android in India, iOS Rollout to Follow",
            "Category": "Artificial Intelligence",
            "Description": "Google launches its Gemini app for Android devices in India, supporting English and nine other languages. The app, powered by Google's most capable AI model, will soon be available for iOS devices.",
            "Links": [
                "https://twitter.com/glenngabe/status/1803030777602376178"
            ]
        },
        {
            "Title": "Apple Updates Applebot Documentation with New Features and User Agents",
            "Category": "SEO",
            "Description": "Apple updates its Applebot documentation, introducing new features like Applebot-Extended, Reverse DNS lookups, and additional user agents. The updates provide more clarity and control for website owners regarding Applebot's crawling and indexing behavior.",
            "Links": [
                "https://twitter.com/rustybrick/status/1802706765546430513",
                "https://twitter.com/rustybrick/status/1802665242247512506"
            ]
        },
        {
            "Title": "Google Updates Maps Contributor Policy on Fake Engagement",
            "Category": "Local Search",
            "Description": "Google revises its policy for Google Maps contributors, specifically addressing \"fake engagement.\" The updated guidelines aim to maintain the authenticity and reliability of user-generated content on Google Maps.",
            "Links": [
                "https://twitter.com/rustybrick/status/1802702991075561489",
                "https://twitter.com/rustybrick/status/1802662725266329902"
            ]
        }
    ],
    "date": "2024-06-19"
}