{
    "data": [
        {
            "Title": "Google to Release Core Algorithm Update in Coming Weeks",
            "Category": "Search",
            "Description": "Google has announced that their next core update is expected to roll out in the coming weeks. This update is expected to have a significant impact on search rankings.",
            "Links": [
                "https://twitter.com/rustybrick/status/1813287736356577746"
            ]
        },
        {
            "Title": "Google Search Experiencing High Ranking Volatility",
            "Category": "Search",
            "Description": "Commentary on the volatility of Google Search rankings, noting that it is \"still pretty heated.\"",
            "Links": [
                "https://twitter.com/rustybrick/status/1814274236753514801",
                "https://twitter.com/rustybrick/status/1814008737277087809",
                "https://twitter.com/rustybrick/status/1813948339387236598",
                "https://twitter.com/rustybrick/status/1813904299182928114"
            ]
        },
        {
            "Title": "Google Search Console Notes Being Retired",
            "Category": "Search",
            "Description": "Google updates their documentation to alert users of their final chance to download their Notes on Search data",
            "Links": [
                "https://twitter.com/glenngabe/status/1813993617813307739",
                "https://www.searchenginejournal.com/google-notes-search-data/522584/"
            ]
        },
        {
            "Title": "Google Testing AI-Powered \"Overviews\" Feature in Search",
            "Category": "Search",
            "Description": "Google is testing AI Overviews on Workspace accounts (also in the UK)",
            "Links": [
                "https://twitter.com/rustybrick/status/1814004962734842006",
                "https://twitter.com/rustybrick/status/1813944565071753697",
                "https://twitter.com/rustybrick/status/1813901782596325651"
            ]
        },
        {
            "Title": "Google Merchant Center Next Rolling Out to All Merchants",
            "Category": "Advertising",
            "Description": "Google Merchant Center Next now supports supplemental feeds, providing advertisers with a more efficient method to update product data. This enhancement streamlines inventory management and improves the accuracy of advertising campaigns.",
            "Links": [
                "https://twitter.com/rustybrick/status/1814359800571965522",
                "https://twitter.com/rustybrick/status/1814299402841776234",
                "https://twitter.com/rustybrick/status/1814259137183670452",
                "https://twitter.com/rustybrick/status/1813997412605645035",
                "https://twitter.com/rustybrick/status/1813937014758142343",
                "https://twitter.com/glenngabe/status/1813979736126947389",
                "https://twitter.com/rustybrick/status/1813896749338988617"
            ]
        },
        {
            "Title": "Google Confirms Country Code Domains Receive Ranking Boost",
            "Category": "Search",
            "Description": "This article reports on Google's confirmation that country code domain names (ccTLDs) receive a ranking boost in search results, giving an advantage to local websites.",
            "Links": [
                "https://twitter.com/rustybrick/status/1814367350394929504",
                "https://twitter.com/rustybrick/status/1814306952324809187",
                "https://twitter.com/glenngabe/status/1814274237340713423",
                "https://twitter.com/rustybrick/status/1814264170235486419",
                "https://www.searchenginejournal.com/google-confirms-ranking-preference/522477/"
            ]
        },
        {
            "Title": "Google's URL Shortener, goo.gl, to be Discontinued",
            "Category": "Search",
            "Description": "Google's URL shortening service, goo.gl, is being discontinued, rendering billions of redirects inoperable. Users relying on goo.gl are advised to switch to alternative URL shortening solutions.",
            "Links": [
                "https://twitter.com/rustybrick/status/1814371124802626024",
                "https://twitter.com/rustybrick/status/1814310727286652970",
                "https://twitter.com/aleyda/status/1814272473396850859",
                "https://twitter.com/rustybrick/status/1814266687002493000",
                "https://twitter.com/glenngabe/status/1814020367700082730"
            ]
        },
        {
            "Title": "Google Local Pack to Feature \"Search Products with Camera\"",
            "Category": "Search",
            "Description": "Google's local pack now incorporates a \"search products with camera\" functionality, allowing users to conduct visual searches for products offered by nearby businesses. This integration of visual search enhances the local shopping experience.",
            "Links": [
                "https://twitter.com/rustybrick/status/1814356025375371634",
                "https://twitter.com/rustybrick/status/1814295627440038072",
                "https://twitter.com/rustybrick/status/1814256620681204110"
            ]
        },
        {
            "Title": "Google is Automatically Translating Pages in Search Results",
            "Category": "Search",
            "Description": "Google is automatically translating web pages in search results for some users, including the title link and snippet. When users click through to the site, the page is also translated. Google recently expanded the number of languages it supports for this feature.",
            "Links": [
                "https://twitter.com/glenngabe/status/1814656173749998003",
                "https://twitter.com/glenngabe/status/1814349853981311221"
            ]
        },
        {
            "Title": "Chrome to Show Full-Page Warnings for \"Risky\" Downloads",
            "Category": "Browser",
            "Description": "Chrome will soon display full-page warnings for downloads deemed \"risky.\" The new warning allows users to restore aborted downloads but prompts them to explain why they want to proceed. Google aims to gather user feedback on download behaviors.",
            "Links": [
                "https://twitter.com/glenngabe/status/1814646228950319605"
            ]
        },
        {
            "Title": "Google's Gemini AI Assistant May Be Integrated into Future Smart Glasses",
            "Category": "AI",
            "Description": "Google has reportedly approached EssilorLuxottica, a leading eyewear company, about integrating its Gemini AI assistant into future smart glasses. This move could be a response to Meta's investment in EssilorLuxottica for its own AI-powered glasses.",
            "Links": [
                "https://twitter.com/glenngabe/status/1814640990159872464"
            ]
        },
        {
            "Title": "Google Patents System for Controlling Robots with \"Scene Memory Data\"",
            "Category": "AI",
            "Description": "Google has filed a patent for a system that uses \"scene memory data\" to control robotic agents. The technology leverages neural networks to enhance robots' decision-making abilities by processing historical data and real-time visual information.",
            "Links": [
                "https://twitter.com/glenngabe/status/1814347469729263985"
            ]
        },
        {
            "Title": "Study Finds Data Powering AI is Disappearing from the Web",
            "Category": "AI",
            "Description": "A study reveals that a significant portion of data used to train AI models is becoming inaccessible. The research analyzed 14,000 web domains and found that 5% of all data and 25% of high-quality data has been restricted, potentially impacting AI development.",
            "Links": [
                "https://twitter.com/glenngabe/status/1814345965769502873"
            ]
        },
        {
            "Title": "Ignoring Website Accessibility Can Hurt Search Ranking and Lead to Legal Issues",
            "Category": "Search",
            "Description": "A study highlights that a majority of websites fail to comply with Web Content Accessibility Guidelines (WCAG). Neglecting website accessibility can negatively impact search engine rankings and potentially result in legal consequences.",
            "Links": [
                "https://www.entrepreneur.com/science-technology/ignoring-this-website-essential-can-hurt-your-search-ranking/476535"
            ]
        },
        {
            "Title": "Teads and Outbrain Rumored to Merge in Ad Tech Deal",
            "Category": "Advertising",
            "Description": "Rumors are circulating about a potential merger between ad tech companies Teads and Outbrain. The deal, if confirmed, would significantly reshape the advertising technology landscape.",
            "Links": [
                "https://digiday.com/media/teads-ma-rumors-are-firming-up-with-a-deal-to-merge-with-outbrain/"
            ]
        },
        {
            "Title": "Agencies SEO Services Market Growth Analysis With Investment Opportunities For 2024-2033",
            "Category": "Search",
            "Description": "The Business Research Company’s Agencies SEO Services Global Market Report 2024 – Market Size, Trends, And Global Forecast 2024-2033",
            "Links": [
                "https://www.einnews.com/pr_news/728828407/agencies-seo-services-market-growth-analysis-with-investment-opportunities-for-2024-2033"
            ]
        },
        {
            "Title": "Google Chrome Could Make Product Comparisons Easier with AI",
            "Category": "Browser",
            "Description": "Glenn Gabe highlights a potential upcoming feature in Google Chrome that would use AI to simplify product comparisons for users.",
            "Links": [
                "https://twitter.com/glenngabe/status/1814269405561299257"
            ]
        },
        {
            "Title": "Netflix's Ad-Supported Tier Sees Significant Growth",
            "Category": "Advertising",
            "Description": "Glenn Gabe discusses Netflix's upcoming ad platform and the growth of their ad-supported tier.",
            "Links": [
                "https://twitter.com/glenngabe/status/1814268343269937501"
            ]
        },
        {
            "Title": "Faulty Windows Update Causes Widespread System Crashes",
            "Category": "Technology",
            "Description": "Glenn Gabe shares a concerning report from CrowdStrike about a faulty Windows update causing widespread system crashes, impacting banks, airlines, and other organizations.",
            "Links": [
                "https://twitter.com/glenngabe/status/1814266412048728168"
            ]
        },
        {
            "Title": "How to Bulk Export Translated Results from Google Search Console",
            "Category": "Search",
            "Description": "Glenn Gabe shares his latest blog post about how to bulk export translated results from Google Search Console by country using the GSC API and Analytics Edge.",
            "Links": [
                "https://twitter.com/glenngabe/status/1814265219289334060",
                "https://twitter.com/glenngabe/status/1814265219289334060"
            ]
        },
        {
            "Title": "Google's John Mueller Offers Advice on Evaluating SEO Team Performance",
            "Category": "Search",
            "Description": "This article summarizes Google's John Mueller's advice on how to assess the effectiveness of your SEO team, including setting clear expectations, tracking progress, and communicating effectively.",
            "Links": [
                "https://twitter.com/rustybrick/status/1814363575395426798",
                "https://twitter.com/rustybrick/status/1814303177287909779",
                "https://twitter.com/rustybrick/status/1814261653997023592",
                "https://www.seroundtable.com/google-seo-team-doing-job-37755.html",
                "https://www.searchenginejournal.com/googles-john-mueller-on-how-to-verify-an-seo-agencys-work/522449/"
            ]
        },
        {
            "Title": "Manchester City Uses Fortnite to Expand its Global Audience",
            "Category": "Marketing",
            "Description": "This article explores how Manchester City is leveraging the popular video game Fortnite to expand its global audience and engage with fans in new and innovative ways.",
            "Links": [
                "https://digiday.com/marketing/manchester-city-uses-fortnite-to-expand-its-global-audience/"
            ]
        },
        {
            "Title": "eBay Adds More AI Advertising Tools for Sellers",
            "Category": "Advertising",
            "Description": "This article discusses eBay's introduction of new AI-powered advertising tools for sellers on its platform, allowing them to leverage marketplace trends and search terms for campaign creation.",
            "Links": [
                "https://digiday.com/media-buying/ai-briefing-why-ebay-is-adding-more-ai-advertising-tools-for-sellers/"
            ]
        },
        {
            "Title": "Some Ad Tech Vendors Pulling Back from Google's Privacy Sandbox",
            "Category": "Advertising",
            "Description": "This article highlights the uncertainty surrounding Google's Privacy Sandbox, leading some ad tech vendors to withdraw their support due to concerns about its future and potential impact on the industry.",
            "Links": [
                "https://digiday.com/marketing/some-ad-tech-vendors-are-pulling-back-from-googles-privacy-sandbox-amid-uncertainty/"
            ]
        },
        {
            "Title": "How Revolut's Creator Strategy is Benefitting from YouTube's Long-Form Swing",
            "Category": "Marketing",
            "Description": "This article examines how challenger bank Revolut is capitalizing on YouTube's shift towards long-form content by partnering with creators to reach consumers and build brand awareness.",
            "Links": [
                "https://digiday.com/marketing/how-revoluts-creator-strategy-is-benefitting-from-youtubes-long-form-swing/"
            ]
        },
        {
            "Title": "How Chipotle's Fighting-Game-Focused Esports Strategy is Paying Off",
            "Category": "Marketing",
            "Description": "This article analyzes the success of Chipotle's esports strategy, which focuses on the fighting game community, and how it has led to increased brand awareness and purchase intent among target demographics.",
            "Links": [
                "https://digiday.com/marketing/how-chipotles-fighting-game-focused-esports-strategy-is-paying-off-at-evo-2024/"
            ]
        },
        {
            "Title": "Instagram Expands Notes Feature to Reels and Grid Posts",
            "Category": "Social Media",
            "Description": "Instagram expands Notes, its temporary away status-like feature, to let users leave Notes on Reels and grid posts; the temporary comments are semi-private. Users will now be able to leave Notes on Reels and grid posts, where…",
            "Links": [
                "https://twitter.com/glenngabe/status/1814019216271368567"
            ]
        },
        {
            "Title": "Google Clarifies H1-H6 Headings For SEO",
            "Category": "Search",
            "Description": "Google's Gary Illyes answered a question about heading elements (H1, H2, etc.) and the best way to use them for SEO",
            "Links": [
                "https://www.searchenginejournal.com/google-clarifies-h1-h6-headings-for-seo/522454/"
            ]
        },
        {
            "Title": "Gaming Affiliate Reduces Revenue Forecast Due to Google Policy",
            "Category": "Advertising",
            "Description": "Gaming affiliate reduced financial revenue forecast due to Google's site reputation abuse policy",
            "Links": [
                "https://twitter.com/rustybrick/status/1813993637841400208",
                "https://twitter.com/rustybrick/status/1813933239641268285",
                "https://twitter.com/rustybrick/status/1813894232706552313"
            ]
        },
        {
            "Title": "3 Ways to Add a Human Touch to AI-Generated Content",
            "Category": "AI",
            "Description": "Find out how to add a personal touch, maintain your brand voice and incorporate human expertise into AI-generated content.",
            "Links": [
                "https://searchengineland.com/ai-generated-content-human-touch-444231"
            ]
        },
        {
            "Title": "Tension Between News Publishers and AI Companies Expands to Japan",
            "Category": "AI",
            "Description": "The tension between news publishers and AI companies expands to Japan. Japan newspaper association calls on government for legal reform to curb AI search",
            "Links": [
                "https://twitter.com/glenngabe/status/1813920495089401910"
            ]
        },
        {
            "Title": "Apple News Deal with Taboola Raises Privacy Concerns",
            "Category": "Technology",
            "Description": "The Apple News deal with Taboola is shocking and off-brand, calling into question Apple's commitment to good customer experience, including privacy",
            "Links": [
                "https://twitter.com/glenngabe/status/1813918235005518247"
            ]
        },
        {
            "Title": "Baidu vs. Google: Navigating the SEO Landscape in 2024",
            "Category": "Search",
            "Description": "Learn the similarities and differences between Baidu and Google SEO and how to boost your presence in the Chinese search landscape.",
            "Links": [
                "https://searchengineland.com/baidu-vs-google-seo-444242"
            ]
        },
        {
            "Title": "SEO is Changing Faster Than Ever, Says Expert",
            "Category": "Search",
            "Description": "In the last 18 months, SEO has been changing faster than in the last 25 years of Google. And to survive SEO needs a new mindset approach – this could be a challenge for some traditional SEOs I spoke to @MordyOberstein about what SEOs need to know about brand marketing",
            "Links": [
                "https://twitter.com/theshelleywalsh/status/1813851983125631036"
            ]
        },
        {
            "Title": "How Partnerships Between Athletes and Brands are Changing",
            "Category": "Marketing",
            "Description": "Relationships between brands and athletes are getting shorter, as the line between influencer and athlete blurs.",
            "Links": [
                "https://digiday.com/marketing/how-partnerships-between-athletes-and-brands-are-beginning-to-resemble-influencer-deals/"
            ]
        },
        {
            "Title": "Publishers Report Mixed Results for Programmatic Revenue",
            "Category": "Advertising",
            "Description": "Publishers check in on their programmatic businesses.",
            "Links": [
                "https://digiday.com/media/media-briefing-publishers-say-private-programmatic-revenue-is-up-but-open-is-a-mixed-bag/"
            ]
        },
        {
            "Title": "Advertisers Hesitant to Embrace Ads on Meta's Threads",
            "Category": "Advertising",
            "Description": "Sure, there's interest, but it's tempered by the fact that advertisers still don't really know why they should be on the app in the first place.",
            "Links": [
                "https://digiday.com/marketing/advertisers-dont-seem-too-tempted-by-meta-putting-ads-on-threads/"
            ]
        },
        {
            "Title": "Amazon Prime Day Recap: Shoppers Prioritize Household Items",
            "Category": "Ecommerce",
            "Description": "Market research firm Numerator said the average order size on Prime Day so far is $59.78, according to data culled from nearly 7,500 Amazon orders by more than 4,000 households.",
            "Links": [
                "https://digiday.com/marketing/amazon-prime-day-recap-shoppers-buy-household-items-over-pricey-splurges-on-first-day/"
            ]
        },
        {
            "Title": "Daum Falls Behind as Bing and Rivals Leverage AI",
            "Category": "Search",
            "Description": "Exclusive: Daum falls behind as Bing and rivals leverage AI for market gains",
            "Links": [
                "https://www.chosun.com/english/industry-en/2024/07/18/5CLWMPHINZG2NLB47UICC2MI5U/"
            ]
        },
        {
            "Title": "What SEO Should Know About Brand Marketing",
            "Category": "Search",
            "Description": "Learn how building a strong brand online prepares SEO professionals for a future driven by brand-first strategies.",
            "Links": [
                "https://www.searchenginejournal.com/what-seo-should-know-about-brand-marketing-with-mordy-oberstein/522083/"
            ]
        },
        {
            "Title": "OpenAI Launches GPT-4o Mini",
            "Category": "AI",
            "Description": "OpenAI launches GPT-4o mini, a smaller, cheaper offshoot of GPT-4o, replacing GPT-3.5 Turbo, with support for all multimodal inputs and outputs coming soon",
            "Links": [
                "https://twitter.com/glenngabe/status/1813980640968356003"
            ]
        },
        {
            "Title": "US Shoppers Spend $14.2 Billion During Amazon Prime Day",
            "Category": "Ecommerce",
            "Description": "Adobe: US shoppers spent $14.2B during Amazon's 48-hour Prime Day sale, up 11% YoY and in line with estimates; Numerator: the average household spent about $152",
            "Links": [
                "https://twitter.com/glenngabe/status/1813978834997563679"
            ]
        },
        {
            "Title": "Google Search App Testing Save Feature for AI Overviews",
            "Category": "Search",
            "Description": "Google Search App is adding a feature to save AI overviews in a private collection.",
            "Links": [
                "https://twitter.com/glenngabe/status/1814985457261772992"
            ]
        },
        {
            "Title": "Link-Busters Reports Over a Billion DMCA Takedown Requests to Google",
            "Category": "Piracy",
            "Description": "Link-Busters, an anti-piracy company, has become the first to report over a billion DMCA takedown requests to Google Search. Approximately 75% of the reported URLs were removed, while 21% were not in Google's index but were blacklisted.",
            "Links": [
                "https://twitter.com/glenngabe/status/1815009577982697556"
            ]
        },
        {
            "Title": "Google Testing New Link Treatments and AI Overviews in Search Labs",
            "Category": "Search",
            "Description": "Google is actively testing new link treatments and SAVE AI Overviews in their Search Labs. These tests indicate ongoing efforts to enhance search results and user experience.",
            "Links": [
                "https://twitter.com/glenngabe/status/1815003276665852403"
            ]
        },
        {
            "Title": "Academic Authors Outraged Over Sale of Research Access to Microsoft AI",
            "Category": "AI",
            "Description": "Taylor & Francis, a publishing company, has sold access to academic research to Microsoft AI for $10 million in the first year. This agreement has sparked outrage among academic authors who were not informed about the deal.",
            "Links": [
                "https://twitter.com/glenngabe/status/1815000149548032118"
            ]
        }
    ],
    "date": "2024-07-21"
}