{
    "data": [
        {
            "Title": "Google Search Console Experiences Significant Reporting Delays",
            "Category": "Search Engine Optimization",
            "Description": "Google Search Console performance reports have been delayed for an unusually long period, exceeding 60 hours. This issue is affecting various reports and has caused concern among SEO professionals.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808275005991530608",
                "https://twitter.com/rustybrick/status/1808214375116742950",
                "https://www.seroundtable.com/google-search-console-search-delays-latency-37658.html"
            ]
        },
        {
            "Title": "Google Updates Merchant Center Conversion Data Usage Policy",
            "Category": "Ecommerce",
            "Description": "Google Merchant Center merchants have been notified of a change in how Google collects and utilizes conversion data. The updated policy allows Google to employ this data for enhanced reporting, improved search experiences, and refined services.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808195431685304575",
                "https://www.seroundtable.com/google-merchant-center-conversion-data-usage-37654.html",
                "https://twitter.com/rustybrick/status/1808020529116504501"
            ]
        },
        {
            "Title": "Google Search Prioritizes AI-Generated Content Over Original Reporting",
            "Category": "Artificial Intelligence",
            "Description": "A recent study reveals that Google Search results often rank AI-generated content, even if it's spam, above original reporting. This raises concerns about the spread of misinformation and the devaluation of human-created content.",
            "Links": [
                "https://www.searchenginejournal.com/googles-ai-overviews-coincide-with-drop-in-mobile-searches/521303/",
                "https://twitter.com/rustybrick/status/1808202503043100839",
                "https://twitter.com/aleyda/status/1808173422649745590"
            ]
        },
        {
            "Title": "Google Ads Introduces New Setting for \"Altered or Synthetic Content\"",
            "Category": "Digital Advertising",
            "Description": "Google Ads has rolled out a new setting that requires advertisers to disclose the use of \"Altered or synthetic content\" in their ads. This move aims to increase transparency and user trust by clearly labeling AI-generated content.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808202981398953985",
                "https://twitter.com/rustybrick/status/1808142583723327796"
            ]
        },
        {
            "Title": "Bing Updates Webmaster Guidelines with New \"Prompt Injection\" Guideline",
            "Category": "Search Engine Optimization",
            "Description": "Bing has added a new guideline to its Bing Webmaster Guidelines addressing \"Prompt Injection.\" This type of cyberattack targets large language models (LLMs) by manipulating generative AI systems with malicious inputs disguised as legitimate prompts.",
            "Links": [
                "https://twitter.com/rustybrick/status/1807833043765248078",
                "https://twitter.com/rustybrick/status/1807772645842108497",
                "https://www.seroundtable.com/prompt-injection-bing-webmaster-guidelines-37650.html"
            ]
        },
        {
            "Title": "YouTube Implements Policy Change for Takedown Requests of AI-Generated Content",
            "Category": "Artificial Intelligence",
            "Description": "YouTube has updated its policies to allow individuals to request the removal of AI-generated content that simulates their face or voice. This change aims to address concerns about privacy and the potential misuse of synthetic media.",
            "Links": [
                "https://twitter.com/glenngabe/status/1808032636033503490"
            ]
        }
    ],
    "date": "2024-07-03"
}