{
    "data": [
        {
            "Title": "Google Search Ranking Volatility Remains High",
            "Category": "SEO",
            "Description": "RustyBrick observes ongoing high volatility in Google Search rankings and provides updated charts illustrating the trend. There has been so much volatility since early May, with a number of reversals, that it is not recommended to make huge changes based on that volatility until the next core update rolls out.",
            "Links": [
                "https://twitter.com/rustybrick/status/1814274236753514801",
                "https://twitter.com/glenngabe/status/1813913290910691411"
            ]
        },
        {
            "Title": "Upcoming Google Core Update and SEO News Recap",
            "Category": "SEO",
            "Description": "RustyBrick shares a video recap covering major SEO news including an upcoming Google core update, ranking volatility, Search Notes removal, AI Overviews tests, and search ads.",
            "Links": [
                "https://twitter.com/rustybrick/status/1814269180415201353"
            ]
        },
        {
            "Title": "Google Confirms Ranking Boost for Country Code Domains",
            "Category": "SEO",
            "Description": "This article reports on Google's confirmation that country code domain names receive a ranking advantage in localized search results, emphasizing the importance of ccTLDs for international SEO. Google's advice is that using a ccTLD helps a little to rank better in a regional version of Google, but it helps even more to use that localized language on your page.",
            "Links": [
                "https://www.searchenginejournal.com/google-confirms-ranking-preference/522477/",
                "https://twitter.com/rustybrick/status/1814264170235486419"
            ]
        },
        {
            "Title": "Google Merchant Center Next Now Supports Supplemental Feeds",
            "Category": "Ecommerce",
            "Description": "Google Merchant Center Next now supports supplemental feeds, a significant update for e-commerce businesses using the platform.",
            "Links": [
                "https://twitter.com/rustybrick/status/1814259137183670452"
            ]
        },
        {
            "Title": "Google Merchant Center Next Rolling Out to All Merchants",
            "Category": "Ecommerce",
            "Description": "Google Merchant Center Next is coming to all merchant accounts this month, with a refreshed user interface, reinvented complex features & new experiences.",
            "Links": [
                "https://twitter.com/rustybrick/status/1813896749338988617",
                "https://twitter.com/glenngabe/status/1813979736126947389"
            ]
        },
        {
            "Title": "Google to End Support for goo.gl Shortener Links in 2025",
            "Category": "SEO",
            "Description": "Aleyda highlights Google's announcement that goo.gl shortener links will stop working after August 25, 2025, potentially impacting existing links.",
            "Links": [
                "https://twitter.com/aleyda/status/1814272473396850859"
            ]
        },
        {
            "Title": "How to Evaluate Your SEO Team's Performance",
            "Category": "SEO",
            "Description": "This article summarizes Google's John Mueller's advice on evaluating the effectiveness of an SEO team, emphasizing transparency and measurable results.",
            "Links": [
                "https://www.seroundtable.com/google-seo-team-doing-job-37755.html"
            ]
        },
        {
            "Title": "Google Chrome May Simplify Product Comparisons with AI",
            "Category": "SEO",
            "Description": "Glenngabe points to potential changes in product review and comparison SEO with Google Chrome exploring an AI-powered feature to simplify product research.",
            "Links": [
                "https://twitter.com/glenngabe/status/1814269405561299257"
            ]
        },
        {
            "Title": "Google Ends Notes Search and Discover Labs Experiment",
            "Category": "Search",
            "Description": "Google has ended its Notes Search and Discover labs experiment.",
            "Links": [
                "https://twitter.com/rustybrick/status/1813646349197320525"
            ]
        },
        {
            "Title": "Google Testing AI Overviews on Workspace Accounts",
            "Category": "Search",
            "Description": "Google is testing AI Overviews on Workspace accounts, including in the UK.  It is unclear if this is related to the AI Overviews being tested in the main search results.",
            "Links": [
                "https://twitter.com/rustybrick/status/1813901782596325651"
            ]
        },
        {
            "Title": "Website Accessibility: Essential for SEO and Legal Compliance",
            "Category": "SEO",
            "Description": "A study found that 95% of websites fail to meet Web Content Accessibility Guidelines — and accessibility is key to boosting website traffic. Here's what to do.",
            "Links": [
                "https://www.entrepreneur.com/science-technology/ignoring-this-website-essential-can-hurt-your-search-ranking/476535"
            ]
        }
    ],
    "date": "2024-07-20"
}