{
    "data": [
        {
            "Title": "Google Search Experiencing Indexing Issues and Bugs",
            "Category": "Search Engines",
            "Description": "Google Search is reportedly experiencing bugs that are preventing new content from being indexed and sending multiple \"new owner\" email notifications through Google Search Console.",
            "Links": [
                "https://twitter.com/rustybrick/status/1810438660959137901",
                "https://twitter.com/rustybrick/status/1810381083529326802"
            ]
        },
        {
            "Title": "Google Updates URL Best Practices and Discusses Ranking for Unrelated Keywords",
            "Category": "SEO",
            "Description": "Google updated its URL best practices, adding a recommendation to avoid using fragments for changing page content. Additionally, Google advises content creators to remove ambiguity from their content if they are ranking for irrelevant keywords.",
            "Links": [
                "https://twitter.com/rustybrick/status/1810377308747841823",
                "https://twitter.com/rustybrick/status/1810369758984024224"
            ]
        },
        {
            "Title": "Bing Search Testing Nutritional Labels on Images",
            "Category": "Search Engines",
            "Description": "Bing is testing adding nutritional details to images in its search results. It includes labeling food products with \"high calcium,\" \"lean protein,\" \"anti-inflammatory,\" and other labels.",
            "Links": [
                "https://twitter.com/rustybrick/status/1810739696487510392",
                "https://twitter.com/rustybrick/status/1810679298724159948",
                "https://www.seroundtable.com/bing-search-tests-labeling-images-with-nutrition-details-37677.html"
            ]
        },
        {
            "Title": "Etsy Adds AI-Generated Item Guidelines to Seller Policy",
            "Category": "Ecommerce",
            "Description": "After an influx of AI-generated products (and backlash), Etsy updates its seller policy. The new set of 'Creativity Standards' requires sellers to classify the over 100 million items in its marketplace as either \"designed by human\" or \"designed using AI.\"",
            "Links": [
                "https://twitter.com/glenngabe/status/1810652179004366886"
            ]
        },
        {
            "Title": "Ad Agency Criticized for Using AI and Recycled Bylines on Revived TUAW Domain",
            "Category": "Artificial Intelligence",
            "Description": "The Unofficial Apple Weblog is back, but ad agency Web Orange has turned it into a nightmare plagiarism farm with AI-generated copy, and worse, stolen bylines from writers long since moved on.",
            "Links": [
                "https://appleinsider.com/articles/24/07/09/ad-agency-zombifies-tuaw-with-ai-copy-recycled-bylines-in-stupid-seo-play"
            ]
        },
        {
            "Title": "Google Ads Updates: Opioid Ad Policy Paused, Merchant Center Migration, and Country of Sale Changes",
            "Category": "Advertising",
            "Description": "Google Ads has indefinitely paused its policy update that would have allowed ads for Opioid painkillers. Additionally, Google Ads and Merchant Center will auto migrate from Country of Sale to new Feed label functionality in August 2024.",
            "Links": [
                "https://twitter.com/rustybrick/status/1810743471491227822",
                "https://twitter.com/rustybrick/status/1810683073417158987",
                "https://twitter.com/rustybrick/status/1810642808132534422",
                "https://twitter.com/rustybrick/status/1810640291654951159"
            ]
        },
        {
            "Title": "YouTube SEO: Traffic Sources Impact Explained",
            "Category": "SEO",
            "Description": "YouTube's home page recommendations are affected by viewers watching videos from the home page and not affected by external views. Traffic sources influence the same traffic sources as other platforms, not distinct ones.",
            "Links": [
                "https://twitter.com/rustybrick/status/1810280420308906269",
                "https://www.seroundtable.com/youtube-seo-traffic-sources-37685.html"
            ]
        }
    ],
    "date": "2024-07-10"
}