{
    "data": [
        {
            "Title": "Google Search Console Performance Reports Experiencing Delays",
            "Category": "Search Engine Optimization",
            "Description": "Google Search Console performance reports are currently experiencing delays of over 60 hours. Google has confirmed it is working on a fix for the latency issues.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808080803399659889",
                "https://www.seroundtable.com/google-search-console-search-delays-latency-37658.html",
                "https://searchengineland.com/google-working-on-fixing-latency-issues-with-the-search-performance-reports-443857"
            ]
        },
        {
            "Title": "Google's June 2024 Spam Update Completed",
            "Category": "Search Engine Optimization",
            "Description": "Google's June 2024 spam update has finished rolling out after a seven-day period. The update aimed to improve the quality of search results by demoting spammy and low-quality content.",
            "Links": [
                "https://twitter.com/rustybrick/status/1806656541376086189",
                "https://twitter.com/aleyda/status/1807025511966683400",
                "https://www.seroundtable.com/july-2024-google-webmaster-report-37655.html"
            ]
        },
        {
            "Title": "Soft 404 Errors Negatively Impact Website Performance",
            "Category": "Search Engine Optimization",
            "Description": "Google emphasizes the negative implications of soft 404 errors on website performance and search engine optimization. Soft 404s occur when a page returns a 200 status code (OK) but Google believes it should return a 404 (Not Found) error. These errors can limit crawl budget and hinder a page's ability to rank in search results.",
            "Links": [
                "https://twitter.com/rustybrick/status/1807783970735632815",
                "https://twitter.com/glenngabe/status/1807748435233157259",
                "https://www.seroundtable.com/google-on-why-soft-404s-are-bad-37646.html"
            ]
        },
        {
            "Title": "Google Tests \"Top Quality Store\" Badge in Search Results",
            "Category": "Search Engine Optimization",
            "Description": "Google Search is experimenting with a \"top quality store\" badge displayed alongside website names in search results. This badge could potentially influence user trust and click-through rates.",
            "Links": [
                "https://twitter.com/rustybrick/status/1807776420867068171",
                "https://twitter.com/rustybrick/status/1807836818886336927"
            ]
        },
        {
            "Title": "Bing Adds \"Prompt Injection\" to Webmaster Guidelines",
            "Category": "Search Engine Optimization",
            "Description": "Bing has introduced a new webmaster guideline addressing prompt injection, a security vulnerability that can be exploited to manipulate AI-powered systems. This guideline emphasizes the importance of protecting websites from this emerging threat.",
            "Links": [
                "https://twitter.com/rustybrick/status/1807772645842108497",
                "https://www.seroundtable.com/prompt-injection-bing-webmaster-guidelines-37650.html",
                "https://searchengineland.com/prompt-injection-added-to-bing-webmaster-guidelines-443788"
            ]
        },
        {
            "Title": "Google Merchant Center Updates Conversion Data Usage",
            "Category": "Ecommerce",
            "Description": "Google Merchant Center is changing how it uses conversion data shared by merchants. Google may use this data for new reporting features and to improve Google Search experiences and services.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808020529116504501",
                "https://www.seroundtable.com/google-merchant-center-conversion-data-usage-37654.html"
            ]
        },
        {
            "Title": "YouTube Allows Takedown Requests for AI-Generated Content Simulating Real People",
            "Category": "Artificial Intelligence",
            "Description": "YouTube has implemented a policy change allowing individuals to request the removal of AI-generated content that simulates their face or voice. This change aims to address concerns about privacy and the potential misuse of synthetic media.",
            "Links": [
                "https://twitter.com/glenngabe/status/1808032636033503490"
            ]
        },
        {
            "Title": "TikTok Develops AI Chatbot \"Genie\"",
            "Category": "Artificial Intelligence",
            "Description": "TikTok is developing a new AI chatbot called \"Genie,\" which could incorporate generative AI search functionality. The chatbot would allow users to ask questions within the app and receive immediate responses.",
            "Links": [
                "https://twitter.com/glenngabe/status/1808114230484193377"
            ]
        },
        {
            "Title": "Google Ads to Accept Ads for Daily Fantasy Sports and Lottery Couriers",
            "Category": "Advertising",
            "Description": "Starting July 15th, Google Ads will begin accepting and running ads for Daily Fantasy Sports and lottery couriers in many US states. This policy change reflects the growing popularity of these industries.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808094517020745983"
            ]
        },
        {
            "Title": "Google Ads Introduces New Setting for \"Altered or Synthetic Content\"",
            "Category": "Advertising",
            "Description": "Google Ads has added a new setting for political campaigns, requiring advertisers to disclose whether they have used \"Altered or synthetic content\" in their ads. This move aims to increase transparency and accountability in political advertising.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808101059967214015",
                "https://twitter.com/rustybrick/status/1808142583723327796"
            ]
        },
        {
            "Title": "Microsoft Advertising Launches Property Center, Expands Lodging Campaigns",
            "Category": "Advertising",
            "Description": "Microsoft Advertising has launched Property Center, a new platform for managing hotel and vacation rental listings. The company is also expanding its lodging campaigns, offering more features and targeting options for advertisers in the travel industry.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808098543262978091"
            ]
        },
        {
            "Title": "OpenAI Partners with Time Magazine to Enhance ChatGPT",
            "Category": "Artificial Intelligence",
            "Description": "OpenAI has partnered with Time magazine to provide ChatGPT with access to its extensive archive of journalistic content. This collaboration aims to improve ChatGPT's knowledge base and ability to generate accurate and informative responses.",
            "Links": [
                "https://twitter.com/glenngabe/status/1807380226483052989"
            ]
        }
    ],
    "date": "2024-07-02"
}