{
    "data": [
        {
            "Title": "Google Search Console to Only Use Mobile Crawling After July 5th",
            "Category": "Search Engine Optimization",
            "Description": "Google has announced that it will soon crawl all websites for Search using the Googlebot Smartphone crawler. This means that if a website's content is not accessible on mobile devices, it will no longer be indexed by Google. This change will take effect after July 5, 2024.",
            "Links": [
                "https://twitter.com/glenngabe/status/1797658783247700415",
                "https://searchengineland.com/google-wont-index-sites-that-do-not-work-on-mobile-devices-after-july-5th-442851",
                "https://twitter.com/aleyda/status/1797721029957038325"
            ]
        },
        {
            "Title": "Google Search Experienced Volatility in June",
            "Category": "Search Engine Optimization",
            "Description": "Google Search has been experiencing a high level of volatility in recent weeks, with many websites seeing significant fluctuations in their rankings. This volatility was particularly noticeable on June 1st, with many SEO professionals reporting unusual ranking changes.",
            "Links": [
                "https://twitter.com/rustybrick/status/1797640885188088236",
                "https://twitter.com/rustybrick/status/1797607414717460550",
                "https://www.seroundtable.com/google-search-ranking-algorithm-volatility-june-1-37488.html"
            ]
        },
        {
            "Title": "How to Optimize for Google's AI Overviews",
            "Category": "Search Engine Optimization",
            "Description": "SEO professionals are experimenting with ways to get their pages to appear in Google's AI Overviews. Cyrus Shepard shared a case study on how he successfully got his site included in these overviews.",
            "Links": [
                "https://twitter.com/rustybrick/status/1797693733628166445",
                "https://twitter.com/rustybrick/status/1797633335419621507",
                "https://www.seroundtable.com/google-ai-overviews-optimization-37487.html"
            ]
        },
        {
            "Title": "Google Search Console Link Report Still Experiencing Issues",
            "Category": "Search Engine Optimization",
            "Description": "Google is still working on fixing issues with the Google Search Console link report. John Mueller provided an update on the situation via Reddit, acknowledging the ongoing problems.",
            "Links": [
                "https://twitter.com/rustybrick/status/1797567173117841630"
            ]
        },
        {
            "Title": "Google Confirms Clicks and Engagement Impact SEO",
            "Category": "Search Engine Optimization",
            "Description": "Recent revelations from Google have confirmed that clicks and user engagement on organic search results do influence search engine rankings, contradicting previous statements from the company.",
            "Links": [
                "https://www.practicalecommerce.com/yes-clicks-and-engagement-impact-seo"
            ]
        },
        {
            "Title": "Google Search API Doc Leaks Spark Discussion",
            "Category": "Search Engine Optimization",
            "Description": "Leaked internal documents from Google Search API have caused a stir in the SEO community. Some members have expressed concerns about the lack of transparency and contradictions between the leaked information and Google's past statements.",
            "Links": [
                "https://twitter.com/aleyda/status/1797574340508082537"
            ]
        },
        {
            "Title": "Instagram Tests Unskippable Ads with Countdown Timers",
            "Category": "Social Media",
            "Description": "Instagram is testing a new ad format that is unskippable and features a countdown timer, temporarily preventing users from scrolling their feeds.",
            "Links": [
                "https://twitter.com/glenngabe/status/1797711100710170854"
            ]
        },
        {
            "Title": "LinkedIn Reduces Image Size in Organic Post Link Previews",
            "Category": "Social Media",
            "Description": "LinkedIn has updated its link previews for organic posts, opting for smaller images. This change, announced a few months prior, will eventually apply to all organic posts, potentially impacting engagement.",
            "Links": [
                "https://twitter.com/glenngabe/status/1796888158707073151"
            ]
        },
        {
            "Title": "Meta Notifies EU Users About Data Usage for AI Training",
            "Category": "Privacy",
            "Description": "Meta is notifying Instagram and Facebook users in the EU that their data is being used to train its AI models. Users have the option to opt out, but it's unclear if their objections will be honored.",
            "Links": [
                "https://twitter.com/glenngabe/status/1796884405857730725"
            ]
        },
        {
            "Title": "Windows AI Feature \"Recall\" Raises Security Concerns",
            "Category": "Privacy",
            "Description": "Windows' new AI feature, \"Recall,\" is designed to screenshot everything users see or do on their computers using local AI models. This feature has been labeled a security \"disaster\" due to its potential privacy implications.",
            "Links": [
                "https://twitter.com/glenngabe/status/1797671187142840516"
            ]
        },
        {
            "Title": "Spotify Raises Premium Price in the US",
            "Category": "Business",
            "Description": "Spotify is increasing its premium subscription price in the US to $11.99 per month. This move is estimated to generate an additional $1.4 billion in annual revenue for the company.",
            "Links": [
                "https://twitter.com/glenngabe/status/1797595621270192211"
            ]
        }
    ],
    "date": "2024-06-04"
}