{
    "data": [
        {
            "Title": "Google August 2024 Core Update Causes Volatility",
            "Category": "Search Engine Optimization",
            "Description": "Google rolled out its August 2024 core update, causing significant search ranking volatility even days after completion.  Experts are unsure whether the volatility is residual or indicative of new changes.  Google's Search Liaison, Danny Sullivan, stated that recovery from core updates is not guaranteed, and publishers may not regain previous traffic levels.",
            "Links": [
                "https://www.seroundtable.com/video-09-06-2024-38028.html",
                "https://www.seroundtable.com/google-search-volatility-still-heated-38027.html",
                "https://twitter.com/rustybrick/status/1832026209309335982"
            ]
        },
        {
            "Title": "Microsoft Partners with StopNCII to Remove Non-Consensual Intimate Images from Bing",
            "Category": "Internet Safety",
            "Description": "Microsoft is partnering with StopNCII to remove non-consensual intimate images, including deepfakes, from Bing search results. This initiative aims to protect victims of revenge porn and combat the spread of harmful content. Users can now use a tool to create digital hashes of their sensitive media, allowing Bing to detect and remove those images from search results.",
            "Links": [
                "https://www.digitalinformationworld.com/2024/09/microsoft-bing-takes-major-step-against.html",
                "https://www.fudzilla.com/news/ai/59656-microsoft-wants-to-purge-deepfakes-from-bing",
                "http://gigazine.net/gsc_news/en/20240906-microsoft-removes-revenge-porn-bing/"
            ]
        },
        {
            "Title": "Hackers Target SEO Campaigns to Spread Malware",
            "Category": "Cybersecurity",
            "Description": "Hackers are exploiting SEO campaigns to spread new malware, posing a threat to online safety and digital marketing efforts.  The tactics used by these hackers are unknown, but the impact on businesses and individuals could be significant.",
            "Links": [
                "https://www.killerstartups.com/hackers-exploit-seo-campaign-to-spread-new-malware/"
            ]
        }
    ],
    "date": "2024-09-08"
}