{
    "data": [
        {
            "Title": "Google Discontinues Continuous Scroll in Search Results",
            "Category": "Search Engine Optimization",
            "Description": "Google is discontinuing the continuous scroll feature in its search results, reverting to the classic pagination bar. The change aims to improve search speed and is expected to be implemented on mobile search soon.",
            "Links": [
                "https://twitter.com/rustybrick/status/1805586749395173780",
                "https://www.searchenginejournal.com/google-ends-continuous-scroll-serps-what-it-really-means/520768/",
                "https://twitter.com/rustybrick/status/1805968256299303047"
            ]
        },
        {
            "Title": "Google Debunks Branded Keywords SEO Myth",
            "Category": "Search Engine Optimization",
            "Description": "Google clarifies that using branded keywords in content does not negatively impact search rankings. Danny Sullivan emphasizes that creating helpful content for users, which may naturally include brand mentions, is crucial.",
            "Links": [
                "https://www.searchenginejournal.com/google-debunks-seo-myth-branded-keywords-wont-hurt-rankings/520772/",
                "https://twitter.com/rustybrick/status/1805975806071423443",
                "https://twitter.com/rustybrick/status/1805931765644870038"
            ]
        },
        {
            "Title": "Perion Network Announces Layoffs Following Microsoft Bing's Pricing Changes",
            "Category": "Business & Finance",
            "Description": "Perion Network, a digital advertising company, is laying off 35 employees (6% of its workforce) as part of cost-cutting measures. The layoffs are attributed to Microsoft's revised pricing policies for its Bing search engine.",
            "Links": [
                "https://www.calcalistech.com/ctechnews/article/sjdai5d8r",
                "https://www.latestly.com/technology/perion-network-layoffs-israel-based-digital-ad-company-to-lays-off-35-employees-amid-cost-cutting-and-bing-search-engines-changed-pricing-mechanism-6066632.html"
            ]
        },
        {
            "Title": "Google Updates Sitemap Documentation with Emphasis on \"Lastmod\" Accuracy",
            "Category": "Search Engine Optimization",
            "Description": "Google has updated its sitemap documentation to clarify the importance of using the \"lastmod\" value to reflect the date and time of the last significant update to a page.",
            "Links": [
                "https://twitter.com/rustybrick/status/1805602093845078350"
            ]
        },
        {
            "Title": "Google Search Console Validation Tools Use Different Crawler Than Live Googlebot",
            "Category": "Search Engine Optimization",
            "Description": "A reminder that Google Search Console's validation tools, such as the URL Inspection tool and Rich Results Test, utilize a different crawler (Google-InspectionTool) than the actual Googlebot used for indexing websites.",
            "Links": [
                "https://twitter.com/aleyda/status/1805600174108004714"
            ]
        },
        {
            "Title": "Google to Automate Lead Credits for Local Services Ads",
            "Category": "Search Engine Marketing",
            "Description": "Google will be automating lead credits for Local Services Ads starting next month. This change has sparked debate about its potential benefits and drawbacks for advertisers.",
            "Links": [
                "https://twitter.com/rustybrick/status/1805598318896332935",
                "https://twitter.com/rustybrick/status/1805595078078964017",
                "https://twitter.com/rustybrick/status/1805559311600697616"
            ]
        },
        {
            "Title": "Affiliate Marketers Urged to Monitor SERP Feature Changes and AI Overviews",
            "Category": "Search Engine Marketing",
            "Description": "Affiliate marketers, particularly those in the finance sector, need to closely observe changes in SERP features and the increasing use of AI-generated overviews for important queries.",
            "Links": [
                "https://twitter.com/glenngabe/status/1805581061654532210"
            ]
        },
        {
            "Title": "YouTube Tests \"Hype\" Feature for Boosting Videos in \"Explore\" Section",
            "Category": "Social Media & Content Marketing",
            "Description": "YouTube is experimenting with a new feature called \"Hype\" that allows viewers to promote videos in the \"Explore\" section. However, it's important to note that \"Hypes\" will not influence YouTube's search and discovery system.",
            "Links": [
                "https://twitter.com/glenngabe/status/1805571245099946295"
            ]
        },
        {
            "Title": "Amazon Developing AI Chatbot \"Metis\" to Rival ChatGPT",
            "Category": "Artificial Intelligence",
            "Description": "Amazon is reportedly working on an AI-powered chatbot codenamed \"Metis\" designed to compete with ChatGPT. The chatbot is expected to leverage Retrieval Augmented Generation (RAG) for up-to-date responses and is tentatively slated for a September launch.",
            "Links": [
                "https://twitter.com/glenngabe/status/1805569772421083596"
            ]
        },
        {
            "Title": "Google Increases AI Overviews for Health Queries After Brief Reduction",
            "Category": "Search Engine Optimization",
            "Description": "Google Search is once again displaying more AI-generated overviews for health-related search queries after temporarily scaling back their presence.",
            "Links": [
                "https://twitter.com/rustybrick/status/1805569377825153375"
            ]
        },
        {
            "Title": "Google Developing Customizable Chatbots, Potentially Modeled After Celebrities",
            "Category": "Artificial Intelligence",
            "Description": "Google is reportedly developing a product that enables users to create personalized chatbots, with the possibility of modeling them after celebrities. The product is expected to launch as early as 2024.",
            "Links": [
                "https://twitter.com/glenngabe/status/1805568913867968701"
            ]
        },
        {
            "Title": "Google's Credit Card Carousels and Widgets Could Disrupt Affiliate Marketing",
            "Category": "Search Engine Marketing",
            "Description": "Google's introduction of credit card carousels and widgets in search results has the potential to significantly impact the credit card affiliate marketing industry.",
            "Links": [
                "https://twitter.com/rustybrick/status/1805566861439820082"
            ]
        },
        {
            "Title": "Google Experiments with New Sitelink Formats and Designs",
            "Category": "Search Engine Optimization",
            "Description": "Google is testing various sitelink formats and designs in search results, incorporating different colors, shapes, and visual elements.",
            "Links": [
                "https://twitter.com/rustybrick/status/1805564344849121383"
            ]
        },
        {
            "Title": "Google Adds Guidance for Marking Up Multiple Items on Category Pages with Structured Data",
            "Category": "Search Engine Optimization",
            "Description": "Google has updated its structured data documentation with new guidance on how to mark up category pages containing numerous items using structured data. This includes examples for paginated content and infinite scroll.",
            "Links": [
                "https://twitter.com/rustybrick/status/1805303878524756302",
                "https://www.seroundtable.com/google-sd-carousel-markup-multiple-items-oncategory-pages-37608.html"
            ]
        },
        {
            "Title": "Google Using AI Overviews for Google Business Profile Descriptions",
            "Category": "Search Engine Optimization",
            "Description": "Google is now utilizing AI-generated overviews for Google Business Profile descriptions, raising concerns and discussions within the SEO community.",
            "Links": [
                "https://twitter.com/rustybrick/status/1805300103785156946"
            ]
        },
        {
            "Title": "Shopify Introduces AI-Powered Tools for Merchants, Including Chatbot \"Sidekick\"",
            "Category": "E-commerce & Artificial Intelligence",
            "Description": "Shopify unveils a suite of AI-focused updates for merchants, including suggested replies, product categorization, and the launch of its AI chatbot, \"Sidekick,\" in early access. However, concerns arise regarding the potential for misuse and inaccurate AI-generated content.",
            "Links": [
                "https://twitter.com/glenngabe/status/1805279337563963643",
                "https://twitter.com/glenngabe/status/1804849175269445782"
            ]
        },
        {
            "Title": "Oracle's Advertising Business Decline Leads to Layoffs and Industry Uncertainty",
            "Category": "Business & Finance",
            "Description": "The decline of Oracle's advertising business is resulting in layoffs and creating uncertainty within the advertising industry.",
            "Links": [
                "https://digiday.com/marketing/as-oracles-ad-business-collapses-layoffs-and-uncertainty-ripple-through-the-industry/"
            ]
        },
        {
            "Title": "Marketer Preparedness for Post-Cookie World Declines by 23% Since 2022",
            "Category": "Digital Marketing & Privacy",
            "Description": "Marketers are showing a decline in preparedness for the phasing out of third-party cookies, with a 23% drop in readiness compared to 2022. This highlights the challenges businesses face in adapting to a privacy-focused digital advertising landscape.",
            "Links": [
                "https://digiday.com/marketing/considerably-less-ready-marketers-post-cookie-preparedness-has-dropped-by-23-since-2022/"
            ]
        },
        {
            "Title": "TikTok Shop's Rapid Growth Raises Concerns for Amazon and Google",
            "Category": "E-commerce & Social Media",
            "Description": "TikTok Shop is experiencing significant growth, with orders increasing by 13% between April and May. TikTok's e-commerce expansion, including hiring hundreds of employees in the US, is seen as a potential threat to established players like Amazon and Google.",
            "Links": [
                "https://twitter.com/glenngabe/status/1805933615877902787"
            ]
        }
    ],
    "date": "2024-06-26"
}