{
    "data": [
        {
            "Title": "Google Search Console Experiencing Delays",
            "Category": "Search Engine Optimization",
            "Description": "Google Search Console is experiencing significant delays in reporting, with performance reports lagging by several hours. Google has acknowledged the issue and is working on a fix.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808572918936306105",
                "https://twitter.com/rustybrick/status/1808561585377480780",
                "https://www.seroundtable.com/google-search-console-delays-is-not-a-google-core-update-37668.html"
            ]
        },
        {
            "Title": "Study Finds Over Half of Google Searches End Without a Click",
            "Category": "Search Engine Optimization",
            "Description": "A new study has revealed that 58.5% of Google searches now result in zero clicks, highlighting the increasing prevalence of featured snippets and other search features that provide answers directly on the results page.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808569144167838126",
                "https://twitter.com/rustybrick/status/1808508746525466972",
                "https://twitter.com/aleyda/status/1808141221409313152"
            ]
        },
        {
            "Title": "Google Testing \"Current Styles\" Carousel in Search Results",
            "Category": "Search Engine Optimization",
            "Description": "Google is experimenting with a new \"current styles\" carousel in its search results, potentially impacting how users discover and engage with fashion and trend-related content.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808565369248100511",
                "https://twitter.com/rustybrick/status/1808504971463110784"
            ]
        },
        {
            "Title": "Google Ads Updates Brand Exclusion Controls and Ad Policies",
            "Category": "Digital Advertising",
            "Description": "Google Ads has introduced new brand exclusion controls, but they are not yet fully effective in preventing ads from showing for unrelated brands. Additionally, Google Ads will now allow ads for Daily Fantasy Sports and lottery couriers in many states. The platform has also added a new political campaign setting for AI-generated content.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808557819354100058",
                "https://twitter.com/rustybrick/status/1808497421405872549",
                "https://twitter.com/rustybrick/status/1808132265408618713"
            ]
        },
        {
            "Title": "Cloudflare Enables One-Click Blocking of AI Crawlers",
            "Category": "Artificial Intelligence",
            "Description": "Cloudflare has released a new feature that allows users to block AI crawlers from accessing their websites with a single click, providing website owners with more control over their data.",
            "Links": [
                "https://twitter.com/rustybrick/status/1808623814714032504"
            ]
        },
        {
            "Title": "Perplexity AI Enhances Search Engine with Multi-Step Reasoning",
            "Category": "Artificial Intelligence",
            "Description": "Google competitor Perplexity AI has launched an upgraded Pro Search with multi-step reasoning capabilities, allowing it to handle more complex and nuanced search queries.",
            "Links": [
                "https://twitter.com/glenngabe/status/1808496154151145622"
            ]
        },
        {
            "Title": "YouTube Expands Channel Handles to 75 Languages",
            "Category": "Social Media",
            "Description": "YouTube is expanding channel handles to 75 languages, allowing creators and viewers to personalize their handles in their preferred language. This move aims to make the platform more accessible and inclusive for a global audience.",
            "Links": [
                "https://twitter.com/glenngabe/status/1808493555326857341"
            ]
        },
        {
            "Title": "Snapchat Introduces New Features, Including Sub-Second Snaps",
            "Category": "Social Media",
            "Description": "Snapchat has rolled out new features, including the ability to send Snaps that last less than 0.5 seconds. This update provides users with more creative control and options for sharing ephemeral content.",
            "Links": [
                "https://twitter.com/glenngabe/status/1808491177970172306"
            ]
        },
        {
            "Title": "Google Prioritizing AI-Generated Content Raises Concerns",
            "Category": "Artificial Intelligence",
            "Description": "There are growing concerns that Google is prioritizing AI-generated content, including spam, over original reporting in its search results. This shift has raised alarm bells among content creators and publishers who fear losing traffic and revenue.",
            "Links": [
                "https://www.firstpost.com/tech/google-is-prioritising-ai-generated-seo-spam-content-over-original-content-in-search-results-13788775.html",
                "https://twitter.com/rustybrick/status/1808202503043100839"
            ]
        },
        {
            "Title": "Bing Updates Webmaster Guidelines to Address Prompt Injection Attacks",
            "Category": "Search Engine Optimization",
            "Description": "Bing has added a new guideline to its Bing Webmaster Guidelines addressing \"Prompt Injection,\" a type of cyberattack targeting large language models (LLMs) used in AI-powered search engines and chatbots.",
            "Links": [
                "https://twitter.com/rustybrick/status/1807733638752055558",
                "https://www.seroundtable.com/prompt-injection-bing-webmaster-guidelines-37650.html"
            ]
        }
    ],
    "date": "2024-07-04"
}