{
    "data": [
        {
            "Title": "Google Search Console Now Supports Configuring Shipping &amp; Returns",
            "Category": "SEO",
            "Description": "You can configure your shipping and returns directly in Search Console",
            "Links": [
                "https://twitter.com/aleyda/status/1812577624981701034"
            ]
        },
        {
            "Title": "Google Renders All Pages For Search, Including JavaScript-Heavy Sites",
            "Category": "SEO",
            "Description": "Google renders all webpages, including JavaScript-heavy sites, for search indexing.",
            "Links": [
                "https://www.searchenginejournal.com/google-renders-all-pages-for-search-including-javascript-heavy-sites/522103/",
                "https://twitter.com/glenngabe/status/1812119592371630503"
            ]
        },
        {
            "Title": "Google's Indifference To Site Publishers Explained",
            "Category": "SEO",
            "Description": "Google inadvertently reveals reasons that explain their seeming indifference to publishers hurt by algorithm updates",
            "Links": [
                "https://www.searchenginejournal.com/googles-indifference-to-site-publishers-explained/522143/"
            ]
        },
        {
            "Title": "Google Says There's No Way To Block Content From Discover Feed",
            "Category": "SEO",
            "Description": "Google confirms no option to block content from Discover, unlike News, highlighting limitations in crawling control.",
            "Links": [
                "https://www.searchenginejournal.com/google-says-theres-no-way-to-block-content-from-discover-feed/522148/"
            ]
        },
        {
            "Title": "Why Use Google's Disavow Tool?",
            "Category": "SEO",
            "Description": "There's one possible reason to disavow inbound links in circa 2024.",
            "Links": [
                "https://www.practicalecommerce.com/why-use-googles-disavow-tool"
            ]
        },
        {
            "Title": "Google Says Having Massive Disavow Lists &amp; Removing Them Should Not Worry You",
            "Category": "SEO",
            "Description": "John Mueller from Google was asked if you should worry that massive link disavow lists can hurt you negatively and also if you remove the list that it might also hurt you.  John said you should not be worried at all, when he was asked how worried should you be, he said \"zero.\"",
            "Links": [
                "https://www.seroundtable.com/massive-google-disavow-lists-37726.html"
            ]
        },
        {
            "Title": "Schema.org Gets Design Upgrade",
            "Category": "SEO",
            "Description": "Schema.org has a new design, it seems like the design went live this week. The Schema.org validator also looks fresh and new. It is unclear if there were any other changes made, outside of the design update.",
            "Links": [
                "https://www.seroundtable.com/schema-org-design-update-37710.html"
            ]
        },
        {
            "Title": "How Google AI Overview Selects and Links to Sources",
            "Category": "SEO",
            "Description": "Good post from @richsangerSEO about why content that's not ranking well for a query could be in AI overviews. This is similar to what @RyanJones covered at SMX Advanced -> How Google AI Overview Selects and Links to Sources \"The AI Overview process for selecting documents…",
            "Links": [
                "https://twitter.com/glenngabe/status/1812108902005342256"
            ]
        },
        {
            "Title": "Google AI Overviews only show for 7% of queries",
            "Category": "SEO",
            "Description": "Google AI Overviews only show for 7% of queries",
            "Links": [
                "https://twitter.com/aleyda/status/1812577624981701034"
            ]
        },
        {
            "Title": "Google Search Now Supports Labeling AI-Generated Or Manipulated Images",
            "Category": "SEO",
            "Description": "Google Search Now Supports Labeling AI-Generated Or Manipulated Images",
            "Links": [
                "https://twitter.com/aleyda/status/1812577624981701034"
            ]
        },
        {
            "Title": "Developing a killer SEO content strategy? Don’t forget the humans in the wake of AI",
            "Category": "SEO",
            "Description": "Richard George takes on the debate about the role of humans in content creation.",
            "Links": [
                "https://www.prolificnorth.co.uk/feature/developing-a-killer-seo-content-strategy-dont-forget-the-humans-in-the-wake-of-ai/"
            ]
        },
        {
            "Title": "Winning at SEO: Expert Link Building Tips for 2024",
            "Category": "SEO",
            "Description": "The onslaught of artificial intelligence has wreaked havoc on the way content is created and perceived. Optimizing for search engines has undergone many changes but one of the factors that remain critical to optimization is backlinking. SERP ratings are highly impacted by backlinks as per 58.1% SEOs. With quality link building, this is achievable. In […]",
            "Links": [
                "https://thegww.com/winning-at-seo-expert-link-building-tips-for-2024/"
            ]
        },
        {
            "Title": "Best SEO services in 2024",
            "Category": "SEO",
            "Description": "Explore the best SEO services to keep your website optimized and generating leads or sales.",
            "Links": [
                "https://www.cnn.com/cnn-underscored/money/best-seo-services"
            ]
        },
        {
            "Title": "How Advisors Can Fix Holes in Their Digital Marketing and Do SEO Right",
            "Category": "SEO",
            "Description": "Snappy Kraken CEO Robert Sofia reveals advisors' biggest mistakes and the best way to drive referrals, according to research.",
            "Links": [
                "https://www.thinkadvisor.com/2024/06/20/how-to-fix-holes-in-your-digital-marketing-and-do-seo-the-right-way/"
            ]
        },
        {
            "Title": "Web Image Optimization: Best Practices for Speed and SEO in 2024",
            "Category": "SEO",
            "Description": "Discover essential web image optimization techniques for 2024. Learn best practices for image compression, responsive images, lazy loading, and serving images.",
            "Links": [
                "https://hackernoon.com/web-image-optimization-best-practices-for-speed-and-seo-in-2024"
            ]
        },
        {
            "Title": "Digital PR World Offering Guarantee SEO Ranking Services",
            "Category": "SEO",
            "Description": "'Digital PR World Offering Guarantee SEO Ranking Services'",
            "Links": [
                "https://www.ahmedabadmirror.com/digital-pr-world-offering-guarantee-seo-ranking-services/81871660.html"
            ]
        },
        {
            "Title": "Rogue SEO Specialists Defraud High DA Publishers: A Growing Concern",
            "Category": "SEO",
            "Description": "In the intricate world of digital marketing, Search Engine Optimization (SEO) stands as a cornerstone for enhancing online visibility and driving organic",
            "Links": [
                "https://bronx.com/rogue-seo-specialists-defraud-high-da-publishers-a-growing-concern/"
            ]
        },
        {
            "Title": "Ahrefs vs Semrush: Which SEO Tool Is a Better Choice?",
            "Category": "SEO Tools",
            "Description": "Here's our comprehensive Ahrefs vs Semrush duel. Which SEO tool to pick, Semrush or Ahrefs? Find out in our first-hand comparison.",
            "Links": [
                "https://gizmodo.com/seo/best-tools/ahrefs-vs-semrush"
            ]
        },
        {
            "Title": "Google To Have More Creator Type Meetings",
            "Category": "Google &amp; Creators",
            "Description": "Brandon Saltalamacchia, the founder of Retro Dodo, covered his meeting he had with Danny Sullivan at Google - he covered it under the title A Brief Meeting With Google After The Apocalypse. Danny Sullivan said later that this was the second time he recently had such a meeting and he is working on setting up the third one soon.",
            "Links": [
                "https://www.seroundtable.com/google-creator-meetings-37727.html"
            ]
        },
        {
            "Title": "Bing's index now also powers ChatGPT (and thus, soon Apple's Siri), Meta AI, LinkedIn AI and Microsoft Copilot.",
            "Category": "AI &amp; Search",
            "Description": "I can't believe I am about to write this but... the Bing index is crucial in the future of SEO. Why? It's not about Bing the search engine. Bing's index now also powers ChatGPT (and thus, soon Apple's Siri), Meta AI, LinkedIn AI and Microsoft Copilot.",
            "Links": [
                "https://twitter.com/jes_scholz/status/1812693442558087653"
            ]
        },
        {
            "Title": "OpenAI is working on a project code named 'Strawberry', formerly known as Q*",
            "Category": "AI &amp; Search",
            "Description": "\"Navigate the internet autonomously and reliably to perform deep research\" -> OpenAI is working on a project code named 'Strawberry', formerly known as Q*, which aims to improve AI model reasoning capabilities \"The document describes a project that uses Strawberry models with…",
            "Links": [
                "https://twitter.com/glenngabe/status/1812104709068501475"
            ]
        },
        {
            "Title": "New Senate bill seeks to protect artists’ and journalists’ content from AI use.",
            "Category": "AI &amp; Content Ownership",
            "Description": "COPIED Act -> New Senate bill seeks to protect artists’ and journalists’ content from AI use. Stands for \"Content Origin Protection and Integrity from Edited and Deepfaked Media Act\" \"The bill is designed to give content owners, such as journalists, newspapers, artists,…",
            "Links": [
                "https://twitter.com/glenngabe/status/1812106752978022572"
            ]
        },
        {
            "Title": "Thrasio Slims Down in Comeback Attempt",
            "Category": "Ecommerce",
            "Description": "The Amazon aggregator averaged one acquisition per week during the pandemic. Then it filed for bankruptcy.",
            "Links": [
                "https://www.practicalecommerce.com/thrasio-slims-down-in-comeback-attempt"
            ]
        },
        {
            "Title": "Ad execs sound the alarm over Google's risky Privacy Sandbox terms",
            "Category": "Advertising &amp; Privacy",
            "Description": "Google's Privacy Sandbox outage sparks contractual concerns since its terms of service leave users footing the bill even when it doesn't work.",
            "Links": [
                "https://digiday.com/marketing/ad-execs-sound-the-alarm-over-googles-risky-privacy-sandbox-terms/"
            ]
        },
        {
            "Title": "Retail media has become a full-funnel play for media agencies",
            "Category": "Advertising &amp; Retail Media",
            "Description": "Holding companies as well as independents have stepped up their resource-building around retail media and the broader catch-all of commerce media — although there’s a lack of standardization around the terminology used in the space.",
            "Links": [
                "https://digiday.com/media-buying/media-buying-briefing-retail-media-has-become-a-full-funnel-play-for-media-agencies/"
            ]
        },
        {
            "Title": "Confessions of a DTC investor on the difficulty of dealing with the 'increasingly common' founder-influencer",
            "Category": "DTC &amp; Influencer Marketing",
            "Description": "In the latest edition of our Confessions series, in which we trade anonymity for candor, we hear from a DTC investor on what it’s like to work with founder-influencers and why it’s a difficult balance to navigate.",
            "Links": [
                "https://digiday.com/marketing/confessions-of-a-dtc-investor-on-the-difficulty-of-dealing-with-the-increasingly-common-founder-influencer/"
            ]
        },
        {
            "Title": "'Everything is AI now': Amid AI boom, agencies navigate data security, stability and fairness",
            "Category": "AI &amp; Marketing Agencies",
            "Description": "AI tools and platforms, whether they're built on generative AI or glorified machine learning, have flooded the marketplace. In response, agencies are wading through them via sandboxes, internal AI task forces and client contracts.",
            "Links": [
                "https://digiday.com/marketing/everything-is-ai-now-amid-ai-boom-agencies-navigate-data-security-stability-and-fairness/"
            ]
        },
        {
            "Title": "Clients want agencies to deliver industry expertise, agility and empathy, new research finds",
            "Category": "Marketing Agencies &amp; Client Expectations",
            "Description": "With a number of businesses run by millennials and Gen Z, marketers are seeking not just a vendor when working with agencies – but a true collaborator. This seems to be especially true in the case of B2B marketing when they are on both the consumer and buying sides.",
            "Links": [
                "https://digiday.com/media-buying/clients-want-agencies-to-deliver-industry-expertise-agility-and-empathy-new-research-finds/"
            ]
        },
        {
            "Title": "Why sustainability is 'not a priority' for marketers right now",
            "Category": "Marketing &amp; Sustainability",
            "Description": "Anecdotally, there have been noticeably fewer requests from marketers on ways to market sustainability efforts in recent months, according to agency execs, who say that requests had been commonplace in the late 2010s and early 2020s.",
            "Links": [
                "https://digiday.com/marketing/marketing-briefing-why-sustainability-is-not-a-priority-for-marketers-right-now/"
            ]
        },
        {
            "Title": "Why longer videos are becoming more commonplace on YouTube",
            "Category": "YouTube &amp; Video Content",
            "Description": "Short-form videos may have surged in popularity over the past several years, but the long-form video format is on the comeback trail.",
            "Links": [
                "https://digiday.com/future-of-tv/why-longer-videos-are-becoming-more-commonplace-on-youtube/"
            ]
        },
        {
            "Title": "Tubi hits growth spurt, but isn't part of the streaming wars, CMO Nicole Parlapiano says",
            "Category": "Streaming &amp; Entertainment",
            "Description": "On the latest episode of the Digiday Podcast, Tubi CMO Nicole Parlapiano shares her perspective on the so-called streaming wars, pitching Tubi’s multicultural viewers and the streaming platform’s growth track.",
            "Links": [
                "https://digiday.com/podcasts/were-watching-the-war-tubi-hits-growth-spurt-but-isnt-part-of-the-streaming-wars-cmo-nicole-parlapiano-says/"
            ]
        },
        {
            "Title": "Why angel investor Matthew Ball still believes in the metaverse",
            "Category": "Metaverse &amp; Investment",
            "Description": "Matthew Ball’s 2022 book “The Metaverse: And How It Will Revolutionize Everything” was a national bestseller in the U.S. and U.K. On July 23, he plans to publish the second edition of the book.",
            "Links": [
                "https://digiday.com/marketing/why-angel-investor-matthew-ball-still-believes-in-the-metaverse/"
            ]
        },
        {
            "Title": "Platforms struggle with misinformation and exploitation amid Trump assassination attempt",
            "Category": "Social Media &amp; Misinformation",
            "Description": "The assassination attempt on former President Donald Trump starkly highlights the razor-thin line between profit and ethics that platforms are precariously tightrope-walking as the presidential race heats up.",
            "Links": [
                "https://digiday.com/marketing/platforms-struggle-with-misinformation-and-exploitation-amid-trump-assassination-attempt/"
            ]
        }
    ],
    "date": "2024-07-16"
}