{
    "data": [
        {
            "Title": "Google Will Not Deprecate Third-Party Cookies in Chrome",
            "Category": "Digital Marketing",
            "Description": "After much back and forth, Google has decided to keep third-party cookies in its Chrome browser. Turns out all the fuss over the years wasn’t in vain after all; the ad industry’s cries have finally been heard.",
            "Links": [
                "https://digiday.com/marketing/after-years-of-uncertainty-google-says-it-wont-be-deprecating-third-party-cookies-in-chrome/",
                "https://digiday.com/marketing/digiday-research-publishers-anticipate-having-more-time-with-third-party-cookies-than-marketers/"
            ]
        },
        {
            "Title": "Google's Algorithms Combat Negative SEO Attempts",
            "Category": "SEO",
            "Description": "Discover how Google's advanced algorithms are effectively working to combat and neutralize the impact of negative SEO efforts on search result rankings.",
            "Links": [
                "https://www.dmnews.com/googles-algorithms-counter-negative-seo-attempts/"
            ]
        },
        {
            "Title": "Google Tests AI-Generated Images in Knowledge Panels",
            "Category": "Search Engine Optimization",
            "Description": "Google can show AI-generated images in its knowledge panels",
            "Links": [
                "https://twitter.com/rustybrick/status/1815346300474265728"
            ]
        },
        {
            "Title": "Bing Tests Related Searches at Top of Results Page",
            "Category": "Search",
            "Description": "Bing is testing placing the related searches at the top of the search results page, directly under the search bar.  The searches are exactly what you would see in the bottom but in a different format at the top.",
            "Links": [
                "https://www.seroundtable.com/bing-testing-related-searches-at-top-37757.html",
                "https://twitter.com/rustybrick/status/1815343784118604178"
            ]
        },
        {
            "Title": "Google Notes Search Data Export Deadline Nears",
            "Category": "Search",
            "Description": "Google updates their documentation to alert users of their final chance to download their Notes on Search data",
            "Links": [
                "https://www.searchenginejournal.com/google-notes-search-data/522584/"
            ]
        },
        {
            "Title": "Google's New Full-Page Warnings for \"Risky\" Downloads",
            "Category": "Browsers",
            "Description": "Chrome will start showing full-page warnings for \"risky\" downloads soon \"The new full-page \"download warning\" introduced in recent Chrome builds gives users a chance to restore the aborted download process, although Google is asking for a reason. Google wants users to specify…",
            "Links": [
                "https://twitter.com/glenngabe/status/1814646228950319605"
            ]
        },
        {
            "Title": "Google's Gemini AI Assistant May Be Coming to Smart Glasses",
            "Category": "Artificial Intelligence",
            "Description": "Gemini in glasses. And that move could be helping drive Zuckerberg to invest billions in EssilorLuxottica -> Google recently approached EssilorLuxottica's leadership about putting its Gemini AI assistant in future smart glasses",
            "Links": [
                "https://twitter.com/glenngabe/status/1814640990159872464"
            ]
        },
        {
            "Title": "Google's AI Overviews Get New Features: Saving and Link Treatment",
            "Category": "Search",
            "Description": "AI Overviews Update: I saw the option in labs to SAVE my AI overviews. That button saves AI overviews in a private collection in the Google Search App. There was a button for saving, then I saw a message once saved, and then you could access the collection like any other in the…",
            "Links": [
                "https://twitter.com/glenngabe/status/1814985457261772992",
                "https://twitter.com/rustybrick/status/1815351333714571744",
                "https://twitter.com/glenngabe/status/1815003276665852403"
            ]
        }
    ],
    "date": "2024-07-23"
}