{
    "data": [
        {
            "Title": "Gmail rolling out Gemini-powered Summarize to Android, iOS",
            "Category": "AI & Search",
            "Description": "To date, the primary AI feature in mobile Gmail has been Help me write. Gmail is now gaining a Gemini-powered “Summarize this email” button that appears underneath the subject line.",
            "Links": [
                "https://twitter.com/glenngabe/status/1805321953118765429"
            ]
        },
        {
            "Title": "Meta is tagging real photos as ‘Made with AI,’ say photographers",
            "Category": "AI & Search",
            "Description": "Plenty of other photographers have raised concerns over their images having been wrongly tagged with the “Made with AI” label. Their point is that simply editing a photo with a tool should…",
            "Links": [
                "https://twitter.com/glenngabe/status/1805322864607871129"
            ]
        },
        {
            "Title": "Google execs Pichai, Brin must sit for questioning in digital ads lawsuit",
            "Category": "Antitrust",
            "Description": "Google execs Pichai, Brin must sit for questioning in digital ads lawsuit reuters.com/legal/transact…",
            "Links": [
                "https://twitter.com/rustybrick/status/1805316605771235428"
            ]
        },
        {
            "Title": "Google Ads may bring Automatically Created Assets to the ad level",
            "Category": "Advertising & Marketing",
            "Description": "Google Ads may bring Automatically Created Assets to the ad level seroundtable.com/google-ads-aut…",
            "Links": [
                "https://twitter.com/rustybrick/status/1805311428188061917",
                "https://twitter.com/rustybrick/status/1805251030134952015",
                "https://twitter.com/rustybrick/status/1805206989972308058"
            ]
        },
        {
            "Title": "Google discusses the issues using JavaScript for structured data with Google Merchant Center",
            "Category": "SEO",
            "Description": "ICYMI: Google discusses the issues using JavaScript for structured data with Google Merchant Center seroundtable.com/google-warns-j…",
            "Links": [
                "https://twitter.com/rustybrick/status/1805311428544336169"
            ]
        },
        {
            "Title": "Google Perspectives now with Instagram posts",
            "Category": "SEO",
            "Description": "Google Perspectives now with Instagram posts seroundtable.com/google-perspec…",
            "Links": [
                "https://twitter.com/rustybrick/status/1805307653364793599",
                "https://twitter.com/rustybrick/status/1805247255353725028",
                "https://twitter.com/rustybrick/status/1805204473435820271"
            ]
        },
        {
            "Title": "Google adds new guidance for structured data carousel (beta)",
            "Category": "SEO",
            "Description": "Google adds new guidance for structured data carousel (beta) help docs on how to markup multiple items on a category page seroundtable.com/google-sd-caro…",
            "Links": [
                "https://twitter.com/rustybrick/status/1805303878524756302",
                "https://twitter.com/rustybrick/status/1805243480387785148",
                "https://twitter.com/rustybrick/status/1805201956920852736",
                "https://www.seroundtable.com/google-sd-carousel-markup-multiple-items-oncategory-pages-37608.html"
            ]
        },
        {
            "Title": "Google AI Overviews now used for Google Business Profiles descriptions",
            "Category": "AI & Search",
            "Description": "Google AI Overviews now used for Google Business Profiles descriptions - scary seroundtable.com/google-busines…",
            "Links": [
                "https://twitter.com/rustybrick/status/1805300103785156946",
                "https://twitter.com/rustybrick/status/1805239706004693434",
                "https://twitter.com/rustybrick/status/1805199440317153653"
            ]
        },
        {
            "Title": "When you should fix 404 errors according to Google",
            "Category": "SEO",
            "Description": "ICYMI: When you should fix 404 errors according to Google... seroundtable.com/google-fix-pag…",
            "Links": [
                "https://twitter.com/rustybrick/status/1805296328597291096",
                "https://twitter.com/rustybrick/status/1805235930711904720",
                "https://twitter.com/rustybrick/status/1805196923965510117"
            ]
        },
        {
            "Title": "Google red Fiat car and Google street sign",
            "Category": "Off Topic",
            "Description": "ICYMI: Google red Fiat car and Google street sign seroundtable.com/photos/google-…",
            "Links": [
                "https://twitter.com/rustybrick/status/1805292553920471077"
            ]
        },
        {
            "Title": "Google Podcasts closes, and joins the graveyard",
            "Category": "Podcasting",
            "Description": "Remember to update your links if you are still linking to your show on Google podcasts -> Google Podcasts closes, and joins the graveyard You’ve got until the end of July 30 to get your podcast stats from Google Podcasts Manager. That website will also help submit your RSS…",
            "Links": [
                "https://twitter.com/glenngabe/status/1805281832088617009"
            ]
        },
        {
            "Title": "The RIAA sues AI music services Suno and Udio over alleged mass copyright infringement",
            "Category": "AI & Search",
            "Description": "More AI lawsuits -> The RIAA sues AI music services Suno and Udio over alleged mass copyright infringement and claims they have tried to hide the scope of their infringement A group of record labels including the big three — Universal Music Group (UMG), Sony Music…",
            "Links": [
                "https://twitter.com/glenngabe/status/1805280088792924479"
            ]
        },
        {
            "Title": "Shopify unveils AI-focused updates for merchants",
            "Category": "Ecommerce",
            "Description": "I just shared about a funny Shopify AI description situation yesterday :) -> Shopify unveils AI-focused updates for merchants, including suggested replies and product categorization, and launches its AI chatbot Sidekick in early access Sidekick, which the company first…",
            "Links": [
                "https://twitter.com/glenngabe/status/1805279337563963643"
            ]
        },
        {
            "Title": "Google bolding domain names in the search results",
            "Category": "SEO",
            "Description": "Again, again, Google bolding domain names in the search results - added this example to my older story seroundtable.com/google-search-…",
            "Links": [
                "https://twitter.com/rustybrick/status/1805268654172373352"
            ]
        },
        {
            "Title": "Reflections and revelations: Cannes ad execs confront responsibility amid industry chaos",
            "Category": "Advertising & Marketing",
            "Description": "Responsibility isn’t usually a strong suit for ad execs at Cannes, but this year, it took center stage.",
            "Links": [
                "https://digiday.com/marketing/reflections-and-revelations-cannes-ad-execs-confront-responsibility-amid-industry-chaos/"
            ]
        },
        {
            "Title": "3 Ways to Depersonalize Google SERPs",
            "Category": "SEO",
            "Description": "Google search results vary by user based on search history, clicks, and more. Removing the personalization helps understand what others may see.",
            "Links": [
                "https://www.practicalecommerce.com/3-ways-to-depersonalize-google-serps"
            ]
        },
        {
            "Title": "It's New - June 24 - Google Spam update, indexing issues, structured data, local AI overviews, ACA changes & Google Map with LSAs",
            "Category": "SEO",
            "Description": "It's New - June 24 - Google Spam update, indexing issues, structured data, local AI overviews, ACA changes & Google Map with LSAs youtube.com/watch?v=QHwYdw… with @CrystalontheWeb @MordyOberstein @gregfinn",
            "Links": [
                "https://twitter.com/rustybrick/status/1805239436738797859"
            ]
        },
        {
            "Title": "Google’s delays aside, why marketers can’t pause post-cookie planning",
            "Category": "Advertising & Marketing",
            "Description": "While Google’s latest delay in deprecating third-party cookies in Chrome might offer some reprieve for teams still behind on post-cookies prep, it also underscores the intricate landscape of digital advertising. The delay, attributed to “ongoing challenges related to reconciling divergent feedback from the industry, regulators and developers” in a recent Digiday article, emphasizes the need […]",
            "Links": [
                "https://digiday.com/sponsored/googles-delays-aside-why-marketers-cant-pause-post-cookie-planning/"
            ]
        },
        {
            "Title": "Google Business Profile Reviews",
            "Category": "SEO",
            "Description": "It's live now. Make sure you know what's in your profile... Could be an embarrassing situation for some people. :) You can see an example below of reviews now showing in a Google profile. You cannot turn this off btw... You can delete your reviews, though.",
            "Links": [
                "https://twitter.com/glenngabe/status/1805217543784661006"
            ]
        },
        {
            "Title": "Google search change prompts Catena Media to scrap full-year forecast",
            "Category": "SEO",
            "Description": "'Site reputation abuse' in the (gaming) news -> Google search change prompts Catena Media to scrap full-year forecast \"The gaming affiliate group expects the change in algorithm to harm the effectiveness of some media partnerships.\" \"It said that changes to the organic search…",
            "Links": [
                "https://twitter.com/glenngabe/status/1805215820911419849"
            ]
        },
        {
            "Title": "ICYMI: SEO video recap covering Google June Spam update, Father’s Day Google search volatility, AI Overviews tracking and FAQs, Google Maps exploit, Google Ads credit cards, Applebot changes and much more",
            "Category": "SEO",
            "Description": "Catch up on last week with the ICYMI: SEO video recap covering Google June Spam update, Father’s Day Google search volatility, AI Overviews tracking and FAQs, Google Maps exploit, Google Ads credit cards, Applebot changes and much more youtube.com/watch?v=8XjTOR…",
            "Links": [
                "https://twitter.com/rustybrick/status/1805211268283875712"
            ]
        },
        {
            "Title": "Meta has held discussions with Apple to integrate its AI model with Apple Intelligence",
            "Category": "AI & Search",
            "Description": "Yep, sure sounds like you'll be able to choose your fav AI model for Apple's Jarvis (at least initially) -> Meta has held discussions with Apple to integrate its AI model with Apple Intelligence; Anthropic and Perplexity also discussed integrations with Apple \"Distribution is…",
            "Links": [
                "https://twitter.com/glenngabe/status/1805204306334761416"
            ]
        },
        {
            "Title": "Apple Intelligence Documentation",
            "Category": "AI & Search",
            "Description": "After Apple Intelligence was announced at WWDC, I shared about the new documentation published by Apple for blocking Applebot-Extended (to block Apple from using your content to train its AI models). Checking a number of top news publishers, I've only seen the NYT blocking it so…",
            "Links": [
                "https://twitter.com/glenngabe/status/1805203573178827100"
            ]
        },
        {
            "Title": "Reddit launches revamped conversation ads at Cannes 2024",
            "Category": "Advertising & Marketing",
            "Description": "The latest in Digital Marketing from today's #MarketingFOMO 👀👇 * Reddit launches revamped conversation ads at Cannes 2024 * Instacart expands shoppable ads to YouTube * Meta Announcements at Cannes Lions 2024: Introducing AI Chatbots, Messaging Tools, & Threads API * More…",
            "Links": [
                "https://twitter.com/aleyda/status/1805201592179736669"
            ]
        },
        {
            "Title": "Free SEO/PPC Job Board",
            "Category": "SEO",
            "Description": "If you haven’t seen it yet; there’s a new free job board for you to: * find seo/ppc roles * publish your seo/ppc roles adverts for free Check it out 👇",
            "Links": [
                "https://twitter.com/aleyda/status/1805169342339776817"
            ]
        },
        {
            "Title": "A Better Ecommerce Landing Page",
            "Category": "Ecommerce",
            "Description": "What if there was a simple formula to improve landing page conversions from ad campaigns? Turns out, there is.",
            "Links": [
                "https://www.practicalecommerce.com/a-better-ecommerce-landing-page"
            ]
        },
        {
            "Title": "Screaming Frog SEO Spider Update",
            "Category": "SEO",
            "Description": "Just released a small update to 20.2 of the @screamingfrog SEO Spider - screamingfrog.co.uk/seo-spider-20/…. Mainly small improvements & bug fixes with the latest release.",
            "Links": [
                "https://twitter.com/screamingfrog/status/1805140412899713101"
            ]
        },
        {
            "Title": "AI Briefing: How AI showed up at Cannes Lions 2024",
            "Category": "AI & Search",
            "Description": "Cannes Lions 2024 was full of AI-related news, onstage talks and off-record convos about humans, bots and the future of creativity.",
            "Links": [
                "https://digiday.com/media/ai-briefing-how-ai-showed-up-at-cannes-lions-2024/"
            ]
        },
        {
            "Title": "What you missed at Cannes Lions 2024",
            "Category": "Advertising & Marketing",
            "Description": "What you might've missed at Cannes Lions 2024.",
            "Links": [
                "https://digiday.com/media-buying/what-you-missed-at-cannes-lions-2024/"
            ]
        },
        {
            "Title": "The two types of influencer agencies, and why they have different appeal to holding companies",
            "Category": "Advertising & Marketing",
            "Description": "There are two ways to look at the emerging influencer marketing industry: the talent side and technology side of the business.",
            "Links": [
                "https://digiday.com/media-buying/media-buying-briefing-the-two-types-of-influencer-agencies-and-why-they-have-different-appeal-to-holding-companies/"
            ]
        },
        {
            "Title": "WTF is the Private Aggregation API in Google’s Privacy Sandbox?",
            "Category": "Advertising & Marketing",
            "Description": "The Private Aggregation API provides a means for marketers to receive reach and frequency reports post-cookie.",
            "Links": [
                "https://digiday.com/marketing/wtf-is-the-private-aggregation-api-in-googles-privacy-sandbox/"
            ]
        },
        {
            "Title": "At Cannes, publishers attempt to quell marketers' open programmatic apostasy",
            "Category": "Advertising & Marketing",
            "Description": "Not all of the conversations at Cannes were creative in nature.",
            "Links": [
                "https://digiday.com/media/at-cannes-publishers-attempt-to-quell-marketers-open-programmatic-apostasy/"
            ]
        },
        {
            "Title": "Under the skin of sunscreen challenger brand Vacation's email newsletter strategy",
            "Category": "Advertising & Marketing",
            "Description": "A curated approach to email could provide marketers with alternatives ahead of cookie deprecation.",
            "Links": [
                "https://digiday.com/marketing/under-the-skin-of-sunscreen-challenger-brand-vacations-email-newsletter-strategy/"
            ]
        },
        {
            "Title": "Why the 'year of gaming' might be the ad industry’s next 'year of mobile'",
            "Category": "Advertising & Marketing",
            "Description": "The fact that the much-anticipated “year of gaming” hasn’t happened yet is not necessarily a harbinger of doom for the gaming industry and its advertising dreams. Much like how mobile is now a standard advertising channel despite the lack of an agreed-upon “year of mobile,” the hype surrounding the concept of a “year of gaming” could simply fade away as gaming becomes a default method for individuals to socialize online and access digital content.",
            "Links": [
                "https://digiday.com/marketing/why-the-year-of-gaming-might-be-the-ad-industrys-next-year-of-mobile/"
            ]
        },
        {
            "Title": "Google Search Processed A Billion DMCA Takedowns In Four Months",
            "Category": "Copyright",
            "Description": "Google Search's takedown department is facing the busiest year ever. The all-time takedown total has just surged to nine billion, adding the latest billion in just four months. The list of most…",
            "Links": [
                "https://twitter.com/glenngabe/status/1804855872205504875"
            ]
        },
        {
            "Title": "Shopify AI Tool Usage",
            "Category": "Ecommerce",
            "Description": "Shopify rolled out AI tools for merchants in 2023, but that doesn't mean merchants will use them correctly. :) Here's the snippet for this ecommerce site's homepage. I wonder how many people are seeing that description and wondering if that's the actual site they want...",
            "Links": [
                "https://twitter.com/glenngabe/status/1804849175269445782"
            ]
        },
        {
            "Title": "Google's Role in Protecting Web Norms",
            "Category": "AI & Search",
            "Description": "Everyone always talks about Google, ai and search from the innovators dilemma pov. Can’t kill the golden goose. The more interesting angle is that Google is the only big consumer ai company with the incentive to protect the basic norms of the web.",
            "Links": [
                "https://twitter.com/bryanfcasey/status/1804844999437107229"
            ]
        },
        {
            "Title": "Sudden Spike in Indexing in GSC",
            "Category": "SEO",
            "Description": "If you see a sudden spike in indexing in GSC, and you're worried it could impact quality, it might be totally fine. I cover how the answer might be right under your nose (just a little further down the page in…",
            "Links": [
                "https://twitter.com/glenngabe/status/1804500627000582561"
            ]
        },
        {
            "Title": "Advanced SEO Scenarios",
            "Category": "SEO",
            "Description": "I was recently asked about “advanced” SEO. There are a few main scenarios that I see requiring more than the “basic” SEO skills due to the challenges / complexities they tend to have: 1. New (or far weaker) brand/site in very competitive search market, with the main challenge…",
            "Links": [
                "https://twitter.com/aleyda/status/1804496669758611638"
            ]
        },
        {
            "Title": "Google Patent for Chatbot Development",
            "Category": "AI & Search",
            "Description": "Create your Gemini-based chatbot using natural language -> Google is seeking to patent a system for chatbot development using “structured description-based” techniques. Google’s tech basically allows a user to create a fine-tuned chatbot for specific tasks using just natural…",
            "Links": [
                "https://twitter.com/glenngabe/status/1804494941588005218"
            ]
        },
        {
            "Title": "Google Turns Off Universal Analytics July 1",
            "Category": "Analytics",
            "Description": "I really do miss UA :) -> Google turns off Universal Analytics July 1: What you need to know *July 1: Users will lose access to Universal Analytics data and interface. *After July 1: All Universal Analytics data will be permanently deleted.",
            "Links": [
                "https://twitter.com/glenngabe/status/1804493203665555824"
            ]
        },
        {
            "Title": "Amazon Considering Monthly Fee for \"Remarkable Alexa\"",
            "Category": "Voice Assistants",
            "Description": "Uh, not sure many will pay for \"Remarkable Alexa\"?? -> Amazon has considered a $5 to $10 monthly price tag for a revamped Alexa with generative AI features, dubbed “Remarkable Alexa\" \"Known internally as “Banyan,” the project would represent the first major overhaul of the…",
            "Links": [
                "https://twitter.com/glenngabe/status/1804486666746318972"
            ]
        },
        {
            "Title": "Perplexity's Use of Third-Party Crawling",
            "Category": "AI & Search",
            "Description": "Oh boy, so a mysterious third-party is crawling and indexing your site and feeding that to Perplexity. How wonderful :) -> In response to plagiarism allegations, Perplexity CEO Aravind Srinivas says the company “is not ignoring” robots.txt, but does rely on third-party web…",
            "Links": [
                "https://twitter.com/glenngabe/status/1804485713276109036"
            ]
        },
        {
            "Title": "Apple Withholds Product Releases in EU Citing DMA Concerns",
            "Category": "Regulation",
            "Description": "\"Because the DMA allegedly forces it to downgrade the security of its products and services\" -> Apple will withhold the release of Apple Intelligence, iPhone Mirroring, and more in the EU this year, citing concerns about DMA's interoperability requirements \"Apple’s decision to…",
            "Links": [
                "https://twitter.com/glenngabe/status/1804484579849334823"
            ]
        },
        {
            "Title": "Digital Traffic Will Transform Sales in Manufacturing",
            "Category": "Manufacturing",
            "Description": "Manufacturers have to be seen to be noticed. SEO may not be magic, but you need the right ingredients to make the alchemy of content work for digital discovery.",
            "Links": [
                "https://www.americanmachinist.com/shop-operations/article/55090608/digital-traffic-will-transform-sales-in-manufacturing-machine-shop-marketing-july-2024"
            ]
        },
        {
            "Title": "GARM's lead sheds light on new standards for sustainability measurement in media",
            "Category": "Advertising & Marketing",
            "Description": "GARM's Rob Rakowitz shares how his team worked to create a Rosetta Stone for talking about and measuring sustainability in the advertising ecosystem.",
            "Links": [
                "https://digiday.com/podcasts/garms-lead-sheds-light-on-new-standards-for-sustainability-measurement-in-media/"
            ]
        },
        {
            "Title": "As Oracle’s ad business collapses, layoffs and uncertainty ripple through the industry",
            "Category": "Advertising & Marketing",
            "Description": "Whether it’s the privacy issues or its ad division's poor state, Oracle’s chances of recouping much — if anything — on what it invested are slim. That’s the kind of mark in history CEOs try to avoid at all costs.",
            "Links": [
                "https://digiday.com/marketing/as-oracles-ad-business-collapses-layoffs-and-uncertainty-ripple-through-the-industry/"
            ]
        },
        {
            "Title": "‘Considerably less ready’: Marketers’ post-cookie preparedness has dropped by 23% since 2022",
            "Category": "Advertising & Marketing",
            "Description": "Marketers might not be as ready for cookie deprecation as once thought.",
            "Links": [
                "https://digiday.com/marketing/considerably-less-ready-marketers-post-cookie-preparedness-has-dropped-by-23-since-2022/"
            ]
        }
    ],
    "date": "2024-06-25"
}