{
    "data": [
        {
            "Title": "Google August 2024 Core Update Causes Volatility",
            "Category": "Search Engine Optimization",
            "Description": "The Google August 2024 core update has finished rolling out, but search ranking volatility continues.  Experts are unsure if the volatility is related to the update or other factors. Google's Danny Sullivan stated that publishers may not recover previous traffic levels after an update.",
            "Links": [
                "https://www.seroundtable.com/video-09-06-2024-38028.html",
                "https://www.seroundtable.com/google-search-volatility-still-heated-38027.html",
                "https://twitter.com/rustybrick/status/1832026209309335982"
            ]
        },
        {
            "Title": "Google's Danny Sullivan Interviewed About August Core Update",
            "Category": "Search Engine Optimization",
            "Description": "Google's Search Liaison, Danny Sullivan, was interviewed about the August 2024 core update and the future of Google Search.  The interview covered topics such as Google's ranking systems and what content creators and search marketers need to know.",
            "Links": [
                "https://searchengineland.com/google-danny-sullivan-algorithm-update-recovery-uncertain-446317",
                "https://twitter.com/glenngabe/status/1832025115623633320",
                "https://twitter.com/rustybrick/status/1832023692232081682"
            ]
        },
        {
            "Title": "Microsoft Partners with StopNCII to Remove Non-Consensual Intimate Images from Bing",
            "Category": "Internet Safety",
            "Description": "Microsoft has partnered with StopNCII to remove non-consensual intimate images, including deepfakes, from Bing search results. This initiative aims to protect victims of revenge porn and combat the spread of harmful content online.",
            "Links": [
                "https://www.digitalinformationworld.com/2024/09/microsoft-bing-takes-major-step-against.html",
                "https://www.fudzilla.com/news/ai/59656-microsoft-wants-to-purge-deepfakes-from-bing",
                "http://gigazine.net/gsc_news/en/20240906-microsoft-removes-revenge-porn-bing/"
            ]
        },
        {
            "Title": "Hackers Use SEO to Spread Malware",
            "Category": "Cybersecurity",
            "Description": "Hackers are exploiting SEO campaigns to spread new malware, posing a threat to online safety and digital marketing efforts. This tactic highlights the increasing sophistication of cyberattacks and the need for enhanced security measures.",
            "Links": [
                "https://www.killerstartups.com/hackers-exploit-seo-campaign-to-spread-new-malware/"
            ]
        },
        {
            "Title": "UK CMA Objects to Google's Ad Tech Practices",
            "Category": "Antitrust",
            "Description": "The UK's Competition and Markets Authority (CMA) has raised concerns about Google's ad tech practices, alleging that the company favors its own services and harms competition in the online display advertising market.",
            "Links": [
                "https://twitter.com/Techmeme/status/1831995289642656115"
            ]
        }
    ],
    "date": "2024-09-08"
}