{
    "data": [
        {
            "Title": "Google Expands AI Overviews to More Countries and Users",
            "Category": "AI in Search",
            "Description": "Google is rolling out AI Overviews to users in six new countries: India, Japan, Mexico, Indonesia, Brazil, and the United Kingdom.  The company has also confirmed that it is showing AI Overviews to users in the US who are not signed in to their Google accounts, marking a significant expansion of the feature.",
            "Links": [
                "https://twitter.com/glenngabe/status/1824138132381376918",
                "https://www.engadget.com/ai/google-brings-the-ai-feature-that-told-americans-to-eat-rocks-to-six-more-countries-160025221.html",
                "https://searchengineland.com/google-ai-overviews-gains-new-citations-and-links-plus-more-445211"
            ]
        },
        {
            "Title": "Google AI Overviews Now Triggering for Logged-Out Users",
            "Category": "AI in Search",
            "Description": "Google is now testing AI Overviews in incognito mode, a significant change as this feature was previously not active for users not logged in. This rollout coincides with the August core update and has been confirmed by multiple sources.",
            "Links": [
                "https://twitter.com/glenngabe/status/1824132154072371567",
                "https://twitter.com/rustybrick/status/1824134011322511699",
                "https://twitter.com/rustybrick/status/1824136745857728528"
            ]
        },
        {
            "Title": "Google Updates AI Overviews with New Link Display and Features",
            "Category": "AI in Search",
            "Description": "Google has announced multiple updates to its AI Overviews, including a new way of displaying links on both desktop and mobile. The company is also testing additional features for AI Overviews, further integrating them into search results.",
            "Links": [
                "https://twitter.com/aleyda/status/1824161483384819906",
                "https://www.businessinsider.com/google-ai-overviews-search-engine-new-openai-searchgpt-competition-2024-8",
                "https://www.theverge.com/2024/8/15/24220581/google-search-ai-overviews-links-citations-expanded-rollout"
            ]
        },
        {
            "Title": "Google Search Experiencing Volatility Amidst August Core Update",
            "Category": "Search Engine Optimization",
            "Description": "Google Search rankings are showing high volatility, potentially attributed to the ongoing August core update. This volatility is impacting various aspects of search, including the display of Top Stories carousels for political figures and election news.",
            "Links": [
                "https://twitter.com/rustybrick/status/1824155597127757966",
                "https://twitter.com/glenngabe/status/1824136307691393444",
                "https://twitter.com/rustybrick/status/1824051159382057266"
            ]
        },
        {
            "Title": "Google Tests Displaying Up to 18 Shopping Ads in Search Results",
            "Category": "Search Engine Marketing",
            "Description": "Google Ads is experimenting with showing up to 18 shopping ads in search results, aiming to increase product visibility and potentially impacting advertiser competition. This change has been confirmed by Google Ads liaison.",
            "Links": [
                "https://twitter.com/rustybrick/status/1824144273568305176",
                "https://twitter.com/rustybrick/status/1824043609903321254"
            ]
        }
    ],
    "date": "2024-08-16"
}