{
    "data": [
        {
            "Title": "Google Cracks Down on Explicit Deepfakes",
            "Category": "AI & Search",
            "Description": "Google is taking steps to combat the spread of nonconsensual, sexually explicit deepfakes. The company announced updates to its search algorithms and policies to demote such content in search results. Google is also expanding its \"About this image\" feature to provide more context about images, including those that may be deepfakes.",
            "Links": [
                "https://www.nbcnews.com/tech/tech-news/google-announces-news-steps-combat-sexually-explicit-deepfakes-rcna164560",
                "https://www.wired.com/story/google-tries-to-crack-down-on-explicit-deepfakes/",
                "https://www.theverge.com/2024/7/31/24210283/google-search-update-remove-explicit-deepfakes-results"
            ]
        },
        {
            "Title": "Reddit Demands Payment for AI Search Data",
            "Category": "AI & Search",
            "Description": "Reddit CEO Steve Huffman is demanding that Microsoft pay for using the platform's data to train its AI search engine, Bing. Huffman argues that Microsoft, along with other companies like Anthropic and Perplexity, have been scraping Reddit's data without permission, causing the company significant expense in blocking them.",
            "Links": [
                "https://www.theverge.com/2024/7/31/24210565/reddit-microsoft-anthropic-perplexity-pay-ai-search"
            ]
        },
        {
            "Title": "Perplexity to Share Ad Revenue with Publishers",
            "Category": "AI & Search",
            "Description": "Following accusations of plagiarism, AI search engine Perplexity is launching a program to share ad revenue with publishing partners. When Perplexity features content from these publishers in response to user queries, the publishers will receive a portion of the ad revenue generated.",
            "Links": [
                "https://twitter.com/aleyda/status/1818395567090762142",
                "https://digiday.com/media/perplexitys-new-rev-share-publisher-program-is-live-but-not-all-pubs-are-sold/"
            ]
        },
        {
            "Title": "Wix Launches AI-Powered Blog Post Writer",
            "Category": "AI & Content Creation",
            "Description": "Website builder Wix has introduced an AI tool that can write entire blog posts, including SEO keywords. This feature aims to simplify content creation for Wix users and potentially improve their search engine rankings.",
            "Links": [
                "https://www.theverge.com/2024/7/31/24210304/wix-ai-website-builder-seo-blog-posts"
            ]
        },
        {
            "Title": "Microsoft Highlights AI's Role in Combating Election Misinformation and Deepfakes",
            "Category": "AI & Society",
            "Description": "A new report from Microsoft emphasizes the challenges and opportunities presented by AI in addressing election misinformation and harmful deepfakes. The report highlights the need to protect people from the potential dangers of AI-generated content, particularly in the context of elections.",
            "Links": [
                "https://digiday.com/media/microsoft-report-highlights-ai-efforts-around-election-misinformation-and-harmful-deepfakes/"
            ]
        },
        {
            "Title": "Google Search Console Performance Report Filter Bug to Be Fixed",
            "Category": "SEO & Analytics",
            "Description": "Google has acknowledged a bug in the Google Search Console Performance report that prevents users from seeing all filtering options when using the \"Search Appearance\" filter. The company has stated that the bug will be fixed soon.",
            "Links": [
                "https://www.seroundtable.com/google-search-console-performance-report-search-appearance-filter-bug-37811.html",
                "https://twitter.com/rustybrick/status/1818342292677374041"
            ]
        },
        {
            "Title": "Google's Mobile-First Indexing and m-dot URLs",
            "Category": "SEO & Analytics",
            "Description": "Despite Google's full transition to mobile-first indexing, John Mueller advises against switching m-dot URLs to be the canonical URL. He explains that this is due to established practices and potential issues for large websites if Google were to change its approach.",
            "Links": [
                "https://www.seroundtable.com/google-m-dot-urls-the-canonical-37809.html",
                "https://twitter.com/rustybrick/status/1818357392029192677"
            ]
        }
    ],
    "date": "2024-08-01"
}