{
    "data": [
        {
            "Title": "OpenAI Launches SearchGPT, an AI-Powered Search Engine Prototype",
            "Category": "AI in Search",
            "Description": "OpenAI is testing SearchGPT, an AI-powered search engine prototype that aims to provide fast, timely, and relevant answers with clear sources. The prototype leverages OpenAI's language models to summarize information from websites, including news sites. While initially a separate product, OpenAI plans to integrate SearchGPT into its main ChatGPT service.",
            "Links": [
                "https://twitter.com/aleyda/status/1816574102255341699",
                "https://twitter.com/glenngabe/status/1816551027941814471",
                "https://twitter.com/rustybrick/status/1816535811619487926"
            ]
        },
        {
            "Title": "Microsoft Bing Introduces AI-Powered Generative Search Experience",
            "Category": "AI in Search",
            "Description": "Microsoft has launched Bing generative search, integrating AI-powered summaries directly into search results. This feature, similar to Google's AI Overviews, aims to provide users with concise and informative answers. The new search experience combines large language models (LLMs) and small language models (SLMs) with Bing's traditional search results to create a more efficient and user-friendly layout.",
            "Links": [
                "https://www.theregister.com/2024/07/25/microsoft_generative_search_bing/",
                "https://www.techspot.com/news/103967-microsoft-rolling-out-bing-generative-search-counter-google.html",
                "https://www.seroundtable.com/bing-generative-search-experience-37789.html"
            ]
        },
        {
            "Title": "Reddit Blocks Bing and Other Search Engines, Citing AI Training Concerns",
            "Category": "Search Engine Access and AI",
            "Description": "Reddit has updated its robots.txt file to restrict most search engines and AI crawlers from accessing its content, including Microsoft Bing. This move, which Reddit claims is unrelated to its recent partnership with Google, effectively prevents these search engines from indexing and potentially using Reddit data for AI training purposes. While Google Search remains unaffected, the decision highlights the growing concerns surrounding data licensing and access for AI development.",
            "Links": [
                "https://gizmodo.com/reddit-institutes-pay-to-play-blockade-against-microsoft-bing-2000478921",
                "https://www.seroundtable.com/reddit-blocked-bing-search-37791.html",
                "https://searchengineland.com/microsoft-confirms-reddit-blocked-bing-search-444385"
            ]
        },
        {
            "Title": "Google to Test Ads Within AI Overviews",
            "Category": "AI in Search",
            "Description": "Google plans to test incorporating ads directly within its AI Overviews, aiming to provide advertisers with new opportunities to reach users. While ads above and below AI Overviews have been present, this move signifies a shift towards a more integrated advertising approach within AI-generated search results.",
            "Links": [
                "https://twitter.com/rustybrick/status/1816545452013056190",
                "https://twitter.com/rustybrick/status/1816485054358659138",
                "https://twitter.com/glenngabe/status/1816089586939937002"
            ]
        },
        {
            "Title": "Google Reports Strong Q2 2024 Earnings, with Search Revenue Growth and Cloud Milestone",
            "Category": "Google Earnings and Performance",
            "Description": "Alphabet, Google's parent company, announced strong Q2 2024 earnings, with Google Search revenue growing by 14% year-over-year. The company also reported that its Cloud division surpassed $10 billion in quarterly revenue and achieved $1 billion in operating profit for the first time. Despite missing YouTube ad revenue expectations, Alphabet's overall revenue increased by 14%, driven by search and cloud performance.",
            "Links": [
                "https://twitter.com/aleyda/status/1816488815319482406",
                "https://twitter.com/glenngabe/status/1816077859435262039",
                "https://www.searchenginejournal.com/google-search-revenue-grows-14-in-q2-2024/522922/"
            ]
        }
    ],
    "date": "2024-07-26"
}