{
    "data": [
        {
            "Title": "Google Found Guilty of Monopolization in US Antitrust Case",
            "Category": "Legal",
            "Description": "A US federal judge ruled that \"Google is a monopolist, and it has acted as one to maintain its monopoly.\"  The ruling could lead to a breakup of Google or serious constraints for the search company.",
            "Links": [
                "https://www.seroundtable.com/google-is-a-monopoly-fed-rules-37850.html",
                "https://twitter.com/rustybrick/status/1820553419494432853",
                "https://twitter.com/glenngabe/status/1820536559772529134"
            ]
        },
        {
            "Title": "Apple Declines Bing as Default Search Engine, Citing Quality and Revenue Concerns",
            "Category": "Search",
            "Description": "Despite Microsoft's offer to provide Bing for free, Apple has refused to replace Google as the default search engine on Safari.  Apple cited Bing's poor search quality and the potential for significant revenue loss as reasons for the decision.",
            "Links": [
                "https://www.theverge.com/24214574/google-antitrust-search-apple-microsoft-bing-ruling-breakdown",
                "https://mashable.com/article/apple-on-bing-antitrust-case",
                "http://gigazine.net/gsc_news/en/20240807-apple-safari-search-engine-google-than-bing/"
            ]
        },
        {
            "Title": "Microsoft Sees Opportunity for Bing Following Google's Antitrust Loss",
            "Category": "Search",
            "Description": "After a federal judge ruled Google a monopoly, senior managers at Microsoft's Bing search engine expressed optimism about potential gains for their platform.",
            "Links": [
                "https://www.theinformation.com/articles/after-google-antitrust-loss-some-at-microsoft-see-an-opening-for-bing"
            ]
        },
        {
            "Title": "Google Search Console Launches \"Recommendations\" Feature",
            "Category": "SEO",
            "Description": "Google Search Console is rolling out a new experimental feature called \"Recommendations.\" This feature aims to simplify website optimization by providing personalized SEO suggestions based on data within Search Console.",
            "Links": [
                "https://www.seroundtable.com/google-search-console-recommendations-37847.html",
                "https://searchengineland.com/google-search-console-launches-recommendations-444711",
                "https://twitter.com/rustybrick/status/1820471831989768245"
            ]
        },
        {
            "Title": "Google Ads to Migrate Smart Campaigns to Performance Max",
            "Category": "Advertising",
            "Description": "Google Ads has announced that it will be transitioning the functionality of Smart Campaigns into Performance Max campaigns in the coming months. The company claims that Performance Max offers all the benefits of Smart Campaigns and more.",
            "Links": [
                "https://www.seroundtable.com/google-ads-migrating-smart-campaigns-to-performance-max-37853.html",
                "https://twitter.com/rustybrick/status/1821144506747814189"
            ]
        },
        {
            "Title": "Google Trends Unveils Redesigned Trending Now Page",
            "Category": "SEO",
            "Description": "Google Trends has rolled out a new design for its trending now page, offering users more filter options and providing additional keyword data on a single page.",
            "Links": [
                "https://www.seroundtable.com/google-trends-new-trending-now-design-37844.html",
                "https://twitter.com/rustybrick/status/1820782118919876757"
            ]
        },
        {
            "Title": "Google Business Profiles Tests \"See Also\" Carousel, Featuring Competitors on Local Listings",
            "Category": "Local Search",
            "Description": "Google is experimenting with a \"see also\" carousel on Google Business Profiles, potentially displaying competitors directly beneath a business's local listing, even when users search for that specific company name.",
            "Links": [
                "https://www.seroundtable.com/google-business-profiles-see-also-37849.html",
                "https://twitter.com/rustybrick/status/1820779602400498111"
            ]
        },
        {
            "Title": "Google Ads Reporting Outage Caused by Ads Serving Products from Other Merchants",
            "Category": "Advertising",
            "Description": "The Google Ads reporting outage on August 1st was intentional, caused by Google serving ads for products from different Google Merchant Center accounts. This issue affected ad spend, privacy, and data for advertisers. Google plans to issue credits to impacted advertisers.",
            "Links": [
                "https://www.seroundtable.com/google-served-ads-for-products-others-issue-credits-37846.html",
                "https://twitter.com/rustybrick/status/1820784635216802246"
            ]
        },
        {
            "Title": "Elon Musk's X Files Antitrust Lawsuit Against GARM and Advertisers",
            "Category": "Legal",
            "Description": "Elon Musk's X (formerly Twitter) has filed a federal antitrust lawsuit against the Global Alliance for Responsible Media (GARM) and its members, including CVS Health, Mars, Orsted, and Unilever. The lawsuit alleges antitrust activity related to advertising practices.",
            "Links": [
                "https://digiday.com/marketing/x-files-federal-antitrust-suit-against-garm-wfa-cvs-health-mars-orsted-unilever/"
            ]
        },
        {
            "Title": "SEO Scam: Paying Google to Fix Search Rankings",
            "Category": "SEO",
            "Description": "A new SEO scam is circulating, falsely claiming that users can pay Google to improve their search rankings. Google's John Mueller has confirmed this is a scam and that Google does not offer such a service.",
            "Links": [
                "https://www.seroundtable.com/seo-scam-pay-google-37848.html",
                "https://twitter.com/rustybrick/status/1820787151811809529"
            ]
        }
    ],
    "date": "2024-08-07"
}